EPLab/Eco_AccBabyMonitor/BaseStation/FreeScale/Drivers_NE64/MC9S12NE64.h
extern volatile MISCSTR _MISC @(REG_BASE + 0x00000013);
#define MISC _MISC.Byte
#define MISC_ROMON _MISC.Bits.ROMON
#define MISC_ROMHM _MISC.Bits.ROMHM
#define MISC_EXSTR0 _MISC.Bits.EXSTR0
#define MISC_EXSTR1 _MISC.Bits.EXSTR1
#define MISC_EXSTR _MISC.MergedBits.grpEXSTR

#define MISC_ROMON_MASK  1
#define MISC_ROMHM_MASK  2
#define MISC_EXSTR0_MASK  4
#define MISC_EXSTR1_MASK  8
#define MISC_EXSTR_MASK  12
#define MISC_EXSTR_BITNUM  2


/*** MTST0 - MTST0; 0x00000014 ***/
typedef union {
  byte Byte;
  struct {
    byte BIT0        :1;                                       /* MTST0 Bit 0 */
    byte BIT1        :1;                                       /* MTST0 Bit 1 */
    byte BIT2        :1;                                       /* MTST0 Bit 2 */
    byte BIT3        :1;                                       /* MTST0 Bit 3 */
    byte BIT4        :1;                                       /* MTST0 Bit 4 */
    byte BIT5        :1;                                       /* MTST0 Bit 5 */
    byte BIT6        :1;                                       /* MTST0 Bit 6 */
    byte BIT7        :1;                                       /* MTST0 Bit 7 */
  } Bits;
  struct {
    byte grpBIT  :8;
  } MergedBits;
} MTST0STR;
extern volatile MTST0STR _MTST0 @(REG_BASE + 0x00000014);
#define MTST0 _MTST0.Byte
#define MTST0_BIT0 _MTST0.Bits.BIT0
#define MTST0_BIT1 _MTST0.Bits.BIT1
#define MTST0_BIT2 _MTST0.Bits.BIT2
#define MTST0_BIT3 _MTST0.Bits.BIT3
#define MTST0_BIT4 _MTST0.Bits.BIT4
#define MTST0_BIT5 _MTST0.Bits.BIT5
#define MTST0_BIT6 _MTST0.Bits.BIT6
#define MTST0_BIT7 _MTST0.Bits.BIT7
#define MTST0_BIT _MTST0.MergedBits.grpBIT

#define MTST0_BIT0_MASK  1
#define MTST0_BIT1_MASK  2
#define MTST0_BIT2_MASK  4
#define MTST0_BIT3_MASK  8
#define MTST0_BIT4_MASK  16
#define MTST0_BIT5_MASK  32
#define MTST0_BIT6_MASK  64
#define MTST0_BIT7_MASK  128
#define MTST0_BIT_MASK  255
#define MTST0_BIT_BITNUM  0


/*** ITCR - Interrupt Test Control Register; 0x00000015 ***/
typedef union {
  byte Byte;
  struct {
    byte ADR0        :1;                                       /* Test register select Bit 0 */
    byte ADR1        :1;                                       /* Test register select Bit 1 */
    byte ADR2        :1;                                       /* Test register select Bit 2 */
    byte ADR3        :1;                                       /* Test register select Bit 3 */
    byte WRTINT      :1;                                       /* Write to the Interrupt Test Registers */
    byte             :1; 
    byte             :1; 
    byte             :1; 
  } Bits;
  struct {
    byte grpADR  :4;
    byte         :1;
    byte         :1;
    byte         :1;
    byte         :1;
  } MergedBits;
} ITCRSTR;
extern volatile ITCRSTR _ITCR @(REG_BASE + 0x00000015);
#define ITCR _ITCR.Byte
#define ITCR_ADR0 _ITCR.Bits.ADR0
#define ITCR_ADR1 _ITCR.Bits.ADR1
#define ITCR_ADR2 _ITCR.Bits.ADR2
#define ITCR_ADR3 _ITCR.Bits.ADR3
#define ITCR_WRTINT _ITCR.Bits.WRTINT
#define ITCR_ADR _ITCR.MergedBits.grpADR

#define ITCR_ADR0_MASK  1
#define ITCR_ADR1_MASK  2
#define ITCR_ADR2_MASK  4
#define ITCR_ADR3_MASK  8
#define ITCR_WRTINT_MASK  16
#define ITCR_ADR_MASK  15
#define ITCR_ADR_BITNUM  0


/*** ITEST - Interrupt Test Register; 0x00000016 ***/
typedef union {
  byte Byte;
  struct {
    byte INT0        :1;                                       /* Interrupt Test Register Bit 0 */
    byte INT2        :1;                                       /* Interrupt Test Register Bit 1 */
    byte INT4        :1;                                       /* Interrupt Test Register Bit 2 */
    byte INT6        :1;                                       /* Interrupt Test Register Bit 3 */
    byte INT8        :1;                                       /* Interrupt Test Register Bit 4 */
    byte INTA        :1;                                       /* Interrupt Test Register Bit 5 */
    byte INTC        :1;                                       /* Interrupt Test Register Bit 6 */
    byte INTE        :1;                                       /* Interrupt Test Register Bit 7 */
  } Bits;
} ITESTSTR;
extern volatile ITESTSTR _ITEST @(REG_BASE + 0x00000016);
#define ITEST _ITEST.Byte
#define ITEST_INT0 _ITEST.Bits.INT0
#define ITEST_INT2 _ITEST.Bits.INT2
#define ITEST_INT4 _ITEST.Bits.INT4
#define ITEST_INT6 _ITEST.Bits.INT6
#define ITEST_INT8 _ITEST.Bits.INT8
#define ITEST_INTA _ITEST.Bits.INTA
#define ITEST_INTC _ITEST.Bits.INTC
#define ITEST_INTE _ITEST.Bits.INTE

#define ITEST_INT0_MASK  1
#define ITEST_INT2_MASK  2
#define ITEST_INT4_MASK  4
#define ITEST_INT6_MASK  8
#define ITEST_INT8_MASK  16
#define ITEST_INTA_MASK  32
#define ITEST_INTC_MASK  64
#define ITEST_INTE_MASK  128


/*** MTST1 - MTST1; 0x00000017 ***/
typedef union {
  byte Byte;
  struct {
    byte BIT0        :1;                                       /* MTST1 Bit 0 */
    byte BIT1        :1;                                       /* MTST1 Bit 1 */
    byte BIT2        :1;                                       /* MTST1 Bit 2 */
    byte BIT3        :1;                                       /* MTST1 Bit 3 */
    byte BIT4        :1;                                       /* MTST1 Bit 4 */
    byte BIT5        :1;                                       /* MTST1 Bit 5 */
    byte BIT6        :1;                                       /* MTST1 Bit 6 */
    byte BIT7        :1;                                       /* MTST1 Bit 7 */
  } Bits;
  struct {
    byte grpBIT  :8;
  } MergedBits;
} MTST1STR;
extern volatile MTST1STR _MTST1 @(REG_BASE + 0x00000017);
#define MTST1 _MTST1.Byte
#define MTST1_BIT0 _MTST1.Bits.BIT0
#define MTST1_BIT1 _MTST1.Bits.BIT1
#define MTST1_BIT2 _MTST1.Bits.BIT2
#define MTST1_BIT3 _MTST1.Bits.BIT3
#define MTST1_BIT4 _MTST1.Bits.BIT4
#define MTST1_BIT5 _MTST1.Bits.BIT5
#define MTST1_BIT6 _MTST1.Bits.BIT6
#define MTST1_BIT7 _MTST1.Bits.BIT7
#define MTST1_BIT _MTST1.MergedBits.grpBIT

#define MTST1_BIT0_MASK  1
#define MTST1_BIT1_MASK  2
#define MTST1_BIT2_MASK  4
#define MTST1_BIT3_MASK  8
#define MTST1_BIT4_MASK  16
#define MTST1_BIT5_MASK  32
#define MTST1_BIT6_MASK  64
#define MTST1_BIT7_MASK  128
#define MTST1_BIT_MASK  255
#define MTST1_BIT_BITNUM  0


/*** PARTIDH - Part ID Register High; 0x0000001A ***/
typedef union {
  byte Byte;
  struct {
    byte ID8         :1;                                       /* Part ID Register Bit 8 */
    byte ID9         :1;                                       /* Part ID Register Bit 9 */
    byte ID10        :1;                                       /* Part ID Register Bit 10 */
    byte ID11        :1;                                       /* Part ID Register Bit 11 */
    byte ID12        :1;                                       /* Part ID Register Bit 12 */
    byte ID13        :1;                                       /* Part ID Register Bit 13 */
    byte ID14        :1;                                       /* Part ID Register Bit 14 */
    byte ID15        :1;                                       /* Part ID Register Bit 15 */
  } Bits;
  struct {
    byte grpID_8 :8;
  } MergedBits;
} PARTIDHSTR;
extern volatile PARTIDHSTR _PARTIDH @(REG_BASE + 0x0000001A);
#define PARTIDH _PARTIDH.Byte
#define PARTIDH_ID8 _PARTIDH.Bits.ID8
#define PARTIDH_ID9 _PARTIDH.Bits.ID9
#define PARTIDH_ID10 _PARTIDH.Bits.ID10
#define PARTIDH_ID11 _PARTIDH.Bits.ID11
#define PARTIDH_ID12 _PARTIDH.Bits.ID12
#define PARTIDH_ID13 _PARTIDH.Bits.ID13
#define PARTIDH_ID14 _PARTIDH.Bits.ID14
#define PARTIDH_ID15 _PARTIDH.Bits.ID15
#define PARTIDH_ID_8 _PARTIDH.MergedBits.grpID_8
#define PARTIDH_ID PARTIDH_ID_8

#define PARTIDH_ID8_MASK  1
#define PARTIDH_ID9_MASK  2
#define PARTIDH_ID10_MASK  4
#define PARTIDH_ID11_MASK  8
#define PARTIDH_ID12_MASK  16
#define PARTIDH_ID13_MASK  32
#define PARTIDH_ID14_MASK  64
#define PARTIDH_ID15_MASK  128
#define PARTIDH_ID_8_MASK  255
#define PARTIDH_ID_8_BITNUM  0


/*** PARTIDL - Part ID Register Lw; 0x0000001B ***/
typedef union {
  byte Byte;
  struct {
    byte ID0         :1;                                       /* Part ID Register Bit 0 */
    byte ID1         :1;                                       /* Part ID Register Bit 1 */
    byte ID2         :1;                                       /* Part ID Register Bit 2 */
    byte ID3         :1;                                       /* Part ID Register Bit 3 */
    byte ID4         :1;                                       /* Part ID Register Bit 4 */
    byte ID5         :1;                                       /* Part ID Register Bit 5 */
    byte ID6         :1;                                       /* Part ID Register Bit 6 */
    byte ID7         :1;                                       /* Part ID Register Bit 7 */
  } Bits;
  struct {
    byte grpID   :8;
  } MergedBits;
} PARTIDLSTR;
