EPLab/Eco_AccBabyMonitor/BaseStation/FreeScale/Drivers_NE64/MC9S12NE64.h
  struct {
    word BIT0        :1;                                       /* Trace Buffer Data Bit 0 */
    word BIT1        :1;                                       /* Trace Buffer Data Bit 1 */
    word BIT2        :1;                                       /* Trace Buffer Data Bit 2 */
    word BIT3        :1;                                       /* Trace Buffer Data Bit 3 */
    word BIT4        :1;                                       /* Trace Buffer Data Bit 4 */
    word BIT5        :1;                                       /* Trace Buffer Data Bit 5 */
    word BIT6        :1;                                       /* Trace Buffer Data Bit 6 */
    word BIT7        :1;                                       /* Trace Buffer Data Bit 7 */
    word BIT8        :1;                                       /* Trace Buffer Data Bit 8 */
    word BIT9        :1;                                       /* Trace Buffer Data Bit 9 */
    word BIT10       :1;                                       /* Trace Buffer Data Bit 10 */
    word BIT11       :1;                                       /* Trace Buffer Data Bit 11 */
    word BIT12       :1;                                       /* Trace Buffer Data Bit 12 */
    word BIT13       :1;                                       /* Trace Buffer Data Bit 13 */
    word BIT14       :1;                                       /* Trace Buffer Data Bit 14 */
    word BIT15       :1;                                       /* Trace Buffer Data Bit 15 */
  } Bits;
  struct {
    word grpBIT  :16;
  } MergedBits;
} DBGTBSTR;
extern volatile DBGTBSTR _DBGTB @(REG_BASE + 0x00000022);
#define DBGTB _DBGTB.Word
#define DBGTB_BIT0 _DBGTB.Bits.BIT0
#define DBGTB_BIT1 _DBGTB.Bits.BIT1
#define DBGTB_BIT2 _DBGTB.Bits.BIT2
#define DBGTB_BIT3 _DBGTB.Bits.BIT3
#define DBGTB_BIT4 _DBGTB.Bits.BIT4
#define DBGTB_BIT5 _DBGTB.Bits.BIT5
#define DBGTB_BIT6 _DBGTB.Bits.BIT6
#define DBGTB_BIT7 _DBGTB.Bits.BIT7
#define DBGTB_BIT8 _DBGTB.Bits.BIT8
#define DBGTB_BIT9 _DBGTB.Bits.BIT9
#define DBGTB_BIT10 _DBGTB.Bits.BIT10
#define DBGTB_BIT11 _DBGTB.Bits.BIT11
#define DBGTB_BIT12 _DBGTB.Bits.BIT12
#define DBGTB_BIT13 _DBGTB.Bits.BIT13
#define DBGTB_BIT14 _DBGTB.Bits.BIT14
#define DBGTB_BIT15 _DBGTB.Bits.BIT15
#define DBGTB_BIT _DBGTB.MergedBits.grpBIT

#define DBGTB_BIT0_MASK  1
#define DBGTB_BIT1_MASK  2
#define DBGTB_BIT2_MASK  4
#define DBGTB_BIT3_MASK  8
#define DBGTB_BIT4_MASK  16
#define DBGTB_BIT5_MASK  32
#define DBGTB_BIT6_MASK  64
#define DBGTB_BIT7_MASK  128
#define DBGTB_BIT8_MASK  256
#define DBGTB_BIT9_MASK  512
#define DBGTB_BIT10_MASK  1024
#define DBGTB_BIT11_MASK  2048
#define DBGTB_BIT12_MASK  4096
#define DBGTB_BIT13_MASK  8192
#define DBGTB_BIT14_MASK  16384
#define DBGTB_BIT15_MASK  32768
#define DBGTB_BIT_MASK  65535
#define DBGTB_BIT_BITNUM  0


/*** DBGCNT - Debug Count Register; 0x00000024 ***/
typedef union {
  byte Byte;
  struct {
    byte CNT0        :1;                                       /* Count Value, bit 0 */
    byte CNT1        :1;                                       /* Count Value, bit 1 */
    byte CNT2        :1;                                       /* Count Value, bit 2 */
    byte CNT3        :1;                                       /* Count Value, bit 3 */
    byte CNT4        :1;                                       /* Count Value, bit 4 */
    byte CNT5        :1;                                       /* Count Value, bit 5 */
    byte             :1; 
    byte TBF         :1;                                       /* Trace Buffer Full */
  } Bits;
  struct {
    byte grpCNT  :6;
    byte         :1;
    byte         :1;
  } MergedBits;
} DBGCNTSTR;
extern volatile DBGCNTSTR _DBGCNT @(REG_BASE + 0x00000024);
#define DBGCNT _DBGCNT.Byte
#define DBGCNT_CNT0 _DBGCNT.Bits.CNT0
#define DBGCNT_CNT1 _DBGCNT.Bits.CNT1
#define DBGCNT_CNT2 _DBGCNT.Bits.CNT2
#define DBGCNT_CNT3 _DBGCNT.Bits.CNT3
#define DBGCNT_CNT4 _DBGCNT.Bits.CNT4
#define DBGCNT_CNT5 _DBGCNT.Bits.CNT5
#define DBGCNT_TBF _DBGCNT.Bits.TBF
#define DBGCNT_CNT _DBGCNT.MergedBits.grpCNT

#define DBGCNT_CNT0_MASK  1
#define DBGCNT_CNT1_MASK  2
#define DBGCNT_CNT2_MASK  4
#define DBGCNT_CNT3_MASK  8
#define DBGCNT_CNT4_MASK  16
#define DBGCNT_CNT5_MASK  32
#define DBGCNT_TBF_MASK  128
#define DBGCNT_CNT_MASK  63
#define DBGCNT_CNT_BITNUM  0


/*** DBGCCX - Debug Comparator C Extended Register; 0x00000025 ***/
typedef union {
  byte Byte;
  struct {
    byte EXTCMP0     :1;                                       /* Comparator C Extended Compare Bits, bit 0 */
    byte EXTCMP1     :1;                                       /* Comparator C Extended Compare Bits, bit 1 */
    byte EXTCMP2     :1;                                       /* Comparator C Extended Compare Bits, bit 2 */
    byte EXTCMP3     :1;                                       /* Comparator C Extended Compare Bits, bit 3 */
    byte EXTCMP4     :1;                                       /* Comparator C Extended Compare Bits, bit 4 */
    byte EXTCMP5     :1;                                       /* Comparator C Extended Compare Bits, bit 5 */
    byte PAGSEL0     :1;                                       /* Page Selector Field, bit 0 */
    byte PAGSEL1     :1;                                       /* Page Selector Field, bit 1 */
  } Bits;
  struct {
    byte grpEXTCMP :6;
    byte grpPAGSEL :2;
  } MergedBits;
} DBGCCXSTR;
extern volatile DBGCCXSTR _DBGCCX @(REG_BASE + 0x00000025);
#define DBGCCX _DBGCCX.Byte
#define DBGCCX_EXTCMP0 _DBGCCX.Bits.EXTCMP0
#define DBGCCX_EXTCMP1 _DBGCCX.Bits.EXTCMP1
#define DBGCCX_EXTCMP2 _DBGCCX.Bits.EXTCMP2
#define DBGCCX_EXTCMP3 _DBGCCX.Bits.EXTCMP3
#define DBGCCX_EXTCMP4 _DBGCCX.Bits.EXTCMP4
#define DBGCCX_EXTCMP5 _DBGCCX.Bits.EXTCMP5
#define DBGCCX_PAGSEL0 _DBGCCX.Bits.PAGSEL0
#define DBGCCX_PAGSEL1 _DBGCCX.Bits.PAGSEL1
#define DBGCCX_EXTCMP _DBGCCX.MergedBits.grpEXTCMP
#define DBGCCX_PAGSEL _DBGCCX.MergedBits.grpPAGSEL

#define DBGCCX_EXTCMP0_MASK  1
#define DBGCCX_EXTCMP1_MASK  2
#define DBGCCX_EXTCMP2_MASK  4
#define DBGCCX_EXTCMP3_MASK  8
#define DBGCCX_EXTCMP4_MASK  16
#define DBGCCX_EXTCMP5_MASK  32
#define DBGCCX_PAGSEL0_MASK  64
#define DBGCCX_PAGSEL1_MASK  128
#define DBGCCX_EXTCMP_MASK  63
#define DBGCCX_EXTCMP_BITNUM  0
#define DBGCCX_PAGSEL_MASK  192
#define DBGCCX_PAGSEL_BITNUM  6


/*** DBGCC - Debug Comparator C Register; 0x00000026 ***/
typedef union {
  word Word;
   /* Overlapped registers: */
  struct {
    /*** DBGCCH - Debug Comparator C Register High; 0x00000026 ***/
    union {
      byte Byte;
      struct {
        byte BIT8        :1;                                       /* Comparator C Compare Bit 8 */
        byte BIT9        :1;                                       /* Comparator C Compare Bit 9 */
        byte BIT10       :1;                                       /* Comparator C Compare Bit 10 */
        byte BIT11       :1;                                       /* Comparator C Compare Bit 11 */
        byte BIT12       :1;                                       /* Comparator C Compare Bit 12 */
        byte BIT13       :1;                                       /* Comparator C Compare Bit 13 */
        byte BIT14       :1;                                       /* Comparator C Compare Bit 14 */
        byte BIT15       :1;                                       /* Comparator C Compare Bit 15 */
      } Bits;
      struct {
        byte grpBIT_8 :8;
      } MergedBits;
    } DBGCCHSTR;
    #define DBGCCH _DBGCC.Overlap_STR.DBGCCHSTR.Byte
    #define DBGCCH_BIT8 _DBGCC.Overlap_STR.DBGCCHSTR.Bits.BIT8
    #define DBGCCH_BIT9 _DBGCC.Overlap_STR.DBGCCHSTR.Bits.BIT9
    #define DBGCCH_BIT10 _DBGCC.Overlap_STR.DBGCCHSTR.Bits.BIT10
    #define DBGCCH_BIT11 _DBGCC.Overlap_STR.DBGCCHSTR.Bits.BIT11
    #define DBGCCH_BIT12 _DBGCC.Overlap_STR.DBGCCHSTR.Bits.BIT12
    #define DBGCCH_BIT13 _DBGCC.Overlap_STR.DBGCCHSTR.Bits.BIT13
    #define DBGCCH_BIT14 _DBGCC.Overlap_STR.DBGCCHSTR.Bits.BIT14
    #define DBGCCH_BIT15 _DBGCC.Overlap_STR.DBGCCHSTR.Bits.BIT15
    
    #define DBGCCH_BIT_8 _DBGCC.Overlap_STR.DBGCCHSTR.MergedBits.grpBIT_8
    #define DBGCCH_BIT DBGCCH_BIT_8
    
    #define DBGCCH_BIT8_MASK  1
    #define DBGCCH_BIT9_MASK  2
    #define DBGCCH_BIT10_MASK  4
    #define DBGCCH_BIT11_MASK  8
    #define DBGCCH_BIT12_MASK  16
    #define DBGCCH_BIT13_MASK  32
    #define DBGCCH_BIT14_MASK  64
    #define DBGCCH_BIT15_MASK  128
    #define DBGCCH_BIT_8_MASK  255
    #define DBGCCH_BIT_8_BITNUM  0


