EPLab/Eco_AccBabyMonitor/BaseStation/FreeScale/Drivers_NE64/MC9S12NE64.h
    /*** DBGCCL - Debug Comparator C Register Low; 0x00000027 ***/
    union {
      byte Byte;
      struct {
        byte BIT0        :1;                                       /* Comparator C Compare Bit 0 */
        byte BIT1        :1;                                       /* Comparator C Compare Bit 1 */
        byte BIT2        :1;                                       /* Comparator C Compare Bit 2 */
        byte BIT3        :1;                                       /* Comparator C Compare Bit 3 */
        byte BIT4        :1;                                       /* Comparator C Compare Bit 4 */
        byte BIT5        :1;                                       /* Comparator C Compare Bit 5 */
        byte BIT6        :1;                                       /* Comparator C Compare Bit 6 */
        byte BIT7        :1;                                       /* Comparator C Compare Bit 7 */
      } Bits;
      struct {
        byte grpBIT :8;
      } MergedBits;
    } DBGCCLSTR;
    #define DBGCCL _DBGCC.Overlap_STR.DBGCCLSTR.Byte
    #define DBGCCL_BIT0 _DBGCC.Overlap_STR.DBGCCLSTR.Bits.BIT0
    #define DBGCCL_BIT1 _DBGCC.Overlap_STR.DBGCCLSTR.Bits.BIT1
    #define DBGCCL_BIT2 _DBGCC.Overlap_STR.DBGCCLSTR.Bits.BIT2
    #define DBGCCL_BIT3 _DBGCC.Overlap_STR.DBGCCLSTR.Bits.BIT3
    #define DBGCCL_BIT4 _DBGCC.Overlap_STR.DBGCCLSTR.Bits.BIT4
    #define DBGCCL_BIT5 _DBGCC.Overlap_STR.DBGCCLSTR.Bits.BIT5
    #define DBGCCL_BIT6 _DBGCC.Overlap_STR.DBGCCLSTR.Bits.BIT6
    #define DBGCCL_BIT7 _DBGCC.Overlap_STR.DBGCCLSTR.Bits.BIT7
    
    #define DBGCCL_BIT _DBGCC.Overlap_STR.DBGCCLSTR.MergedBits.grpBIT
    
    #define DBGCCL_BIT0_MASK  1
    #define DBGCCL_BIT1_MASK  2
    #define DBGCCL_BIT2_MASK  4
    #define DBGCCL_BIT3_MASK  8
    #define DBGCCL_BIT4_MASK  16
    #define DBGCCL_BIT5_MASK  32
    #define DBGCCL_BIT6_MASK  64
    #define DBGCCL_BIT7_MASK  128
    #define DBGCCL_BIT_MASK  255
    #define DBGCCL_BIT_BITNUM  0

  } Overlap_STR;

  struct {
    word BIT0        :1;                                       /* Comparator C Compare Bit 0 */
    word BIT1        :1;                                       /* Comparator C Compare Bit 1 */
    word BIT2        :1;                                       /* Comparator C Compare Bit 2 */
    word BIT3        :1;                                       /* Comparator C Compare Bit 3 */
    word BIT4        :1;                                       /* Comparator C Compare Bit 4 */
    word BIT5        :1;                                       /* Comparator C Compare Bit 5 */
    word BIT6        :1;                                       /* Comparator C Compare Bit 6 */
    word BIT7        :1;                                       /* Comparator C Compare Bit 7 */
    word BIT8        :1;                                       /* Comparator C Compare Bit 8 */
    word BIT9        :1;                                       /* Comparator C Compare Bit 9 */
    word BIT10       :1;                                       /* Comparator C Compare Bit 10 */
    word BIT11       :1;                                       /* Comparator C Compare Bit 11 */
    word BIT12       :1;                                       /* Comparator C Compare Bit 12 */
    word BIT13       :1;                                       /* Comparator C Compare Bit 13 */
    word BIT14       :1;                                       /* Comparator C Compare Bit 14 */
    word BIT15       :1;                                       /* Comparator C Compare Bit 15 */
  } Bits;
  struct {
    word grpBIT  :16;
  } MergedBits;
} DBGCCSTR;
extern volatile DBGCCSTR _DBGCC @(REG_BASE + 0x00000026);
#define DBGCC _DBGCC.Word
#define DBGCC_BIT0 _DBGCC.Bits.BIT0
#define DBGCC_BIT1 _DBGCC.Bits.BIT1
#define DBGCC_BIT2 _DBGCC.Bits.BIT2
#define DBGCC_BIT3 _DBGCC.Bits.BIT3
#define DBGCC_BIT4 _DBGCC.Bits.BIT4
#define DBGCC_BIT5 _DBGCC.Bits.BIT5
#define DBGCC_BIT6 _DBGCC.Bits.BIT6
#define DBGCC_BIT7 _DBGCC.Bits.BIT7
#define DBGCC_BIT8 _DBGCC.Bits.BIT8
#define DBGCC_BIT9 _DBGCC.Bits.BIT9
#define DBGCC_BIT10 _DBGCC.Bits.BIT10
#define DBGCC_BIT11 _DBGCC.Bits.BIT11
#define DBGCC_BIT12 _DBGCC.Bits.BIT12
#define DBGCC_BIT13 _DBGCC.Bits.BIT13
#define DBGCC_BIT14 _DBGCC.Bits.BIT14
#define DBGCC_BIT15 _DBGCC.Bits.BIT15
#define DBGCC_BIT _DBGCC.MergedBits.grpBIT

#define DBGCC_BIT0_MASK  1
#define DBGCC_BIT1_MASK  2
#define DBGCC_BIT2_MASK  4
#define DBGCC_BIT3_MASK  8
#define DBGCC_BIT4_MASK  16
#define DBGCC_BIT5_MASK  32
#define DBGCC_BIT6_MASK  64
#define DBGCC_BIT7_MASK  128
#define DBGCC_BIT8_MASK  256
#define DBGCC_BIT9_MASK  512
#define DBGCC_BIT10_MASK  1024
#define DBGCC_BIT11_MASK  2048
#define DBGCC_BIT12_MASK  4096
#define DBGCC_BIT13_MASK  8192
#define DBGCC_BIT14_MASK  16384
#define DBGCC_BIT15_MASK  32768
#define DBGCC_BIT_MASK  65535
#define DBGCC_BIT_BITNUM  0


/*** DBGC2 - Debug Control Register 2; 0x00000028 ***/
typedef union {
  byte Byte;
  struct {
    byte RWC         :1;                                       /* Read/Write Comparator C Value Bit */
    byte RWCEN       :1;                                       /* Read/Write Comparator C Enable Bit */
    byte TAGC        :1;                                       /* Comparator C Tag Select */
    byte BKCEN       :1;                                       /* Breakpoint Comparator C Enable Bit */
    byte TAGAB       :1;                                       /* Comparator A/B Tag Select */
    byte BDM         :1;                                       /* Background Debug Mode Enable */
    byte FULL        :1;                                       /* Full Breakpoint Mode Enable */
    byte BKABEN      :1;                                       /* Breakpoint Using Comparator A and B Enable */
  } Bits;
} DBGC2STR;
extern volatile DBGC2STR _DBGC2 @(REG_BASE + 0x00000028);
#define DBGC2 _DBGC2.Byte
#define DBGC2_RWC _DBGC2.Bits.RWC
#define DBGC2_RWCEN _DBGC2.Bits.RWCEN
#define DBGC2_TAGC _DBGC2.Bits.TAGC
#define DBGC2_BKCEN _DBGC2.Bits.BKCEN
#define DBGC2_TAGAB _DBGC2.Bits.TAGAB
#define DBGC2_BDM _DBGC2.Bits.BDM
#define DBGC2_FULL _DBGC2.Bits.FULL
#define DBGC2_BKABEN _DBGC2.Bits.BKABEN

#define DBGC2_RWC_MASK  1
#define DBGC2_RWCEN_MASK  2
#define DBGC2_TAGC_MASK  4
#define DBGC2_BKCEN_MASK  8
#define DBGC2_TAGAB_MASK  16
#define DBGC2_BDM_MASK  32
#define DBGC2_FULL_MASK  64
#define DBGC2_BKABEN_MASK  128


/*** DBGC3 - Debug Control Register 3; 0x00000029 ***/
typedef union {
  byte Byte;
  struct {
    byte RWB         :1;                                       /* Read/Write Comparator B Value Bit */
    byte RWBEN       :1;                                       /* Read/Write Comparator B Enable Bit */
    byte RWA         :1;                                       /* Read/Write Comparator A Value Bit */
    byte RWAEN       :1;                                       /* Read/Write Comparator A Enable Bit */
    byte BKBMBL      :1;                                       /* Breakpoint Mask Low Byte for Second Address */
    byte BKBMBH      :1;                                       /* Breakpoint Mask High Byte for Second Address */
    byte BKAMBL      :1;                                       /* Breakpoint Mask Low Byte for First Address */
    byte BKAMBH      :1;                                       /* Breakpoint Mask High Byte for First Address */
  } Bits;
} DBGC3STR;
extern volatile DBGC3STR _DBGC3 @(REG_BASE + 0x00000029);
#define DBGC3 _DBGC3.Byte
#define DBGC3_RWB _DBGC3.Bits.RWB
#define DBGC3_RWBEN _DBGC3.Bits.RWBEN
#define DBGC3_RWA _DBGC3.Bits.RWA
#define DBGC3_RWAEN _DBGC3.Bits.RWAEN
#define DBGC3_BKBMBL _DBGC3.Bits.BKBMBL
#define DBGC3_BKBMBH _DBGC3.Bits.BKBMBH
#define DBGC3_BKAMBL _DBGC3.Bits.BKAMBL
#define DBGC3_BKAMBH _DBGC3.Bits.BKAMBH

#define DBGC3_RWB_MASK  1
#define DBGC3_RWBEN_MASK  2
#define DBGC3_RWA_MASK  4
#define DBGC3_RWAEN_MASK  8
#define DBGC3_BKBMBL_MASK  16
#define DBGC3_BKBMBH_MASK  32
#define DBGC3_BKAMBL_MASK  64
#define DBGC3_BKAMBH_MASK  128


/*** DBGCAX - Debug Comparator A Extended Register; 0x0000002A ***/
typedef union {
  byte Byte;
  struct {
    byte PAGSEL0     :1;                                       /* Page Selector Field, bit 0 */
    byte PAGSEL1     :1;                                       /* Page Selector Field, bit 1 */
    byte PAGSEL2     :1;                                       /* Page Selector Field, bit 2 */
    byte PAGSEL3     :1;                                       /* Page Selector Field, bit 3 */
    byte PAGSEL4     :1;                                       /* Page Selector Field, bit 4 */
    byte PAGSEL5     :1;                                       /* Page Selector Field, bit 5 */
    byte EXTCMP0     :1;                                       /* Comparator A Extended Compare Bits, bit 0 */
    byte EXTCMP1     :1;                                       /* Comparator A Extended Compare Bits, bit 1 */
  } Bits;
  struct {
    byte grpPAGSEL :6;
    byte grpEXTCMP :2;
  } MergedBits;
} DBGCAXSTR;
