EPLab/Eco_AccBabyMonitor/BaseStation/FreeScale/Drivers_NE64/MC9S12NE64.h
extern volatile DBGCAXSTR _DBGCAX @(REG_BASE + 0x0000002A);
#define DBGCAX _DBGCAX.Byte
#define DBGCAX_PAGSEL0 _DBGCAX.Bits.PAGSEL0
#define DBGCAX_PAGSEL1 _DBGCAX.Bits.PAGSEL1
#define DBGCAX_PAGSEL2 _DBGCAX.Bits.PAGSEL2
#define DBGCAX_PAGSEL3 _DBGCAX.Bits.PAGSEL3
#define DBGCAX_PAGSEL4 _DBGCAX.Bits.PAGSEL4
#define DBGCAX_PAGSEL5 _DBGCAX.Bits.PAGSEL5
#define DBGCAX_EXTCMP0 _DBGCAX.Bits.EXTCMP0
#define DBGCAX_EXTCMP1 _DBGCAX.Bits.EXTCMP1
#define DBGCAX_PAGSEL _DBGCAX.MergedBits.grpPAGSEL
#define DBGCAX_EXTCMP _DBGCAX.MergedBits.grpEXTCMP

#define DBGCAX_PAGSEL0_MASK  1
#define DBGCAX_PAGSEL1_MASK  2
#define DBGCAX_PAGSEL2_MASK  4
#define DBGCAX_PAGSEL3_MASK  8
#define DBGCAX_PAGSEL4_MASK  16
#define DBGCAX_PAGSEL5_MASK  32
#define DBGCAX_EXTCMP0_MASK  64
#define DBGCAX_EXTCMP1_MASK  128
#define DBGCAX_PAGSEL_MASK  63
#define DBGCAX_PAGSEL_BITNUM  0
#define DBGCAX_EXTCMP_MASK  192
#define DBGCAX_EXTCMP_BITNUM  6


/*** DBGCA - Debug Comparator A Register; 0x0000002B ***/
typedef union {
  word Word;
   /* Overlapped registers: */
  struct {
    /*** DBGCAH - Debug Comparator A Register High; 0x0000002B ***/
    union {
      byte Byte;
      struct {
        byte BIT8        :1;                                       /* Comparator A Compare Bit 8 */
        byte BIT9        :1;                                       /* Comparator A Compare Bit 9 */
        byte BIT10       :1;                                       /* Comparator A Compare Bit 10 */
        byte BIT11       :1;                                       /* Comparator A Compare Bit 11 */
        byte BIT12       :1;                                       /* Comparator A Compare Bit 12 */
        byte BIT13       :1;                                       /* Comparator A Compare Bit 13 */
        byte BIT14       :1;                                       /* Comparator A Compare Bit 14 */
        byte BIT15       :1;                                       /* Comparator A Compare Bit 15 */
      } Bits;
      struct {
        byte grpBIT_8 :8;
      } MergedBits;
    } DBGCAHSTR;
    #define DBGCAH _DBGCA.Overlap_STR.DBGCAHSTR.Byte
    #define DBGCAH_BIT8 _DBGCA.Overlap_STR.DBGCAHSTR.Bits.BIT8
    #define DBGCAH_BIT9 _DBGCA.Overlap_STR.DBGCAHSTR.Bits.BIT9
    #define DBGCAH_BIT10 _DBGCA.Overlap_STR.DBGCAHSTR.Bits.BIT10
    #define DBGCAH_BIT11 _DBGCA.Overlap_STR.DBGCAHSTR.Bits.BIT11
    #define DBGCAH_BIT12 _DBGCA.Overlap_STR.DBGCAHSTR.Bits.BIT12
    #define DBGCAH_BIT13 _DBGCA.Overlap_STR.DBGCAHSTR.Bits.BIT13
    #define DBGCAH_BIT14 _DBGCA.Overlap_STR.DBGCAHSTR.Bits.BIT14
    #define DBGCAH_BIT15 _DBGCA.Overlap_STR.DBGCAHSTR.Bits.BIT15
    
    #define DBGCAH_BIT_8 _DBGCA.Overlap_STR.DBGCAHSTR.MergedBits.grpBIT_8
    #define DBGCAH_BIT DBGCAH_BIT_8
    
    #define DBGCAH_BIT8_MASK  1
    #define DBGCAH_BIT9_MASK  2
    #define DBGCAH_BIT10_MASK  4
    #define DBGCAH_BIT11_MASK  8
    #define DBGCAH_BIT12_MASK  16
    #define DBGCAH_BIT13_MASK  32
    #define DBGCAH_BIT14_MASK  64
    #define DBGCAH_BIT15_MASK  128
    #define DBGCAH_BIT_8_MASK  255
    #define DBGCAH_BIT_8_BITNUM  0


    /*** DBGCAL - Debug Comparator A Register Low; 0x0000002C ***/
    union {
      byte Byte;
      struct {
        byte BIT0        :1;                                       /* Comparator A Compare Bit 0 */
        byte BIT1        :1;                                       /* Comparator A Compare Bit 1 */
        byte BIT2        :1;                                       /* Comparator A Compare Bit 2 */
        byte BIT3        :1;                                       /* Comparator A Compare Bit 3 */
        byte BIT4        :1;                                       /* Comparator A Compare Bit 4 */
        byte BIT5        :1;                                       /* Comparator A Compare Bit 5 */
        byte BIT6        :1;                                       /* Comparator A Compare Bit 6 */
        byte BIT7        :1;                                       /* Comparator A Compare Bit 7 */
      } Bits;
      struct {
        byte grpBIT :8;
      } MergedBits;
    } DBGCALSTR;
    #define DBGCAL _DBGCA.Overlap_STR.DBGCALSTR.Byte
    #define DBGCAL_BIT0 _DBGCA.Overlap_STR.DBGCALSTR.Bits.BIT0
    #define DBGCAL_BIT1 _DBGCA.Overlap_STR.DBGCALSTR.Bits.BIT1
    #define DBGCAL_BIT2 _DBGCA.Overlap_STR.DBGCALSTR.Bits.BIT2
    #define DBGCAL_BIT3 _DBGCA.Overlap_STR.DBGCALSTR.Bits.BIT3
    #define DBGCAL_BIT4 _DBGCA.Overlap_STR.DBGCALSTR.Bits.BIT4
    #define DBGCAL_BIT5 _DBGCA.Overlap_STR.DBGCALSTR.Bits.BIT5
    #define DBGCAL_BIT6 _DBGCA.Overlap_STR.DBGCALSTR.Bits.BIT6
    #define DBGCAL_BIT7 _DBGCA.Overlap_STR.DBGCALSTR.Bits.BIT7
    
    #define DBGCAL_BIT _DBGCA.Overlap_STR.DBGCALSTR.MergedBits.grpBIT
    
    #define DBGCAL_BIT0_MASK  1
    #define DBGCAL_BIT1_MASK  2
    #define DBGCAL_BIT2_MASK  4
    #define DBGCAL_BIT3_MASK  8
    #define DBGCAL_BIT4_MASK  16
    #define DBGCAL_BIT5_MASK  32
    #define DBGCAL_BIT6_MASK  64
    #define DBGCAL_BIT7_MASK  128
    #define DBGCAL_BIT_MASK  255
    #define DBGCAL_BIT_BITNUM  0

  } Overlap_STR;

  struct {
    word BIT0        :1;                                       /* Comparator A Compare Bit 0 */
    word BIT1        :1;                                       /* Comparator A Compare Bit 1 */
    word BIT2        :1;                                       /* Comparator A Compare Bit 2 */
    word BIT3        :1;                                       /* Comparator A Compare Bit 3 */
    word BIT4        :1;                                       /* Comparator A Compare Bit 4 */
    word BIT5        :1;                                       /* Comparator A Compare Bit 5 */
    word BIT6        :1;                                       /* Comparator A Compare Bit 6 */
    word BIT7        :1;                                       /* Comparator A Compare Bit 7 */
    word BIT8        :1;                                       /* Comparator A Compare Bit 8 */
    word BIT9        :1;                                       /* Comparator A Compare Bit 9 */
    word BIT10       :1;                                       /* Comparator A Compare Bit 10 */
    word BIT11       :1;                                       /* Comparator A Compare Bit 11 */
    word BIT12       :1;                                       /* Comparator A Compare Bit 12 */
    word BIT13       :1;                                       /* Comparator A Compare Bit 13 */
    word BIT14       :1;                                       /* Comparator A Compare Bit 14 */
    word BIT15       :1;                                       /* Comparator A Compare Bit 15 */
  } Bits;
  struct {
    word grpBIT  :16;
  } MergedBits;
} DBGCASTR;
extern volatile DBGCASTR _DBGCA @(REG_BASE + 0x0000002B);
#define DBGCA _DBGCA.Word
#define DBGCA_BIT0 _DBGCA.Bits.BIT0
#define DBGCA_BIT1 _DBGCA.Bits.BIT1
#define DBGCA_BIT2 _DBGCA.Bits.BIT2
#define DBGCA_BIT3 _DBGCA.Bits.BIT3
#define DBGCA_BIT4 _DBGCA.Bits.BIT4
#define DBGCA_BIT5 _DBGCA.Bits.BIT5
#define DBGCA_BIT6 _DBGCA.Bits.BIT6
#define DBGCA_BIT7 _DBGCA.Bits.BIT7
#define DBGCA_BIT8 _DBGCA.Bits.BIT8
#define DBGCA_BIT9 _DBGCA.Bits.BIT9
#define DBGCA_BIT10 _DBGCA.Bits.BIT10
#define DBGCA_BIT11 _DBGCA.Bits.BIT11
#define DBGCA_BIT12 _DBGCA.Bits.BIT12
#define DBGCA_BIT13 _DBGCA.Bits.BIT13
#define DBGCA_BIT14 _DBGCA.Bits.BIT14
#define DBGCA_BIT15 _DBGCA.Bits.BIT15
#define DBGCA_BIT _DBGCA.MergedBits.grpBIT

#define DBGCA_BIT0_MASK  1
#define DBGCA_BIT1_MASK  2
#define DBGCA_BIT2_MASK  4
#define DBGCA_BIT3_MASK  8
#define DBGCA_BIT4_MASK  16
#define DBGCA_BIT5_MASK  32
#define DBGCA_BIT6_MASK  64
#define DBGCA_BIT7_MASK  128
#define DBGCA_BIT8_MASK  256
#define DBGCA_BIT9_MASK  512
#define DBGCA_BIT10_MASK  1024
#define DBGCA_BIT11_MASK  2048
#define DBGCA_BIT12_MASK  4096
#define DBGCA_BIT13_MASK  8192
#define DBGCA_BIT14_MASK  16384
#define DBGCA_BIT15_MASK  32768
#define DBGCA_BIT_MASK  65535
#define DBGCA_BIT_BITNUM  0


/*** DBGCBX - Debug Comparator B Extended Register; 0x0000002D ***/
typedef union {
  byte Byte;
  struct {
    byte EXTCMP0     :1;                                       /* Comparator B Extended Compare Bits, bit 0 */
    byte EXTCMP1     :1;                                       /* Comparator B Extended Compare Bits, bit 1 */
    byte EXTCMP2     :1;                                       /* Comparator B Extended Compare Bits, bit 2 */
    byte EXTCMP3     :1;                                       /* Comparator B Extended Compare Bits, bit 3 */
    byte EXTCMP4     :1;                                       /* Comparator B Extended Compare Bits, bit 4 */
    byte EXTCMP5     :1;                                       /* Comparator B Extended Compare Bits, bit 5 */
    byte PAGSEL0     :1;                                       /* Page Selector Field, bit 0 */
    byte PAGSEL1     :1;                                       /* Page Selector Field, bit 1 */
  } Bits;
  struct {
    byte grpEXTCMP :6;
    byte grpPAGSEL :2;
  } MergedBits;
} DBGCBXSTR;
extern volatile DBGCBXSTR _DBGCBX @(REG_BASE + 0x0000002D);
#define DBGCBX _DBGCBX.Byte
#define DBGCBX_EXTCMP0 _DBGCBX.Bits.EXTCMP0
#define DBGCBX_EXTCMP1 _DBGCBX.Bits.EXTCMP1
#define DBGCBX_EXTCMP2 _DBGCBX.Bits.EXTCMP2
#define DBGCBX_EXTCMP3 _DBGCBX.Bits.EXTCMP3
#define DBGCBX_EXTCMP4 _DBGCBX.Bits.EXTCMP4
#define DBGCBX_EXTCMP5 _DBGCBX.Bits.EXTCMP5
#define DBGCBX_PAGSEL0 _DBGCBX.Bits.PAGSEL0
#define DBGCBX_PAGSEL1 _DBGCBX.Bits.PAGSEL1
#define DBGCBX_EXTCMP _DBGCBX.MergedBits.grpEXTCMP
#define DBGCBX_PAGSEL _DBGCBX.MergedBits.grpPAGSEL

#define DBGCBX_EXTCMP0_MASK  1
#define DBGCBX_EXTCMP1_MASK  2
#define DBGCBX_EXTCMP2_MASK  4
#define DBGCBX_EXTCMP3_MASK  8
#define DBGCBX_EXTCMP4_MASK  16
#define DBGCBX_EXTCMP5_MASK  32
#define DBGCBX_PAGSEL0_MASK  64
#define DBGCBX_PAGSEL1_MASK  128
#define DBGCBX_EXTCMP_MASK  63
#define DBGCBX_EXTCMP_BITNUM  0
#define DBGCBX_PAGSEL_MASK  192
#define DBGCBX_PAGSEL_BITNUM  6


/*** DBGCB - Debug Comparator B Register; 0x0000002E ***/
typedef union {
  word Word;
   /* Overlapped registers: */
  struct {
    /*** DBGCBH - Debug Comparator B Register High; 0x0000002E ***/
    union {
      byte Byte;
      struct {
        byte BIT8        :1;                                       /* Comparator B High Compare Bit 8 */
        byte BIT9        :1;                                       /* Comparator B High Compare Bit 9 */
        byte BIT10       :1;                                       /* Comparator B High Compare Bit 10 */
        byte BIT11       :1;                                       /* Comparator B High Compare Bit 11 */
        byte BIT12       :1;                                       /* Comparator B High Compare Bit 12 */
        byte BIT13       :1;                                       /* Comparator B High Compare Bit 13 */
        byte BIT14       :1;                                       /* Comparator B High Compare Bit 14 */
        byte BIT15       :1;                                       /* Comparator B High Compare Bit 15 */
      } Bits;
      struct {
        byte grpBIT_8 :8;
      } MergedBits;
    } DBGCBHSTR;
    #define DBGCBH _DBGCB.Overlap_STR.DBGCBHSTR.Byte
    #define DBGCBH_BIT8 _DBGCB.Overlap_STR.DBGCBHSTR.Bits.BIT8
    #define DBGCBH_BIT9 _DBGCB.Overlap_STR.DBGCBHSTR.Bits.BIT9
    #define DBGCBH_BIT10 _DBGCB.Overlap_STR.DBGCBHSTR.Bits.BIT10
    #define DBGCBH_BIT11 _DBGCB.Overlap_STR.DBGCBHSTR.Bits.BIT11
    #define DBGCBH_BIT12 _DBGCB.Overlap_STR.DBGCBHSTR.Bits.BIT12
    #define DBGCBH_BIT13 _DBGCB.Overlap_STR.DBGCBHSTR.Bits.BIT13
    #define DBGCBH_BIT14 _DBGCB.Overlap_STR.DBGCBHSTR.Bits.BIT14
    #define DBGCBH_BIT15 _DBGCB.Overlap_STR.DBGCBHSTR.Bits.BIT15
    
    #define DBGCBH_BIT_8 _DBGCB.Overlap_STR.DBGCBHSTR.MergedBits.grpBIT_8
    #define DBGCBH_BIT DBGCBH_BIT_8
    
    #define DBGCBH_BIT8_MASK  1
    #define DBGCBH_BIT9_MASK  2
    #define DBGCBH_BIT10_MASK  4
    #define DBGCBH_BIT11_MASK  8
    #define DBGCBH_BIT12_MASK  16
    #define DBGCBH_BIT13_MASK  32
    #define DBGCBH_BIT14_MASK  64
    #define DBGCBH_BIT15_MASK  128
    #define DBGCBH_BIT_8_MASK  255
    #define DBGCBH_BIT_8_BITNUM  0


