EPLab/Eco_AccBabyMonitor/BaseStation/FreeScale/Drivers_NE64/MC9S12NE64.h
    /*** DBGCBL - Debug Comparator B Register Low; 0x0000002F ***/
    union {
      byte Byte;
      struct {
        byte BIT0        :1;                                       /* Comparator B High Compare Bit 0 */
        byte BIT1        :1;                                       /* Comparator B High Compare Bit 1 */
        byte BIT2        :1;                                       /* Comparator B High Compare Bit 2 */
        byte BIT3        :1;                                       /* Comparator B High Compare Bit 3 */
        byte BIT4        :1;                                       /* Comparator B High Compare Bit 4 */
        byte BIT5        :1;                                       /* Comparator B High Compare Bit 5 */
        byte BIT6        :1;                                       /* Comparator B High Compare Bit 6 */
        byte BIT7        :1;                                       /* Comparator B High Compare Bit 7 */
      } Bits;
      struct {
        byte grpBIT :8;
      } MergedBits;
    } DBGCBLSTR;
    #define DBGCBL _DBGCB.Overlap_STR.DBGCBLSTR.Byte
    #define DBGCBL_BIT0 _DBGCB.Overlap_STR.DBGCBLSTR.Bits.BIT0
    #define DBGCBL_BIT1 _DBGCB.Overlap_STR.DBGCBLSTR.Bits.BIT1
    #define DBGCBL_BIT2 _DBGCB.Overlap_STR.DBGCBLSTR.Bits.BIT2
    #define DBGCBL_BIT3 _DBGCB.Overlap_STR.DBGCBLSTR.Bits.BIT3
    #define DBGCBL_BIT4 _DBGCB.Overlap_STR.DBGCBLSTR.Bits.BIT4
    #define DBGCBL_BIT5 _DBGCB.Overlap_STR.DBGCBLSTR.Bits.BIT5
    #define DBGCBL_BIT6 _DBGCB.Overlap_STR.DBGCBLSTR.Bits.BIT6
    #define DBGCBL_BIT7 _DBGCB.Overlap_STR.DBGCBLSTR.Bits.BIT7
    
    #define DBGCBL_BIT _DBGCB.Overlap_STR.DBGCBLSTR.MergedBits.grpBIT
    
    #define DBGCBL_BIT0_MASK  1
    #define DBGCBL_BIT1_MASK  2
    #define DBGCBL_BIT2_MASK  4
    #define DBGCBL_BIT3_MASK  8
    #define DBGCBL_BIT4_MASK  16
    #define DBGCBL_BIT5_MASK  32
    #define DBGCBL_BIT6_MASK  64
    #define DBGCBL_BIT7_MASK  128
    #define DBGCBL_BIT_MASK  255
    #define DBGCBL_BIT_BITNUM  0

  } Overlap_STR;

  struct {
    word BIT0        :1;                                       /* Comparator B High Compare Bit 0 */
    word BIT1        :1;                                       /* Comparator B High Compare Bit 1 */
    word BIT2        :1;                                       /* Comparator B High Compare Bit 2 */
    word BIT3        :1;                                       /* Comparator B High Compare Bit 3 */
    word BIT4        :1;                                       /* Comparator B High Compare Bit 4 */
    word BIT5        :1;                                       /* Comparator B High Compare Bit 5 */
    word BIT6        :1;                                       /* Comparator B High Compare Bit 6 */
    word BIT7        :1;                                       /* Comparator B High Compare Bit 7 */
    word BIT8        :1;                                       /* Comparator B High Compare Bit 8 */
    word BIT9        :1;                                       /* Comparator B High Compare Bit 9 */
    word BIT10       :1;                                       /* Comparator B High Compare Bit 10 */
    word BIT11       :1;                                       /* Comparator B High Compare Bit 11 */
    word BIT12       :1;                                       /* Comparator B High Compare Bit 12 */
    word BIT13       :1;                                       /* Comparator B High Compare Bit 13 */
    word BIT14       :1;                                       /* Comparator B High Compare Bit 14 */
    word BIT15       :1;                                       /* Comparator B High Compare Bit 15 */
  } Bits;
  struct {
    word grpBIT  :16;
  } MergedBits;
} DBGCBSTR;
extern volatile DBGCBSTR _DBGCB @(REG_BASE + 0x0000002E);
#define DBGCB _DBGCB.Word
#define DBGCB_BIT0 _DBGCB.Bits.BIT0
#define DBGCB_BIT1 _DBGCB.Bits.BIT1
#define DBGCB_BIT2 _DBGCB.Bits.BIT2
#define DBGCB_BIT3 _DBGCB.Bits.BIT3
#define DBGCB_BIT4 _DBGCB.Bits.BIT4
#define DBGCB_BIT5 _DBGCB.Bits.BIT5
#define DBGCB_BIT6 _DBGCB.Bits.BIT6
#define DBGCB_BIT7 _DBGCB.Bits.BIT7
#define DBGCB_BIT8 _DBGCB.Bits.BIT8
#define DBGCB_BIT9 _DBGCB.Bits.BIT9
#define DBGCB_BIT10 _DBGCB.Bits.BIT10
#define DBGCB_BIT11 _DBGCB.Bits.BIT11
#define DBGCB_BIT12 _DBGCB.Bits.BIT12
#define DBGCB_BIT13 _DBGCB.Bits.BIT13
#define DBGCB_BIT14 _DBGCB.Bits.BIT14
#define DBGCB_BIT15 _DBGCB.Bits.BIT15
#define DBGCB_BIT _DBGCB.MergedBits.grpBIT

#define DBGCB_BIT0_MASK  1
#define DBGCB_BIT1_MASK  2
#define DBGCB_BIT2_MASK  4
#define DBGCB_BIT3_MASK  8
#define DBGCB_BIT4_MASK  16
#define DBGCB_BIT5_MASK  32
#define DBGCB_BIT6_MASK  64
#define DBGCB_BIT7_MASK  128
#define DBGCB_BIT8_MASK  256
#define DBGCB_BIT9_MASK  512
#define DBGCB_BIT10_MASK  1024
#define DBGCB_BIT11_MASK  2048
#define DBGCB_BIT12_MASK  4096
#define DBGCB_BIT13_MASK  8192
#define DBGCB_BIT14_MASK  16384
#define DBGCB_BIT15_MASK  32768
#define DBGCB_BIT_MASK  65535
#define DBGCB_BIT_BITNUM  0


/*** PPAGE - Page Index Register; 0x00000030 ***/
typedef union {
  byte Byte;
  struct {
    byte PIX0        :1;                                       /* Page Index Register Bit 0 */
    byte PIX1        :1;                                       /* Page Index Register Bit 1 */
    byte PIX2        :1;                                       /* Page Index Register Bit 2 */
    byte PIX3        :1;                                       /* Page Index Register Bit 3 */
    byte PIX4        :1;                                       /* Page Index Register Bit 4 */
    byte PIX5        :1;                                       /* Page Index Register Bit 5 */
    byte             :1; 
    byte             :1; 
  } Bits;
  struct {
    byte grpPIX  :6;
    byte         :1;
    byte         :1;
  } MergedBits;
} PPAGESTR;
extern volatile PPAGESTR _PPAGE @(REG_BASE + 0x00000030);
#define PPAGE _PPAGE.Byte
#define PPAGE_PIX0 _PPAGE.Bits.PIX0
#define PPAGE_PIX1 _PPAGE.Bits.PIX1
#define PPAGE_PIX2 _PPAGE.Bits.PIX2
#define PPAGE_PIX3 _PPAGE.Bits.PIX3
#define PPAGE_PIX4 _PPAGE.Bits.PIX4
#define PPAGE_PIX5 _PPAGE.Bits.PIX5
#define PPAGE_PIX _PPAGE.MergedBits.grpPIX

#define PPAGE_PIX0_MASK  1
#define PPAGE_PIX1_MASK  2
#define PPAGE_PIX2_MASK  4
#define PPAGE_PIX3_MASK  8
#define PPAGE_PIX4_MASK  16
#define PPAGE_PIX5_MASK  32
#define PPAGE_PIX_MASK  63
#define PPAGE_PIX_BITNUM  0


/*** PORTK - Port K Data Register; 0x00000032 ***/
typedef union {
  byte Byte;
  struct {
    byte BIT0        :1;                                       /* Port K Bit 0 */
    byte BIT1        :1;                                       /* Port K Bit 1 */
    byte BIT2        :1;                                       /* Port K Bit 2 */
    byte BIT3        :1;                                       /* Port K Bit 3 */
    byte BIT4        :1;                                       /* Port K Bit 4 */
    byte BIT5        :1;                                       /* Port K Bit 5 */
    byte BIT6        :1;                                       /* Port K Bit 6 */
    byte BIT7        :1;                                       /* Port K Bit 7 */
  } Bits;
  struct {
    byte grpBIT  :8;
  } MergedBits;
} PORTKSTR;
extern volatile PORTKSTR _PORTK @(REG_BASE + 0x00000032);
#define PORTK _PORTK.Byte
#define PORTK_BIT0 _PORTK.Bits.BIT0
#define PORTK_BIT1 _PORTK.Bits.BIT1
#define PORTK_BIT2 _PORTK.Bits.BIT2
#define PORTK_BIT3 _PORTK.Bits.BIT3
#define PORTK_BIT4 _PORTK.Bits.BIT4
#define PORTK_BIT5 _PORTK.Bits.BIT5
#define PORTK_BIT6 _PORTK.Bits.BIT6
#define PORTK_BIT7 _PORTK.Bits.BIT7
#define PORTK_BIT _PORTK.MergedBits.grpBIT

