EPLab/Eco_AccBabyMonitor/BaseStation/FreeScale/Drivers_NE64/MC9S12NE64.h
    #define TCNTHi_BIT8_MASK  1
    #define TCNTHi_BIT9_MASK  2
    #define TCNTHi_BIT10_MASK  4
    #define TCNTHi_BIT11_MASK  8
    #define TCNTHi_BIT12_MASK  16
    #define TCNTHi_BIT13_MASK  32
    #define TCNTHi_BIT14_MASK  64
    #define TCNTHi_BIT15_MASK  128
    #define TCNTHi_BIT_8_MASK  255
    #define TCNTHi_BIT_8_BITNUM  0


    /*** TCNTL - Timer Count Register Lw; 0x00000045 ***/
    union {
      byte Byte;
      struct {
        byte BIT0        :1;                                       /* Timer Count Register Bit 0 */
        byte BIT1        :1;                                       /* Timer Count Register Bit 1 */
        byte BIT2        :1;                                       /* Timer Count Register Bit 2 */
        byte BIT3        :1;                                       /* Timer Count Register Bit 3 */
        byte BIT4        :1;                                       /* Timer Count Bit Register 4 */
        byte BIT5        :1;                                       /* Timer Count Bit Register 5 */
        byte BIT6        :1;                                       /* Timer Count Bit Register 6 */
        byte BIT7        :1;                                       /* Timer Count Bit Register 7 */
      } Bits;
      struct {
        byte grpBIT :8;
      } MergedBits;
    } TCNTLSTR;
    #define TCNTL _TCNT.Overlap_STR.TCNTLSTR.Byte
    #define TCNTL_BIT0 _TCNT.Overlap_STR.TCNTLSTR.Bits.BIT0
    #define TCNTL_BIT1 _TCNT.Overlap_STR.TCNTLSTR.Bits.BIT1
    #define TCNTL_BIT2 _TCNT.Overlap_STR.TCNTLSTR.Bits.BIT2
    #define TCNTL_BIT3 _TCNT.Overlap_STR.TCNTLSTR.Bits.BIT3
    #define TCNTL_BIT4 _TCNT.Overlap_STR.TCNTLSTR.Bits.BIT4
    #define TCNTL_BIT5 _TCNT.Overlap_STR.TCNTLSTR.Bits.BIT5
    #define TCNTL_BIT6 _TCNT.Overlap_STR.TCNTLSTR.Bits.BIT6
    #define TCNTL_BIT7 _TCNT.Overlap_STR.TCNTLSTR.Bits.BIT7
    
    #define TCNTL_BIT _TCNT.Overlap_STR.TCNTLSTR.MergedBits.grpBIT
    
    #define TCNTL_BIT0_MASK  1
    #define TCNTL_BIT1_MASK  2
    #define TCNTL_BIT2_MASK  4
    #define TCNTL_BIT3_MASK  8
    #define TCNTL_BIT4_MASK  16
    #define TCNTL_BIT5_MASK  32
    #define TCNTL_BIT6_MASK  64
    #define TCNTL_BIT7_MASK  128
    #define TCNTL_BIT_MASK  255
    #define TCNTL_BIT_BITNUM  0

  } Overlap_STR;

  struct {
    word grpBIT  :16;
  } MergedBits;
} TCNTSTR;
extern volatile TCNTSTR _TCNT @(REG_BASE + 0x00000044);
#define TCNT _TCNT.Word
#define TCNT_BIT _TCNT.MergedBits.grpBIT

#define TCNT_BIT_MASK  65535
#define TCNT_BIT_BITNUM  0


/*** TSCR1 - Timer System Control Register1; 0x00000046 ***/
typedef union {
  byte Byte;
  struct {
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte TFFCA       :1;                                       /* Timer Fast Flag Clear All */
    byte TSFRZ       :1;                                       /* Timer and Modulus Counter Stop While in Freeze Mode */
    byte TSWAI       :1;                                       /* Timer Module Stops While in Wait */
    byte TEN         :1;                                       /* Timer Enable */
  } Bits;
} TSCR1STR;
extern volatile TSCR1STR _TSCR1 @(REG_BASE + 0x00000046);
#define TSCR1 _TSCR1.Byte
#define TSCR1_TFFCA _TSCR1.Bits.TFFCA
#define TSCR1_TSFRZ _TSCR1.Bits.TSFRZ
#define TSCR1_TSWAI _TSCR1.Bits.TSWAI
#define TSCR1_TEN _TSCR1.Bits.TEN

#define TSCR1_TFFCA_MASK  16
#define TSCR1_TSFRZ_MASK  32
#define TSCR1_TSWAI_MASK  64
#define TSCR1_TEN_MASK  128


/*** TTOV - Timer Toggle On Overflow Register; 0x00000047 ***/
typedef union {
  byte Byte;
  struct {
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte TOV4        :1;                                       /* Toggle On Overflow Bit 4 */
    byte TOV5        :1;                                       /* Toggle On Overflow Bit 5 */
    byte TOV6        :1;                                       /* Toggle On Overflow Bit 6 */
    byte TOV7        :1;                                       /* Toggle On Overflow Bit 7 */
  } Bits;
  struct {
    byte         :1;
    byte         :1;
    byte         :1;
    byte         :1;
    byte grpTOV_4 :4;
  } MergedBits;
} TTOVSTR;
extern volatile TTOVSTR _TTOV @(REG_BASE + 0x00000047);
#define TTOV _TTOV.Byte
#define TTOV_TOV4 _TTOV.Bits.TOV4
#define TTOV_TOV5 _TTOV.Bits.TOV5
#define TTOV_TOV6 _TTOV.Bits.TOV6
#define TTOV_TOV7 _TTOV.Bits.TOV7
#define TTOV_TOV_4 _TTOV.MergedBits.grpTOV_4
#define TTOV_TOV TTOV_TOV_4

#define TTOV_TOV4_MASK  16
#define TTOV_TOV5_MASK  32
#define TTOV_TOV6_MASK  64
#define TTOV_TOV7_MASK  128
#define TTOV_TOV_4_MASK  240
#define TTOV_TOV_4_BITNUM  4


/*** TCTL1 - Timer Control Registers 1; 0x00000048 ***/
typedef union {
  byte Byte;
  struct {
    byte OL4         :1;                                       /* Output Level Bit 4 */
    byte OM4         :1;                                       /* Output Mode Bit 4 */
    byte OL5         :1;                                       /* Output Level Bit 5 */
    byte OM5         :1;                                       /* Output Mode Bit 5 */
    byte OL6         :1;                                       /* Output Level Bit 6 */
    byte OM6         :1;                                       /* Output Mode Bit 6 */
    byte OL7         :1;                                       /* Output Level Bit 7 */
    byte OM7         :1;                                       /* Output Mode Bit 7 */
  } Bits;
} TCTL1STR;
extern volatile TCTL1STR _TCTL1 @(REG_BASE + 0x00000048);
#define TCTL1 _TCTL1.Byte
#define TCTL1_OL4 _TCTL1.Bits.OL4
#define TCTL1_OM4 _TCTL1.Bits.OM4
#define TCTL1_OL5 _TCTL1.Bits.OL5
#define TCTL1_OM5 _TCTL1.Bits.OM5
#define TCTL1_OL6 _TCTL1.Bits.OL6
#define TCTL1_OM6 _TCTL1.Bits.OM6
#define TCTL1_OL7 _TCTL1.Bits.OL7
#define TCTL1_OM7 _TCTL1.Bits.OM7

#define TCTL1_OL4_MASK  1
#define TCTL1_OM4_MASK  2
#define TCTL1_OL5_MASK  4
#define TCTL1_OM5_MASK  8
#define TCTL1_OL6_MASK  16
#define TCTL1_OM6_MASK  32
#define TCTL1_OL7_MASK  64
#define TCTL1_OM7_MASK  128


/*** TCTL3 - Timer Control Register 3; 0x0000004A ***/
typedef union {
  byte Byte;
  struct {
    byte EDG4A       :1;                                       /* Input Capture Edge Control 4A */
    byte EDG4B       :1;                                       /* Input Capture Edge Control 4B */
    byte EDG5A       :1;                                       /* Input Capture Edge Control 5A */
    byte EDG5B       :1;                                       /* Input Capture Edge Control 5B */
    byte EDG6A       :1;                                       /* Input Capture Edge Control 6A */
    byte EDG6B       :1;                                       /* Input Capture Edge Control 6B */
    byte EDG7A       :1;                                       /* Input Capture Edge Control 7A */
    byte EDG7B       :1;                                       /* Input Capture Edge Control 7B */
  } Bits;
  struct {
    byte grpEDG4x :2;
    byte         :1;
    byte         :1;
    byte grpEDG6x :2;
    byte         :1;
    byte         :1;
  } MergedBits;
} TCTL3STR;
extern volatile TCTL3STR _TCTL3 @(REG_BASE + 0x0000004A);
#define TCTL3 _TCTL3.Byte
#define TCTL3_EDG4A _TCTL3.Bits.EDG4A
#define TCTL3_EDG4B _TCTL3.Bits.EDG4B
#define TCTL3_EDG5A _TCTL3.Bits.EDG5A
#define TCTL3_EDG5B _TCTL3.Bits.EDG5B
#define TCTL3_EDG6A _TCTL3.Bits.EDG6A
#define TCTL3_EDG6B _TCTL3.Bits.EDG6B
#define TCTL3_EDG7A _TCTL3.Bits.EDG7A
#define TCTL3_EDG7B _TCTL3.Bits.EDG7B
#define TCTL3_EDG4x _TCTL3.MergedBits.grpEDG4x
#define TCTL3_EDG6x _TCTL3.MergedBits.grpEDG6x

#define TCTL3_EDG4A_MASK  1
#define TCTL3_EDG4B_MASK  2
#define TCTL3_EDG5A_MASK  4
#define TCTL3_EDG5B_MASK  8
#define TCTL3_EDG6A_MASK  16
#define TCTL3_EDG6B_MASK  32
#define TCTL3_EDG7A_MASK  64
#define TCTL3_EDG7B_MASK  128
#define TCTL3_EDG4x_MASK  3
#define TCTL3_EDG4x_BITNUM  0
#define TCTL3_EDG6x_MASK  48
#define TCTL3_EDG6x_BITNUM  4


