EPLab/Eco_AccBabyMonitor/BaseStation/FreeScale/Drivers_NE64/MC9S12NE64.h
    #define TC6Hi_BIT_8 _TC6.Overlap_STR.TC6HiSTR.MergedBits.grpBIT_8
    #define TC6Hi_BIT TC6Hi_BIT_8
    
    #define TC6Hi_BIT8_MASK  1
    #define TC6Hi_BIT9_MASK  2
    #define TC6Hi_BIT10_MASK  4
    #define TC6Hi_BIT11_MASK  8
    #define TC6Hi_BIT12_MASK  16
    #define TC6Hi_BIT13_MASK  32
    #define TC6Hi_BIT14_MASK  64
    #define TC6Hi_BIT15_MASK  128
    #define TC6Hi_BIT_8_MASK  255
    #define TC6Hi_BIT_8_BITNUM  0


    /*** TC6L - Timer Input Capture/Output Compare Register 6 Lw; 0x0000005D ***/
    union {
      byte Byte;
      struct {
        byte BIT0        :1;                                       /* Timer Input Capture/Output Compare Register 6 Bit 0 */
        byte BIT1        :1;                                       /* Timer Input Capture/Output Compare Register 6 Bit 1 */
        byte BIT2        :1;                                       /* Timer Input Capture/Output Compare Register 6 Bit 2 */
        byte BIT3        :1;                                       /* Timer Input Capture/Output Compare Register 6 Bit 3 */
        byte BIT4        :1;                                       /* Timer Input Capture/Output Compare Register 6 Bit 4 */
        byte BIT5        :1;                                       /* Timer Input Capture/Output Compare Register 6 Bit 5 */
        byte BIT6        :1;                                       /* Timer Input Capture/Output Compare Register 6 Bit 6 */
        byte BIT7        :1;                                       /* Timer Input Capture/Output Compare Register 6 Bit 7 */
      } Bits;
      struct {
        byte grpBIT :8;
      } MergedBits;
    } TC6LSTR;
    #define TC6L _TC6.Overlap_STR.TC6LSTR.Byte
    #define TC6L_BIT0 _TC6.Overlap_STR.TC6LSTR.Bits.BIT0
    #define TC6L_BIT1 _TC6.Overlap_STR.TC6LSTR.Bits.BIT1
    #define TC6L_BIT2 _TC6.Overlap_STR.TC6LSTR.Bits.BIT2
    #define TC6L_BIT3 _TC6.Overlap_STR.TC6LSTR.Bits.BIT3
    #define TC6L_BIT4 _TC6.Overlap_STR.TC6LSTR.Bits.BIT4
    #define TC6L_BIT5 _TC6.Overlap_STR.TC6LSTR.Bits.BIT5
    #define TC6L_BIT6 _TC6.Overlap_STR.TC6LSTR.Bits.BIT6
    #define TC6L_BIT7 _TC6.Overlap_STR.TC6LSTR.Bits.BIT7
    
    #define TC6L_BIT _TC6.Overlap_STR.TC6LSTR.MergedBits.grpBIT
    
    #define TC6L_BIT0_MASK  1
    #define TC6L_BIT1_MASK  2
    #define TC6L_BIT2_MASK  4
    #define TC6L_BIT3_MASK  8
    #define TC6L_BIT4_MASK  16
    #define TC6L_BIT5_MASK  32
    #define TC6L_BIT6_MASK  64
    #define TC6L_BIT7_MASK  128
    #define TC6L_BIT_MASK  255
    #define TC6L_BIT_BITNUM  0

  } Overlap_STR;

  struct {
    word grpBIT  :16;
  } MergedBits;
} TC6STR;
extern volatile TC6STR _TC6 @(REG_BASE + 0x0000005C);
#define TC6 _TC6.Word
#define TC6_BIT _TC6.MergedBits.grpBIT

#define TC6_BIT_MASK  65535
#define TC6_BIT_BITNUM  0


/*** TC7 - Timer Input Capture/Output Compare Register 7; 0x0000005E ***/
typedef union {
  word Word;
   /* Overlapped registers: */
  struct {
    /*** TC7Hi - Timer Input Capture/Output Compare Register 7 High; 0x0000005E ***/
    union {
      byte Byte;
      struct {
        byte BIT8        :1;                                       /* Timer Input Capture/Output Compare Register 7 Bit 8 */
        byte BIT9        :1;                                       /* Timer Input Capture/Output Compare Register 7 Bit 9 */
        byte BIT10       :1;                                       /* Timer Input Capture/Output Compare Register 7 Bit 10 */
        byte BIT11       :1;                                       /* Timer Input Capture/Output Compare Register 7 Bit 11 */
        byte BIT12       :1;                                       /* Timer Input Capture/Output Compare Register 7 Bit 12 */
        byte BIT13       :1;                                       /* Timer Input Capture/Output Compare Register 7 Bit 13 */
        byte BIT14       :1;                                       /* Timer Input Capture/Output Compare Register 7 Bit 14 */
        byte BIT15       :1;                                       /* Timer Input Capture/Output Compare Register 7 Bit 15 */
      } Bits;
      struct {
        byte grpBIT_8 :8;
      } MergedBits;
    } TC7HiSTR;
    #define TC7Hi _TC7.Overlap_STR.TC7HiSTR.Byte
    #define TC7Hi_BIT8 _TC7.Overlap_STR.TC7HiSTR.Bits.BIT8
    #define TC7Hi_BIT9 _TC7.Overlap_STR.TC7HiSTR.Bits.BIT9
    #define TC7Hi_BIT10 _TC7.Overlap_STR.TC7HiSTR.Bits.BIT10
    #define TC7Hi_BIT11 _TC7.Overlap_STR.TC7HiSTR.Bits.BIT11
    #define TC7Hi_BIT12 _TC7.Overlap_STR.TC7HiSTR.Bits.BIT12
    #define TC7Hi_BIT13 _TC7.Overlap_STR.TC7HiSTR.Bits.BIT13
    #define TC7Hi_BIT14 _TC7.Overlap_STR.TC7HiSTR.Bits.BIT14
    #define TC7Hi_BIT15 _TC7.Overlap_STR.TC7HiSTR.Bits.BIT15
    
    #define TC7Hi_BIT_8 _TC7.Overlap_STR.TC7HiSTR.MergedBits.grpBIT_8
    #define TC7Hi_BIT TC7Hi_BIT_8
    
    #define TC7Hi_BIT8_MASK  1
    #define TC7Hi_BIT9_MASK  2
    #define TC7Hi_BIT10_MASK  4
    #define TC7Hi_BIT11_MASK  8
    #define TC7Hi_BIT12_MASK  16
    #define TC7Hi_BIT13_MASK  32
    #define TC7Hi_BIT14_MASK  64
    #define TC7Hi_BIT15_MASK  128
    #define TC7Hi_BIT_8_MASK  255
    #define TC7Hi_BIT_8_BITNUM  0


    /*** TC7L - Timer Input Capture/Output Compare Register 7 Lw; 0x0000005F ***/
    union {
      byte Byte;
      struct {
        byte BIT0        :1;                                       /* Timer Input Capture/Output Compare Register 7 Bit 0 */
        byte BIT1        :1;                                       /* Timer Input Capture/Output Compare Register 7 Bit 1 */
        byte BIT2        :1;                                       /* Timer Input Capture/Output Compare Register 7 Bit 2 */
        byte BIT3        :1;                                       /* Timer Input Capture/Output Compare Register 7 Bit 3 */
        byte BIT4        :1;                                       /* Timer Input Capture/Output Compare Register 7 Bit 4 */
        byte BIT5        :1;                                       /* Timer Input Capture/Output Compare Register 7 Bit 5 */
        byte BIT6        :1;                                       /* Timer Input Capture/Output Compare Register 7 Bit 6 */
        byte BIT7        :1;                                       /* Timer Input Capture/Output Compare Register 7 Bit 7 */
      } Bits;
      struct {
        byte grpBIT :8;
      } MergedBits;
    } TC7LSTR;
    #define TC7L _TC7.Overlap_STR.TC7LSTR.Byte
    #define TC7L_BIT0 _TC7.Overlap_STR.TC7LSTR.Bits.BIT0
    #define TC7L_BIT1 _TC7.Overlap_STR.TC7LSTR.Bits.BIT1
    #define TC7L_BIT2 _TC7.Overlap_STR.TC7LSTR.Bits.BIT2
    #define TC7L_BIT3 _TC7.Overlap_STR.TC7LSTR.Bits.BIT3
    #define TC7L_BIT4 _TC7.Overlap_STR.TC7LSTR.Bits.BIT4
    #define TC7L_BIT5 _TC7.Overlap_STR.TC7LSTR.Bits.BIT5
    #define TC7L_BIT6 _TC7.Overlap_STR.TC7LSTR.Bits.BIT6
    #define TC7L_BIT7 _TC7.Overlap_STR.TC7LSTR.Bits.BIT7
    
