EPLab/Eco_AccBabyMonitor/BaseStation/FreeScale/Drivers_NE64/MC9S12NE64.h
extern volatile ATDSTAT2STR _ATDSTAT2 @(REG_BASE + 0x0000008A);
#define ATDSTAT2 _ATDSTAT2.Byte
#define ATDSTAT2_CCF8 _ATDSTAT2.Bits.CCF8
#define ATDSTAT2_CCF9 _ATDSTAT2.Bits.CCF9
#define ATDSTAT2_CCF10 _ATDSTAT2.Bits.CCF10
#define ATDSTAT2_CCF11 _ATDSTAT2.Bits.CCF11
#define ATDSTAT2_CCF12 _ATDSTAT2.Bits.CCF12
#define ATDSTAT2_CCF13 _ATDSTAT2.Bits.CCF13
#define ATDSTAT2_CCF14 _ATDSTAT2.Bits.CCF14
#define ATDSTAT2_CCF15 _ATDSTAT2.Bits.CCF15
#define ATDSTAT2_CCF_8 _ATDSTAT2.MergedBits.grpCCF_8
#define ATDSTAT2_CCF ATDSTAT2_CCF_8

#define ATDSTAT2_CCF8_MASK  1
#define ATDSTAT2_CCF9_MASK  2
#define ATDSTAT2_CCF10_MASK  4
#define ATDSTAT2_CCF11_MASK  8
#define ATDSTAT2_CCF12_MASK  16
#define ATDSTAT2_CCF13_MASK  32
#define ATDSTAT2_CCF14_MASK  64
#define ATDSTAT2_CCF15_MASK  128
#define ATDSTAT2_CCF_8_MASK  255
#define ATDSTAT2_CCF_8_BITNUM  0


/*** ATDSTAT1 - ATD Status Register 1; 0x0000008B ***/
typedef union {
  byte Byte;
  struct {
    byte CCF0        :1;                                       /* Conversion Complete Flag 0 */
    byte CCF1        :1;                                       /* Conversion Complete Flag 1 */
    byte CCF2        :1;                                       /* Conversion Complete Flag 2 */
    byte CCF3        :1;                                       /* Conversion Complete Flag 3 */
    byte CCF4        :1;                                       /* Conversion Complete Flag 4 */
    byte CCF5        :1;                                       /* Conversion Complete Flag 5 */
    byte CCF6        :1;                                       /* Conversion Complete Flag 6 */
    byte CCF7        :1;                                       /* Conversion Complete Flag 7 */
  } Bits;
  struct {
    byte grpCCF  :8;
  } MergedBits;
} ATDSTAT1STR;
extern volatile ATDSTAT1STR _ATDSTAT1 @(REG_BASE + 0x0000008B);
#define ATDSTAT1 _ATDSTAT1.Byte
#define ATDSTAT1_CCF0 _ATDSTAT1.Bits.CCF0
#define ATDSTAT1_CCF1 _ATDSTAT1.Bits.CCF1
#define ATDSTAT1_CCF2 _ATDSTAT1.Bits.CCF2
#define ATDSTAT1_CCF3 _ATDSTAT1.Bits.CCF3
#define ATDSTAT1_CCF4 _ATDSTAT1.Bits.CCF4
#define ATDSTAT1_CCF5 _ATDSTAT1.Bits.CCF5
#define ATDSTAT1_CCF6 _ATDSTAT1.Bits.CCF6
#define ATDSTAT1_CCF7 _ATDSTAT1.Bits.CCF7
#define ATDSTAT1_CCF _ATDSTAT1.MergedBits.grpCCF

#define ATDSTAT1_CCF0_MASK  1
#define ATDSTAT1_CCF1_MASK  2
#define ATDSTAT1_CCF2_MASK  4
#define ATDSTAT1_CCF3_MASK  8
#define ATDSTAT1_CCF4_MASK  16
#define ATDSTAT1_CCF5_MASK  32
#define ATDSTAT1_CCF6_MASK  64
#define ATDSTAT1_CCF7_MASK  128
#define ATDSTAT1_CCF_MASK  255
#define ATDSTAT1_CCF_BITNUM  0


/*** ATDDIEN - ATD Input Enable Register; 0x0000008C ***/
typedef union {
  word Word;
   /* Overlapped registers: */
  struct {
    /*** ATDDIEN0 - ATD Input Enable Register 0; 0x0000008C ***/
    union {
      byte Byte;
      struct {
        byte IEN8        :1;                                       /* ATD Digital Input Enable on channel 8 */
        byte IEN9        :1;                                       /* ATD Digital Input Enable on channel 9 */
        byte IEN10       :1;                                       /* ATD Digital Input Enable on channel 10 */
        byte IEN11       :1;                                       /* ATD Digital Input Enable on channel 11 */
        byte IEN12       :1;                                       /* ATD Digital Input Enable on channel 12 */
        byte IEN13       :1;                                       /* ATD Digital Input Enable on channel 13 */
        byte IEN14       :1;                                       /* ATD Digital Input Enable on channel 14 */
        byte IEN15       :1;                                       /* ATD Digital Input Enable on channel 15 */
      } Bits;
      struct {
        byte grpIEN_8 :8;
      } MergedBits;
    } ATDDIEN0STR;
    #define ATDDIEN0 _ATDDIEN.Overlap_STR.ATDDIEN0STR.Byte
    #define ATDDIEN0_IEN8 _ATDDIEN.Overlap_STR.ATDDIEN0STR.Bits.IEN8
    #define ATDDIEN0_IEN9 _ATDDIEN.Overlap_STR.ATDDIEN0STR.Bits.IEN9
    #define ATDDIEN0_IEN10 _ATDDIEN.Overlap_STR.ATDDIEN0STR.Bits.IEN10
    #define ATDDIEN0_IEN11 _ATDDIEN.Overlap_STR.ATDDIEN0STR.Bits.IEN11
    #define ATDDIEN0_IEN12 _ATDDIEN.Overlap_STR.ATDDIEN0STR.Bits.IEN12
    #define ATDDIEN0_IEN13 _ATDDIEN.Overlap_STR.ATDDIEN0STR.Bits.IEN13
    #define ATDDIEN0_IEN14 _ATDDIEN.Overlap_STR.ATDDIEN0STR.Bits.IEN14
    #define ATDDIEN0_IEN15 _ATDDIEN.Overlap_STR.ATDDIEN0STR.Bits.IEN15
    
    #define ATDDIEN0_IEN_8 _ATDDIEN.Overlap_STR.ATDDIEN0STR.MergedBits.grpIEN_8
    #define ATDDIEN0_IEN ATDDIEN0_IEN_8
    
    #define ATDDIEN0_IEN8_MASK  1
    #define ATDDIEN0_IEN9_MASK  2
    #define ATDDIEN0_IEN10_MASK  4
    #define ATDDIEN0_IEN11_MASK  8
    #define ATDDIEN0_IEN12_MASK  16
    #define ATDDIEN0_IEN13_MASK  32
    #define ATDDIEN0_IEN14_MASK  64
    #define ATDDIEN0_IEN15_MASK  128
    #define ATDDIEN0_IEN_8_MASK  255
    #define ATDDIEN0_IEN_8_BITNUM  0


    /*** ATDDIEN1 - ATD Input Enable Register 1; 0x0000008D ***/
    union {
      byte Byte;
      struct {
        byte IEN0        :1;                                       /* ATD Digital Input Enable on channel 0 */
        byte IEN1        :1;                                       /* ATD Digital Input Enable on channel 1 */
        byte IEN2        :1;                                       /* ATD Digital Input Enable on channel 2 */
        byte IEN3        :1;                                       /* ATD Digital Input Enable on channel 3 */
        byte IEN4        :1;                                       /* ATD Digital Input Enable on channel 4 */
        byte IEN5        :1;                                       /* ATD Digital Input Enable on channel 5 */
        byte IEN6        :1;                                       /* ATD Digital Input Enable on channel 6 */
        byte IEN7        :1;                                       /* ATD Digital Input Enable on channel 7 */
      } Bits;
      struct {
        byte grpIEN :8;
      } MergedBits;
    } ATDDIEN1STR;
    #define ATDDIEN1 _ATDDIEN.Overlap_STR.ATDDIEN1STR.Byte
    #define ATDDIEN1_IEN0 _ATDDIEN.Overlap_STR.ATDDIEN1STR.Bits.IEN0
    #define ATDDIEN1_IEN1 _ATDDIEN.Overlap_STR.ATDDIEN1STR.Bits.IEN1
    #define ATDDIEN1_IEN2 _ATDDIEN.Overlap_STR.ATDDIEN1STR.Bits.IEN2
    #define ATDDIEN1_IEN3 _ATDDIEN.Overlap_STR.ATDDIEN1STR.Bits.IEN3
    #define ATDDIEN1_IEN4 _ATDDIEN.Overlap_STR.ATDDIEN1STR.Bits.IEN4
    #define ATDDIEN1_IEN5 _ATDDIEN.Overlap_STR.ATDDIEN1STR.Bits.IEN5
    #define ATDDIEN1_IEN6 _ATDDIEN.Overlap_STR.ATDDIEN1STR.Bits.IEN6
    #define ATDDIEN1_IEN7 _ATDDIEN.Overlap_STR.ATDDIEN1STR.Bits.IEN7
    
    #define ATDDIEN1_IEN _ATDDIEN.Overlap_STR.ATDDIEN1STR.MergedBits.grpIEN
    
    #define ATDDIEN1_IEN0_MASK  1
    #define ATDDIEN1_IEN1_MASK  2
    #define ATDDIEN1_IEN2_MASK  4
    #define ATDDIEN1_IEN3_MASK  8
    #define ATDDIEN1_IEN4_MASK  16
    #define ATDDIEN1_IEN5_MASK  32
    #define ATDDIEN1_IEN6_MASK  64
    #define ATDDIEN1_IEN7_MASK  128
    #define ATDDIEN1_IEN_MASK  255
    #define ATDDIEN1_IEN_BITNUM  0

  } Overlap_STR;

