EPLab/Eco_AccBabyMonitor/BaseStation/FreeScale/Drivers_NE64/MC9S12NE64.h
#define FCNFG_KEYACC_MASK  32
#define FCNFG_CCIE_MASK  64
#define FCNFG_CBEIE_MASK  128


/*** FPROT - Flash Protection Register; 0x00000104 ***/
typedef union {
  byte Byte;
  struct {
    byte FPLS0       :1;                                       /* Flash Protection Lwer Address size 0 */
    byte FPLS1       :1;                                       /* Flash Protection Lwer Address size 1 */
    byte FPLDIS      :1;                                       /* Flash Protection Lwer address range disable */
    byte FPHS0       :1;                                       /* Flash Protection Higher address size 0 */
    byte FPHS1       :1;                                       /* Flash Protection Higher address size 1 */
    byte FPHDIS      :1;                                       /* Flash Protection Higher address range disable */
    byte NV6         :1;                                       /* Non Volatile Flag Bit */
    byte FPOPEN      :1;                                       /* Opens the flash block or subsections of it for program or erase */
  } Bits;
  struct {
    byte grpFPLS :2;
    byte         :1;
    byte grpFPHS :2;
    byte         :1;
    byte grpNV_6 :1;
    byte         :1;
  } MergedBits;
} FPROTSTR;
extern volatile FPROTSTR _FPROT @(REG_BASE + 0x00000104);
#define FPROT _FPROT.Byte
#define FPROT_FPLS0 _FPROT.Bits.FPLS0
#define FPROT_FPLS1 _FPROT.Bits.FPLS1
#define FPROT_FPLDIS _FPROT.Bits.FPLDIS
#define FPROT_FPHS0 _FPROT.Bits.FPHS0
#define FPROT_FPHS1 _FPROT.Bits.FPHS1
#define FPROT_FPHDIS _FPROT.Bits.FPHDIS
#define FPROT_NV6 _FPROT.Bits.NV6
#define FPROT_FPOPEN _FPROT.Bits.FPOPEN
#define FPROT_FPLS _FPROT.MergedBits.grpFPLS
#define FPROT_FPHS _FPROT.MergedBits.grpFPHS

#define FPROT_FPLS0_MASK  1
#define FPROT_FPLS1_MASK  2
#define FPROT_FPLDIS_MASK  4
#define FPROT_FPHS0_MASK  8
#define FPROT_FPHS1_MASK  16
#define FPROT_FPHDIS_MASK  32
#define FPROT_NV6_MASK  64
#define FPROT_FPOPEN_MASK  128
#define FPROT_FPLS_MASK  3
#define FPROT_FPLS_BITNUM  0
#define FPROT_FPHS_MASK  24
#define FPROT_FPHS_BITNUM  3


/*** FSTAT - Flash Status Register; 0x00000105 ***/
typedef union {
  byte Byte;
  struct {
    byte             :1; 
    byte             :1; 
    byte BLANK       :1;                                       /* Blank Verify Flag */
    byte             :1; 
    byte ACCERR      :1;                                       /* Access error */
    byte PVIOL       :1;                                       /* Protection violation */
    byte CCIF        :1;                                       /* Command Complete Interrupt Flag */
    byte CBEIF       :1;                                       /* Command Buffers Empty Interrupt Flag */
  } Bits;
} FSTATSTR;
extern volatile FSTATSTR _FSTAT @(REG_BASE + 0x00000105);
#define FSTAT _FSTAT.Byte
#define FSTAT_BLANK _FSTAT.Bits.BLANK
#define FSTAT_ACCERR _FSTAT.Bits.ACCERR
#define FSTAT_PVIOL _FSTAT.Bits.PVIOL
#define FSTAT_CCIF _FSTAT.Bits.CCIF
#define FSTAT_CBEIF _FSTAT.Bits.CBEIF

#define FSTAT_BLANK_MASK  4
#define FSTAT_ACCERR_MASK  16
#define FSTAT_PVIOL_MASK  32
#define FSTAT_CCIF_MASK  64
#define FSTAT_CBEIF_MASK  128


/*** FCMD - Flash Command Buffer and Register; 0x00000106 ***/
typedef union {
  byte Byte;
  struct {
    byte CMDB0       :1;                                       /* NVM User Mode Command Bit 0 */
    byte             :1; 
    byte CMDB2       :1;                                       /* NVM User Mode Command Bit 2 */
    byte             :1; 
    byte             :1; 
    byte CMDB5       :1;                                       /* NVM User Mode Command Bit 5 */
    byte CMDB6       :1;                                       /* NVM User Mode Command Bit 6 */
    byte             :1; 
  } Bits;
  struct {
    byte grpCMDB :1;
    byte         :1;
    byte grpCMDB_2 :1;
    byte         :1;
    byte         :1;
    byte grpCMDB_5 :2;
    byte         :1;
  } MergedBits;
} FCMDSTR;
extern volatile FCMDSTR _FCMD @(REG_BASE + 0x00000106);
#define FCMD _FCMD.Byte
#define FCMD_CMDB0 _FCMD.Bits.CMDB0
#define FCMD_CMDB2 _FCMD.Bits.CMDB2
#define FCMD_CMDB5 _FCMD.Bits.CMDB5
#define FCMD_CMDB6 _FCMD.Bits.CMDB6
#define FCMD_CMDB_5 _FCMD.MergedBits.grpCMDB_5
#define FCMD_CMDB FCMD_CMDB_5

#define FCMD_CMDB0_MASK  1
#define FCMD_CMDB2_MASK  4
#define FCMD_CMDB5_MASK  32
#define FCMD_CMDB6_MASK  64
#define FCMD_CMDB_5_MASK  96
#define FCMD_CMDB_5_BITNUM  5


/*** EPHYCTL0 - Ethernet Physical Transceiver Control Register 0; 0x00000120 ***/
typedef union {
  byte Byte;
  struct {
    byte EPHYIEN     :1;                                       /* EPHY Interrupt Enable */
    byte             :1; 
    byte EPHYWAI     :1;                                       /* EPHY Module Stops While in Wait */
    byte LEDEN       :1;                                       /* LED Drive Enable */
    byte DIS10       :1;                                       /* Disable 10BaseT PLL */
    byte DIS100      :1;                                       /* Disable 100 Base-TX PLL */
    byte ANDIS       :1;                                       /* Auto Negotiation Disable */
    byte EPHYEN      :1;                                       /* EPHY Enable */
  } Bits;
} EPHYCTL0STR;
extern volatile EPHYCTL0STR _EPHYCTL0 @(REG_BASE + 0x00000120);
#define EPHYCTL0 _EPHYCTL0.Byte
#define EPHYCTL0_EPHYIEN _EPHYCTL0.Bits.EPHYIEN
#define EPHYCTL0_EPHYWAI _EPHYCTL0.Bits.EPHYWAI
#define EPHYCTL0_LEDEN _EPHYCTL0.Bits.LEDEN
#define EPHYCTL0_DIS10 _EPHYCTL0.Bits.DIS10
#define EPHYCTL0_DIS100 _EPHYCTL0.Bits.DIS100
#define EPHYCTL0_ANDIS _EPHYCTL0.Bits.ANDIS
#define EPHYCTL0_EPHYEN _EPHYCTL0.Bits.EPHYEN

#define EPHYCTL0_EPHYIEN_MASK  1
#define EPHYCTL0_EPHYWAI_MASK  4
#define EPHYCTL0_LEDEN_MASK  8
#define EPHYCTL0_DIS10_MASK  16
#define EPHYCTL0_DIS100_MASK  32
#define EPHYCTL0_ANDIS_MASK  64
#define EPHYCTL0_EPHYEN_MASK  128


/*** EPHYCTL1 - Ethernet Physical Transceiver Control Register 1; 0x00000121 ***/
typedef union {
  byte Byte;
  struct {
    byte PHYADD0     :1;                                       /* EPHY Address for MII Request Bit 0 */
    byte PHYADD1     :1;                                       /* EPHY Address for MII Request Bit 1 */
    byte PHYADD2     :1;                                       /* EPHY Address for MII Request Bit 2 */
    byte PHYADD3     :1;                                       /* EPHY Address for MII Request Bit 3 */
    byte PHYADD4     :1;                                       /* EPHY Address for MII Request Bit 4 */
    byte             :1; 
    byte             :1; 
    byte             :1; 
  } Bits;
  struct {
    byte grpPHYADD :5;
    byte         :1;
    byte         :1;
    byte         :1;
  } MergedBits;
} EPHYCTL1STR;
extern volatile EPHYCTL1STR _EPHYCTL1 @(REG_BASE + 0x00000121);
#define EPHYCTL1 _EPHYCTL1.Byte
#define EPHYCTL1_PHYADD0 _EPHYCTL1.Bits.PHYADD0
#define EPHYCTL1_PHYADD1 _EPHYCTL1.Bits.PHYADD1
#define EPHYCTL1_PHYADD2 _EPHYCTL1.Bits.PHYADD2
#define EPHYCTL1_PHYADD3 _EPHYCTL1.Bits.PHYADD3
#define EPHYCTL1_PHYADD4 _EPHYCTL1.Bits.PHYADD4
#define EPHYCTL1_PHYADD _EPHYCTL1.MergedBits.grpPHYADD

#define EPHYCTL1_PHYADD0_MASK  1
#define EPHYCTL1_PHYADD1_MASK  2
#define EPHYCTL1_PHYADD2_MASK  4
#define EPHYCTL1_PHYADD3_MASK  8
#define EPHYCTL1_PHYADD4_MASK  16
#define EPHYCTL1_PHYADD_MASK  31
#define EPHYCTL1_PHYADD_BITNUM  0


/*** EPHYSR - Ethernet Physical Transceiver Status Register; 0x00000122 ***/
typedef union {
  byte Byte;
  struct {
    byte EPHYIF      :1;                                       /* EPHY Interrupt Flag */
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte _10DIS      :1;                                       /* EPHY Port Base 10X mode status */
    byte _100DIS     :1;                                       /* EPHY Port Base 100X mode status */
    byte             :1; 
    byte             :1; 
  } Bits;
} EPHYSRSTR;
