EPLab/Eco_AccBabyMonitor/BaseStation/FreeScale/Drivers_NE64/MC9S12NE64.h
extern volatile EPHYSRSTR _EPHYSR @(REG_BASE + 0x00000122);
#define EPHYSR _EPHYSR.Byte
#define EPHYSR_EPHYIF _EPHYSR.Bits.EPHYIF
#define EPHYSR__10DIS _EPHYSR.Bits._10DIS
#define EPHYSR__100DIS _EPHYSR.Bits._100DIS

#define EPHYSR_EPHYIF_MASK  1
#define EPHYSR__10DIS_MASK  16
#define EPHYSR__100DIS_MASK  32


/*** NETCTL - Network Control; 0x00000140 ***/
typedef union {
  byte Byte;
  struct {
    byte             :1; 
    byte FDX         :1;                                       /* Full Duplex */
    byte MLB         :1;                                       /* MAC Lopback */
    byte EXTPHY      :1;                                       /* External PHY */
    byte ESWAI       :1;                                       /* EMAC Disabled during WAIT Mode */
    byte             :1; 
    byte             :1; 
    byte EMACE       :1;                                       /* EMAC Enable */
  } Bits;
} NETCTLSTR;
extern volatile NETCTLSTR _NETCTL @(REG_BASE + 0x00000140);
#define NETCTL _NETCTL.Byte
#define NETCTL_FDX _NETCTL.Bits.FDX
#define NETCTL_MLB _NETCTL.Bits.MLB
#define NETCTL_EXTPHY _NETCTL.Bits.EXTPHY
#define NETCTL_ESWAI _NETCTL.Bits.ESWAI
#define NETCTL_EMACE _NETCTL.Bits.EMACE

#define NETCTL_FDX_MASK  2
#define NETCTL_MLB_MASK  4
#define NETCTL_EXTPHY_MASK  8
#define NETCTL_ESWAI_MASK  16
#define NETCTL_EMACE_MASK  128


/*** RXCTS - Receive Control and Status; 0x00000143 ***/
typedef union {
  byte Byte;
  struct {
    byte BCREJ       :1;                                       /* Broadcast Reject */
    byte CONMC       :1;                                       /* Conditional Multicast */
    byte PROM        :1;                                       /* Promiscuous Mode */
    byte             :1; 
    byte RFCE        :1;                                       /* Reception Flow Control Enable */
    byte             :1; 
    byte             :1; 
    byte RXACT       :1;                                       /* Receiver Active Status */
  } Bits;
} RXCTSSTR;
extern volatile RXCTSSTR _RXCTS @(REG_BASE + 0x00000143);
#define RXCTS _RXCTS.Byte
#define RXCTS_BCREJ _RXCTS.Bits.BCREJ
#define RXCTS_CONMC _RXCTS.Bits.CONMC
#define RXCTS_PROM _RXCTS.Bits.PROM
#define RXCTS_RFCE _RXCTS.Bits.RFCE
#define RXCTS_RXACT _RXCTS.Bits.RXACT

#define RXCTS_BCREJ_MASK  1
#define RXCTS_CONMC_MASK  2
#define RXCTS_PROM_MASK  4
#define RXCTS_RFCE_MASK  16
#define RXCTS_RXACT_MASK  128


/*** TXCTS - Transmit Control and Status; 0x00000144 ***/
typedef union {
  byte Byte;
  struct {
    byte TCMD0       :1;                                       /* Transmit Command Bit 0 */
    byte TCMD1       :1;                                       /* Transmit Command Bit 1 */
    byte             :1; 
    byte SSB         :1;                                       /* Single Slot Backoff */
    byte PTRC        :1;                                       /* PAUSE Timer Register Control */
    byte CSLF        :1;                                       /* Carrier Sense Lst Flag */
    byte             :1; 
    byte TXACT       :1;                                       /* Transmitter Active */
  } Bits;
  struct {
    byte grpTCMD :2;
    byte         :1;
    byte         :1;
    byte         :1;
    byte         :1;
    byte         :1;
    byte         :1;
  } MergedBits;
} TXCTSSTR;
extern volatile TXCTSSTR _TXCTS @(REG_BASE + 0x00000144);
#define TXCTS _TXCTS.Byte
#define TXCTS_TCMD0 _TXCTS.Bits.TCMD0
#define TXCTS_TCMD1 _TXCTS.Bits.TCMD1
#define TXCTS_SSB _TXCTS.Bits.SSB
#define TXCTS_PTRC _TXCTS.Bits.PTRC
#define TXCTS_CSLF _TXCTS.Bits.CSLF
#define TXCTS_TXACT _TXCTS.Bits.TXACT
#define TXCTS_TCMD _TXCTS.MergedBits.grpTCMD

#define TXCTS_TCMD0_MASK  1
#define TXCTS_TCMD1_MASK  2
#define TXCTS_SSB_MASK  8
#define TXCTS_PTRC_MASK  16
#define TXCTS_CSLF_MASK  32
#define TXCTS_TXACT_MASK  128
#define TXCTS_TCMD_MASK  3
#define TXCTS_TCMD_BITNUM  0


/*** ETCTL - Ethertype Control; 0x00000145 ***/
typedef union {
  byte Byte;
  struct {
    byte FIEEE       :1;                                       /* IEEE802.3 Length Field Ethertype */
    byte FIPV4       :1;                                       /* Internet Protocol Version 4 (IPv4) Ethertype */
    byte FARP        :1;                                       /* Address Resolution Protocol (ARP) Ethertype */
    byte FIPV6       :1;                                       /* Internet Protocol Version 6 (IPv6) Ethertype */
    byte FEMW        :1;                                       /* Emware Ethertype */
    byte             :1; 
    byte             :1; 
    byte FPET        :1;                                       /* Programmable Ethertype */
  } Bits;
} ETCTLSTR;
extern volatile ETCTLSTR _ETCTL @(REG_BASE + 0x00000145);
#define ETCTL                           _ETCTL.Byte
#define ETCTL_FIEEE                     _ETCTL.Bits.FIEEE
#define ETCTL_FIPV4                     _ETCTL.Bits.FIPV4
#define ETCTL_FARP                      _ETCTL.Bits.FARP
#define ETCTL_FIPV6                     _ETCTL.Bits.FIPV6
#define ETCTL_FEMW                      _ETCTL.Bits.FEMW
#define ETCTL_FPET                      _ETCTL.Bits.FPET

#define ETCTL_FIEEE_MASK                1
#define ETCTL_FIPV4_MASK                2
#define ETCTL_FARP_MASK                 4
#define ETCTL_FIPV6_MASK                8
#define ETCTL_FEMW_MASK                 16
#define ETCTL_FPET_MASK                 128


/*** ETYPE - Programmable Ethertype; 0x00000146 ***/
typedef union {
  word Word;
  struct {
    word ETYPE0      :1;                                       /* Programmable Ethertype Bit 0 */
    word ETYPE1      :1;                                       /* Programmable Ethertype Bit 1 */
    word ETYPE2      :1;                                       /* Programmable Ethertype Bit 2 */
    word ETYPE3      :1;                                       /* Programmable Ethertype Bit 3 */
    word ETYPE4      :1;                                       /* Programmable Ethertype Bit 4 */
    word ETYPE5      :1;                                       /* Programmable Ethertype Bit 5 */
    word ETYPE6      :1;                                       /* Programmable Ethertype Bit 6 */
    word ETYPE7      :1;                                       /* Programmable Ethertype Bit 7 */
    word ETYPE8      :1;                                       /* Programmable Ethertype Bit 8 */
    word ETYPE9      :1;                                       /* Programmable Ethertype Bit 9 */
    word ETYPE10     :1;                                       /* Programmable Ethertype Bit 10 */
    word ETYPE11     :1;                                       /* Programmable Ethertype Bit 11 */
    word ETYPE12     :1;                                       /* Programmable Ethertype Bit 12 */
    word ETYPE13     :1;                                       /* Programmable Ethertype Bit 13 */
    word ETYPE14     :1;                                       /* Programmable Ethertype Bit 14 */
    word ETYPE15     :1;                                       /* Programmable Ethertype Bit 15 */
  } Bits;
  struct {
    word grpETYPE :16;
  } MergedBits;
} ETYPESTR;
extern volatile ETYPESTR _ETYPE @(REG_BASE + 0x00000146);
#define ETYPE _ETYPE.Word
#define ETYPE_ETYPE0 _ETYPE.Bits.ETYPE0
#define ETYPE_ETYPE1 _ETYPE.Bits.ETYPE1
#define ETYPE_ETYPE2 _ETYPE.Bits.ETYPE2
#define ETYPE_ETYPE3 _ETYPE.Bits.ETYPE3
#define ETYPE_ETYPE4 _ETYPE.Bits.ETYPE4
#define ETYPE_ETYPE5 _ETYPE.Bits.ETYPE5
#define ETYPE_ETYPE6 _ETYPE.Bits.ETYPE6
#define ETYPE_ETYPE7 _ETYPE.Bits.ETYPE7
#define ETYPE_ETYPE8 _ETYPE.Bits.ETYPE8
#define ETYPE_ETYPE9 _ETYPE.Bits.ETYPE9
#define ETYPE_ETYPE10 _ETYPE.Bits.ETYPE10
#define ETYPE_ETYPE11 _ETYPE.Bits.ETYPE11
#define ETYPE_ETYPE12 _ETYPE.Bits.ETYPE12
#define ETYPE_ETYPE13 _ETYPE.Bits.ETYPE13
#define ETYPE_ETYPE14 _ETYPE.Bits.ETYPE14
#define ETYPE_ETYPE15 _ETYPE.Bits.ETYPE15
#define ETYPE_ETYPE _ETYPE.MergedBits.grpETYPE

#define ETYPE_ETYPE0_MASK  1
#define ETYPE_ETYPE1_MASK  2
#define ETYPE_ETYPE2_MASK  4
#define ETYPE_ETYPE3_MASK  8
#define ETYPE_ETYPE4_MASK  16
#define ETYPE_ETYPE5_MASK  32
#define ETYPE_ETYPE6_MASK  64
#define ETYPE_ETYPE7_MASK  128
#define ETYPE_ETYPE8_MASK  256
#define ETYPE_ETYPE9_MASK  512
#define ETYPE_ETYPE10_MASK  1024
#define ETYPE_ETYPE11_MASK  2048
#define ETYPE_ETYPE12_MASK  4096
#define ETYPE_ETYPE13_MASK  8192
#define ETYPE_ETYPE14_MASK  16384
#define ETYPE_ETYPE15_MASK  32768
#define ETYPE_ETYPE_MASK  65535
#define ETYPE_ETYPE_BITNUM  0


/*** PTIME - PAUSE Timer Value and Counter; 0x00000148 ***/
typedef union {
  word Word;
  struct {
    word PTIME0      :1;                                       /* PAUSE Timer Value and Counter Bit 0 */
    word PTIME1      :1;                                       /* PAUSE Timer Value and Counter Bit 1 */
    word PTIME2      :1;                                       /* PAUSE Timer Value and Counter Bit 2 */
    word PTIME3      :1;                                       /* PAUSE Timer Value and Counter Bit 3 */
    word PTIME4      :1;                                       /* PAUSE Timer Value and Counter Bit 4 */
    word PTIME5      :1;                                       /* PAUSE Timer Value and Counter Bit 5 */
    word PTIME6      :1;                                       /* PAUSE Timer Value and Counter Bit 6 */
    word PTIME7      :1;                                       /* PAUSE Timer Value and Counter Bit 7 */
    word PTIME8      :1;                                       /* PAUSE Timer Value and Counter Bit 8 */
    word PTIME9      :1;                                       /* PAUSE Timer Value and Counter Bit 9 */
    word PTIME10     :1;                                       /* PAUSE Timer Value and Counter Bit 10 */
    word PTIME11     :1;                                       /* PAUSE Timer Value and Counter Bit 11 */
    word PTIME12     :1;                                       /* PAUSE Timer Value and Counter Bit 12 */
    word PTIME13     :1;                                       /* PAUSE Timer Value and Counter Bit 13 */
    word PTIME14     :1;                                       /* PAUSE Timer Value and Counter Bit 14 */
    word PTIME15     :1;                                       /* PAUSE Timer Value and Counter Bit 15 */
  } Bits;
  struct {
    word grpPTIME :16;
  } MergedBits;
} PTIMESTR;
extern volatile PTIMESTR _PTIME @(REG_BASE + 0x00000148);
#define PTIME _PTIME.Word
#define PTIME_PTIME0 _PTIME.Bits.PTIME0
#define PTIME_PTIME1 _PTIME.Bits.PTIME1
#define PTIME_PTIME2 _PTIME.Bits.PTIME2
#define PTIME_PTIME3 _PTIME.Bits.PTIME3
#define PTIME_PTIME4 _PTIME.Bits.PTIME4
#define PTIME_PTIME5 _PTIME.Bits.PTIME5
#define PTIME_PTIME6 _PTIME.Bits.PTIME6
#define PTIME_PTIME7 _PTIME.Bits.PTIME7
#define PTIME_PTIME8 _PTIME.Bits.PTIME8
#define PTIME_PTIME9 _PTIME.Bits.PTIME9
#define PTIME_PTIME10 _PTIME.Bits.PTIME10
#define PTIME_PTIME11 _PTIME.Bits.PTIME11
#define PTIME_PTIME12 _PTIME.Bits.PTIME12
#define PTIME_PTIME13 _PTIME.Bits.PTIME13
#define PTIME_PTIME14 _PTIME.Bits.PTIME14
#define PTIME_PTIME15 _PTIME.Bits.PTIME15
#define PTIME_PTIME _PTIME.MergedBits.grpPTIME

#define PTIME_PTIME0_MASK  1
#define PTIME_PTIME1_MASK  2
#define PTIME_PTIME2_MASK  4
#define PTIME_PTIME3_MASK  8
#define PTIME_PTIME4_MASK  16
#define PTIME_PTIME5_MASK  32
#define PTIME_PTIME6_MASK  64
#define PTIME_PTIME7_MASK  128
#define PTIME_PTIME8_MASK  256
#define PTIME_PTIME9_MASK  512
#define PTIME_PTIME10_MASK  1024
#define PTIME_PTIME11_MASK  2048
#define PTIME_PTIME12_MASK  4096
#define PTIME_PTIME13_MASK  8192
#define PTIME_PTIME14_MASK  16384
#define PTIME_PTIME15_MASK  32768
#define PTIME_PTIME_MASK  65535
#define PTIME_PTIME_BITNUM  0


