EPLab/Eco_AccBabyMonitor/BaseStation/FreeScale/Drivers_NE64/MC9S12NE64.h
/*** IEVENT - Interrupt Event; 0x0000014A ***/
typedef union {
  word Word;
  struct {
#if (__VERSION__ == 5023) //Version 3.0 compiler treats word structure differently
    word             :1; 
    word TXCIF       :1;                                       /* Frame Transmission Complete Interrupt Flag */
    word             :1; 
    word             :1; 
    word ECIF        :1;                                       /* Excessive Collision Interrupt Flag */
    word LCIF        :1;                                       /* Late Collision Interrupt Flag */
    word             :1; 
    word MMCIF       :1;                                       /* MII Management Transfer Complete Interrupt Flag */
    word RXBCIF      :1;                                       /* Valid Frame Reception to Receive Buffer B Complete Interrupt Flag */
    word RXACIF      :1;                                       /* Valid Frame Reception to Receive Buffer A Complete Interrupt Flag */
    word RXBOIF      :1;                                       /* Receive Buffer B Overrun Interrupt Flag */
    word RXAOIF      :1;                                       /* Receive Buffer A Overrun Interrupt Flag */
    word RXEIF       :1;                                       /* Receive Error Interrupt Flag */
    word BREIF       :1;                                       /* Babbling Receive Error Interrupt Flag */
    word             :1; 
    word RFCIF       :1;                                       /* Receive Flow Control Interrupt Flag */
#else
    word RXBCIF      :1;                                       /* Valid Frame Reception to Receive Buffer B Complete Interrupt Flag */
    word RXACIF      :1;                                       /* Valid Frame Reception to Receive Buffer A Complete Interrupt Flag */
    word RXBOIF      :1;                                       /* Receive Buffer B Overrun Interrupt Flag */
    word RXAOIF      :1;                                       /* Receive Buffer A Overrun Interrupt Flag */
    word RXEIF       :1;                                       /* Receive Error Interrupt Flag */
    word BREIF       :1;                                       /* Babbling Receive Error Interrupt Flag */
    word             :1; 
    word RFCIF       :1;                                       /* Receive Flow Control Interrupt Flag */
    word             :1; 
    word TXCIF       :1;                                       /* Frame Transmission Complete Interrupt Flag */
    word             :1; 
    word             :1; 
    word ECIF        :1;                                       /* Excessive Collision Interrupt Flag */
    word LCIF        :1;                                       /* Late Collision Interrupt Flag */
    word             :1; 
    word MMCIF       :1;                                       /* MII Management Transfer Complete Interrupt Flag */
#endif
  } Bits;
} IEVENTSTR;
extern volatile IEVENTSTR _IEVENT @(REG_BASE + 0x0000014A);
#define IEVENT _IEVENT.Word
#define IEVENT_TXCIF _IEVENT.Bits.TXCIF
#define IEVENT_ECIF _IEVENT.Bits.ECIF
#define IEVENT_LCIF _IEVENT.Bits.LCIF
#define IEVENT_MMCIF _IEVENT.Bits.MMCIF
#define IEVENT_RXBCIF _IEVENT.Bits.RXBCIF
#define IEVENT_RXACIF _IEVENT.Bits.RXACIF
#define IEVENT_RXBOIF _IEVENT.Bits.RXBOIF
#define IEVENT_RXAOIF _IEVENT.Bits.RXAOIF
#define IEVENT_RXEIF _IEVENT.Bits.RXEIF
#define IEVENT_BREIF _IEVENT.Bits.BREIF
#define IEVENT_RFCIF _IEVENT.Bits.RFCIF

#define IEVENT_TXCIF_MASK  2
#define IEVENT_ECIF_MASK  16
#define IEVENT_LCIF_MASK  32
#define IEVENT_MMCIF_MASK  128
#define IEVENT_RXBCIF_MASK  256
#define IEVENT_RXACIF_MASK  512
#define IEVENT_RXBOIF_MASK  1024
#define IEVENT_RXAOIF_MASK  2048
#define IEVENT_RXEIF_MASK  4096
#define IEVENT_BREIF_MASK  8192
#define IEVENT_RFCIF_MASK  32768


/*** IMASK - Interrupt Mask; 0x0000014C ***/
typedef union {
  word Word;
  struct {
#if (__VERSION__ == 5023) //Version 3.0 compiler treats word structure differently
    word             :1; 
    word TXCIE       :1;                                       /* Frame Transmission Complete Interrupt Enable */
    word             :1; 
    word             :1; 
    word ECIE        :1;                                       /* Excessive Collision Interrupt Enable */
    word LCIE        :1;                                       /* Late Collision Interrupt Enable */
    word             :1; 
    word MMCIE       :1;                                       /* MII Management Transfer Complete Interrupt Enable */
    word RXBCIE      :1;                                       /* Valid Frame Reception to Receive Buffer B Complete Interrupt Enable */
    word RXACIE      :1;                                       /* Valid Frame Reception to Receive Buffer A Complete Interrupt Enable */
    word RXBOIE      :1;                                       /* Receive Buffer B Overrun Interrupt Enable */
    word RXAOIE      :1;                                       /* Receive Buffer A Overrun Interrupt Enable */
    word RXEIE       :1;                                       /* Receive Error Interrupt Enable */
    word BREIE       :1;                                       /* Babbling Receive Error Interrupt Enable */
    word             :1; 
    word RFCIE       :1;                                       /* Receive Flow Control Interrupt Enable */
#else
    word RXBCIE      :1;                                       /* Valid Frame Reception to Receive Buffer B Complete Interrupt Enable */
    word RXACIE      :1;                                       /* Valid Frame Reception to Receive Buffer A Complete Interrupt Enable */
    word RXBOIE      :1;                                       /* Receive Buffer B Overrun Interrupt Enable */
    word RXAOIE      :1;                                       /* Receive Buffer A Overrun Interrupt Enable */
    word RXEIE       :1;                                       /* Receive Error Interrupt Enable */
    word BREIE       :1;                                       /* Babbling Receive Error Interrupt Enable */
    word             :1; 
    word RFCIE       :1;                                       /* Receive Flow Control Interrupt Enable */
    word             :1; 
    word TXCIE       :1;                                       /* Frame Transmission Complete Interrupt Enable */
    word             :1; 
    word             :1; 
    word ECIE        :1;                                       /* Excessive Collision Interrupt Enable */
    word LCIE        :1;                                       /* Late Collision Interrupt Enable */
    word             :1; 
    word MMCIE       :1;                                       /* MII Management Transfer Complete Interrupt Enable */
#endif
  } Bits;
} IMASKSTR;
extern volatile IMASKSTR _IMASK @(REG_BASE + 0x0000014C);
#define IMASK _IMASK.Word
#define IMASK_TXCIE _IMASK.Bits.TXCIE
#define IMASK_ECIE _IMASK.Bits.ECIE
#define IMASK_LCIE _IMASK.Bits.LCIE
#define IMASK_MMCIE _IMASK.Bits.MMCIE
#define IMASK_RXBCIE _IMASK.Bits.RXBCIE
#define IMASK_RXACIE _IMASK.Bits.RXACIE
#define IMASK_RXBOIE _IMASK.Bits.RXBOIE
#define IMASK_RXAOIE _IMASK.Bits.RXAOIE
#define IMASK_RXEIE _IMASK.Bits.RXEIE
#define IMASK_BREIE _IMASK.Bits.BREIE
#define IMASK_RFCIE _IMASK.Bits.RFCIE

#define IMASK_TXCIE_MASK  2
#define IMASK_ECIE_MASK  16
#define IMASK_LCIE_MASK  32
#define IMASK_MMCIE_MASK  128
#define IMASK_RXBCIE_MASK  256
#define IMASK_RXACIE_MASK  512
#define IMASK_RXBOIE_MASK  1024
#define IMASK_RXAOIE_MASK  2048
#define IMASK_RXEIE_MASK  4096
#define IMASK_BREIE_MASK  8192
#define IMASK_RFCIE_MASK  32768


