EPLab/Eco_AccBabyMonitor/BaseStation/FreeScale/Drivers_NE64/MC9S12NE64.h
/*** SWRST - Software Reset; 0x0000014E ***/
typedef union {
  byte Byte;
  struct {
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte MACRST      :1;                                       /* MAC Software Reset */
  } Bits;
} SWRSTSTR;
extern volatile SWRSTSTR _SWRST @(REG_BASE + 0x0000014E);
#define SWRST _SWRST.Byte
#define SWRST_MACRST _SWRST.Bits.MACRST

#define SWRST_MACRST_MASK  128


/*** MPADR - MII PHY Address; 0x00000150 ***/
typedef union {
  byte Byte;
  struct {
    byte PADDR0      :1;                                       /* MII PHY Address Bit 0 */
    byte PADDR1      :1;                                       /* MII PHY Address Bit 1 */
    byte PADDR2      :1;                                       /* MII PHY Address Bit 2 */
    byte PADDR3      :1;                                       /* MII PHY Address Bit 3 */
    byte PADDR4      :1;                                       /* MII PHY Address Bit 4 */
    byte             :1; 
    byte             :1; 
    byte             :1; 
  } Bits;
  struct {
    byte grpPADDR :5;
    byte         :1;
    byte         :1;
    byte         :1;
  } MergedBits;
} MPADRSTR;
extern volatile MPADRSTR _MPADR @(REG_BASE + 0x00000150);
#define MPADR _MPADR.Byte
#define MPADR_PADDR0 _MPADR.Bits.PADDR0
#define MPADR_PADDR1 _MPADR.Bits.PADDR1
#define MPADR_PADDR2 _MPADR.Bits.PADDR2
#define MPADR_PADDR3 _MPADR.Bits.PADDR3
#define MPADR_PADDR4 _MPADR.Bits.PADDR4
#define MPADR_PADDR _MPADR.MergedBits.grpPADDR

#define MPADR_PADDR0_MASK  1
#define MPADR_PADDR1_MASK  2
#define MPADR_PADDR2_MASK  4
#define MPADR_PADDR3_MASK  8
#define MPADR_PADDR4_MASK  16
#define MPADR_PADDR_MASK  31
#define MPADR_PADDR_BITNUM  0


/*** MRADR - MII Register Address; 0x00000151 ***/
typedef union {
  byte Byte;
  struct {
    byte RADDR0      :1;                                       /* MII Register Address Bit 0 */
    byte RADDR1      :1;                                       /* MII Register Address Bit 1 */
    byte RADDR2      :1;                                       /* MII Register Address Bit 2 */
    byte RADDR3      :1;                                       /* MII Register Address Bit 3 */
    byte RADDR4      :1;                                       /* MII Register Address Bit 4 */
    byte             :1; 
    byte             :1; 
    byte             :1; 
  } Bits;
  struct {
    byte grpRADDR :5;
    byte         :1;
    byte         :1;
    byte         :1;
  } MergedBits;
} MRADRSTR;
extern volatile MRADRSTR _MRADR @(REG_BASE + 0x00000151);
#define MRADR _MRADR.Byte
#define MRADR_RADDR0 _MRADR.Bits.RADDR0
#define MRADR_RADDR1 _MRADR.Bits.RADDR1
#define MRADR_RADDR2 _MRADR.Bits.RADDR2
#define MRADR_RADDR3 _MRADR.Bits.RADDR3
#define MRADR_RADDR4 _MRADR.Bits.RADDR4
#define MRADR_RADDR _MRADR.MergedBits.grpRADDR

#define MRADR_RADDR0_MASK  1
#define MRADR_RADDR1_MASK  2
#define MRADR_RADDR2_MASK  4
#define MRADR_RADDR3_MASK  8
#define MRADR_RADDR4_MASK  16
#define MRADR_RADDR_MASK  31
#define MRADR_RADDR_BITNUM  0


/*** MWDATA - MII Write Data; 0x00000152 ***/
typedef union {
  word Word;
  struct {
    word WDATA0      :1;                                       /* MII Write Data Bit 0 */
    word WDATA1      :1;                                       /* MII Write Data Bit 1 */
    word WDATA2      :1;                                       /* MII Write Data Bit 2 */
    word WDATA3      :1;                                       /* MII Write Data Bit 3 */
    word WDATA4      :1;                                       /* MII Write Data Bit 4 */
    word WDATA5      :1;                                       /* MII Write Data Bit 5 */
    word WDATA6      :1;                                       /* MII Write Data Bit 6 */
    word WDATA7      :1;                                       /* MII Write Data Bit 7 */
    word WDATA8      :1;                                       /* MII Write Data Bit 8 */
    word WDATA9      :1;                                       /* MII Write Data Bit 9 */
    word WDATA10     :1;                                       /* MII Write Data Bit 10 */
    word WDATA11     :1;                                       /* MII Write Data Bit 11 */
    word WDATA12     :1;                                       /* MII Write Data Bit 12 */
    word WDATA13     :1;                                       /* MII Write Data Bit 13 */
    word WDATA14     :1;                                       /* MII Write Data Bit 14 */
    word WDATA15     :1;                                       /* MII Write Data Bit 15 */
  } Bits;
  struct {
    word grpWDATA :16;
  } MergedBits;
} MWDATASTR;
extern volatile MWDATASTR _MWDATA @(REG_BASE + 0x00000152);
#define MWDATA _MWDATA.Word
#define MWDATA_WDATA0 _MWDATA.Bits.WDATA0
#define MWDATA_WDATA1 _MWDATA.Bits.WDATA1
#define MWDATA_WDATA2 _MWDATA.Bits.WDATA2
#define MWDATA_WDATA3 _MWDATA.Bits.WDATA3
#define MWDATA_WDATA4 _MWDATA.Bits.WDATA4
#define MWDATA_WDATA5 _MWDATA.Bits.WDATA5
#define MWDATA_WDATA6 _MWDATA.Bits.WDATA6
#define MWDATA_WDATA7 _MWDATA.Bits.WDATA7
#define MWDATA_WDATA8 _MWDATA.Bits.WDATA8
#define MWDATA_WDATA9 _MWDATA.Bits.WDATA9
#define MWDATA_WDATA10 _MWDATA.Bits.WDATA10
#define MWDATA_WDATA11 _MWDATA.Bits.WDATA11
#define MWDATA_WDATA12 _MWDATA.Bits.WDATA12
#define MWDATA_WDATA13 _MWDATA.Bits.WDATA13
#define MWDATA_WDATA14 _MWDATA.Bits.WDATA14
#define MWDATA_WDATA15 _MWDATA.Bits.WDATA15
#define MWDATA_WDATA _MWDATA.MergedBits.grpWDATA

#define MWDATA_WDATA0_MASK  1
#define MWDATA_WDATA1_MASK  2
#define MWDATA_WDATA2_MASK  4
#define MWDATA_WDATA3_MASK  8
#define MWDATA_WDATA4_MASK  16
#define MWDATA_WDATA5_MASK  32
#define MWDATA_WDATA6_MASK  64
#define MWDATA_WDATA7_MASK  128
#define MWDATA_WDATA8_MASK  256
#define MWDATA_WDATA9_MASK  512
#define MWDATA_WDATA10_MASK  1024
#define MWDATA_WDATA11_MASK  2048
#define MWDATA_WDATA12_MASK  4096
#define MWDATA_WDATA13_MASK  8192
#define MWDATA_WDATA14_MASK  16384
#define MWDATA_WDATA15_MASK  32768
#define MWDATA_WDATA_MASK  65535
#define MWDATA_WDATA_BITNUM  0


