EPLab/Eco_AccBabyMonitor/BaseStation/FreeScale/Drivers_NE64/MC9S12NE64.h
/*** MRDATA - MII Read Data; 0x00000154 ***/
typedef union {
  word Word;
  struct {
    word RDATA0      :1;                                       /* MII Read Data Bit 0 */
    word RDATA1      :1;                                       /* MII Read Data Bit 1 */
    word RDATA2      :1;                                       /* MII Read Data Bit 2 */
    word RDATA3      :1;                                       /* MII Read Data Bit 3 */
    word RDATA4      :1;                                       /* MII Read Data Bit 4 */
    word RDATA5      :1;                                       /* MII Read Data Bit 5 */
    word RDATA6      :1;                                       /* MII Read Data Bit 6 */
    word RDATA7      :1;                                       /* MII Read Data Bit 7 */
    word RDATA8      :1;                                       /* MII Read Data Bit 8 */
    word RDATA9      :1;                                       /* MII Read Data Bit 9 */
    word RDATA10     :1;                                       /* MII Read Data Bit 10 */
    word RDATA11     :1;                                       /* MII Read Data Bit 11 */
    word RDATA12     :1;                                       /* MII Read Data Bit 12 */
    word RDATA13     :1;                                       /* MII Read Data Bit 13 */
    word RDATA14     :1;                                       /* MII Read Data Bit 14 */
    word RDATA15     :1;                                       /* MII Read Data Bit 15 */
  } Bits;
  struct {
    word grpRDATA :16;
  } MergedBits;
} MRDATASTR;
extern volatile MRDATASTR _MRDATA @(REG_BASE + 0x00000154);
#define MRDATA _MRDATA.Word
#define MRDATA_RDATA0 _MRDATA.Bits.RDATA0
#define MRDATA_RDATA1 _MRDATA.Bits.RDATA1
#define MRDATA_RDATA2 _MRDATA.Bits.RDATA2
#define MRDATA_RDATA3 _MRDATA.Bits.RDATA3
#define MRDATA_RDATA4 _MRDATA.Bits.RDATA4
#define MRDATA_RDATA5 _MRDATA.Bits.RDATA5
#define MRDATA_RDATA6 _MRDATA.Bits.RDATA6
#define MRDATA_RDATA7 _MRDATA.Bits.RDATA7
#define MRDATA_RDATA8 _MRDATA.Bits.RDATA8
#define MRDATA_RDATA9 _MRDATA.Bits.RDATA9
#define MRDATA_RDATA10 _MRDATA.Bits.RDATA10
#define MRDATA_RDATA11 _MRDATA.Bits.RDATA11
#define MRDATA_RDATA12 _MRDATA.Bits.RDATA12
#define MRDATA_RDATA13 _MRDATA.Bits.RDATA13
#define MRDATA_RDATA14 _MRDATA.Bits.RDATA14
#define MRDATA_RDATA15 _MRDATA.Bits.RDATA15
#define MRDATA_RDATA _MRDATA.MergedBits.grpRDATA

#define MRDATA_RDATA0_MASK  1
#define MRDATA_RDATA1_MASK  2
#define MRDATA_RDATA2_MASK  4
#define MRDATA_RDATA3_MASK  8
#define MRDATA_RDATA4_MASK  16
#define MRDATA_RDATA5_MASK  32
#define MRDATA_RDATA6_MASK  64
#define MRDATA_RDATA7_MASK  128
#define MRDATA_RDATA8_MASK  256
#define MRDATA_RDATA9_MASK  512
#define MRDATA_RDATA10_MASK  1024
#define MRDATA_RDATA11_MASK  2048
#define MRDATA_RDATA12_MASK  4096
#define MRDATA_RDATA13_MASK  8192
#define MRDATA_RDATA14_MASK  16384
#define MRDATA_RDATA15_MASK  32768
#define MRDATA_RDATA_MASK  65535
#define MRDATA_RDATA_BITNUM  0


/*** MCMST - MII Command and Status; 0x00000156 ***/
typedef union {
  byte Byte;
  struct {
    byte MDCSEL0     :1;                                       /* Management Clock Rate Select Bit 0 */
    byte MDCSEL1     :1;                                       /* Management Clock Rate Select Bit 1 */
    byte MDCSEL2     :1;                                       /* Management Clock Rate Select Bit 2 */
    byte MDCSEL3     :1;                                       /* Management Clock Rate Select Bit 3 */
    byte NOPRE       :1;                                       /* No Preamble */
    byte BUSY        :1;                                       /* Operation in Progress */
    byte OP0         :1;                                       /* Operation Code Bit 0 */
    byte OP1         :1;                                       /* Operation Code Bit 1 */
  } Bits;
  struct {
    byte grpMDCSEL :4;
    byte         :1;
    byte         :1;
    byte grpOP   :2;
  } MergedBits;
} MCMSTSTR;
extern volatile MCMSTSTR _MCMST @(REG_BASE + 0x00000156);
#define MCMST _MCMST.Byte
#define MCMST_MDCSEL0 _MCMST.Bits.MDCSEL0
#define MCMST_MDCSEL1 _MCMST.Bits.MDCSEL1
#define MCMST_MDCSEL2 _MCMST.Bits.MDCSEL2
#define MCMST_MDCSEL3 _MCMST.Bits.MDCSEL3
#define MCMST_NOPRE _MCMST.Bits.NOPRE
#define MCMST_BUSY _MCMST.Bits.BUSY
#define MCMST_OP0 _MCMST.Bits.OP0
#define MCMST_OP1 _MCMST.Bits.OP1
#define MCMST_MDCSEL _MCMST.MergedBits.grpMDCSEL
#define MCMST_OP _MCMST.MergedBits.grpOP

#define MCMST_MDCSEL0_MASK  1
#define MCMST_MDCSEL1_MASK  2
#define MCMST_MDCSEL2_MASK  4
#define MCMST_MDCSEL3_MASK  8
#define MCMST_NOPRE_MASK  16
#define MCMST_BUSY_MASK  32
#define MCMST_OP0_MASK  64
#define MCMST_OP1_MASK  128
#define MCMST_MDCSEL_MASK  15
#define MCMST_MDCSEL_BITNUM  0
#define MCMST_OP_MASK  192
#define MCMST_OP_BITNUM  6


/*** BUFCFG - FIFO Buffer Configuration; 0x00000158 ***/
typedef union {
  word Word;
  struct {
    word MAXFL0      :1;                                       /* Receive Maximum Frame Length Bit 0 */
    word MAXFL1      :1;                                       /* Receive Maximum Frame Length Bit 1 */
    word MAXFL2      :1;                                       /* Receive Maximum Frame Length Bit 2 */
    word MAXFL3      :1;                                       /* Receive Maximum Frame Length Bit 3 */
    word MAXFL4      :1;                                       /* Receive Maximum Frame Length Bit 4 */
    word MAXFL5      :1;                                       /* Receive Maximum Frame Length Bit 5 */
    word MAXFL6      :1;                                       /* Receive Maximum Frame Length Bit 6 */
    word MAXFL7      :1;                                       /* Receive Maximum Frame Length Bit 7 */
    word MAXFL8      :1;                                       /* Receive Maximum Frame Length Bit 8 */
    word MAXFL9      :1;                                       /* Receive Maximum Frame Length Bit 9 */
    word MAXFL10     :1;                                       /* Receive Maximum Frame Length Bit 10 */
    word             :1; 
    word BUFMAP0     :1;                                       /* Buffer Size and Starting Address Mapping Bit 0 */
    word BUFMAP1     :1;                                       /* Buffer Size and Starting Address Mapping Bit 1 */
    word BUFMAP2     :1;                                       /* Buffer Size and Starting Address Mapping Bit 2 */
    word BUFMAP3     :1;                                       /* Buffer Size and Starting Address Mapping Bit 3 */
  } Bits;
  struct {
    word grpMAXFL :11;
    word         :1;
    word grpBUFMAP :4;
  } MergedBits;
} BUFCFGSTR;
extern volatile BUFCFGSTR _BUFCFG @(REG_BASE + 0x00000158);
#define BUFCFG _BUFCFG.Word
#define BUFCFG_MAXFL0 _BUFCFG.Bits.MAXFL0
#define BUFCFG_MAXFL1 _BUFCFG.Bits.MAXFL1
#define BUFCFG_MAXFL2 _BUFCFG.Bits.MAXFL2
#define BUFCFG_MAXFL3 _BUFCFG.Bits.MAXFL3
#define BUFCFG_MAXFL4 _BUFCFG.Bits.MAXFL4
#define BUFCFG_MAXFL5 _BUFCFG.Bits.MAXFL5
#define BUFCFG_MAXFL6 _BUFCFG.Bits.MAXFL6
#define BUFCFG_MAXFL7 _BUFCFG.Bits.MAXFL7
#define BUFCFG_MAXFL8 _BUFCFG.Bits.MAXFL8
#define BUFCFG_MAXFL9 _BUFCFG.Bits.MAXFL9
#define BUFCFG_MAXFL10 _BUFCFG.Bits.MAXFL10
#define BUFCFG_BUFMAP0 _BUFCFG.Bits.BUFMAP0
#define BUFCFG_BUFMAP1 _BUFCFG.Bits.BUFMAP1
#define BUFCFG_BUFMAP2 _BUFCFG.Bits.BUFMAP2
#define BUFCFG_BUFMAP3 _BUFCFG.Bits.BUFMAP3
#define BUFCFG_MAXFL _BUFCFG.MergedBits.grpMAXFL
#define BUFCFG_BUFMAP _BUFCFG.MergedBits.grpBUFMAP

#define BUFCFG_MAXFL0_MASK  1
#define BUFCFG_MAXFL1_MASK  2
#define BUFCFG_MAXFL2_MASK  4
#define BUFCFG_MAXFL3_MASK  8
#define BUFCFG_MAXFL4_MASK  16
#define BUFCFG_MAXFL5_MASK  32
#define BUFCFG_MAXFL6_MASK  64
#define BUFCFG_MAXFL7_MASK  128
#define BUFCFG_MAXFL8_MASK  256
#define BUFCFG_MAXFL9_MASK  512
#define BUFCFG_MAXFL10_MASK  1024
#define BUFCFG_BUFMAP0_MASK  4096
#define BUFCFG_BUFMAP1_MASK  8192
#define BUFCFG_BUFMAP2_MASK  16384
#define BUFCFG_BUFMAP3_MASK  32768
#define BUFCFG_MAXFL_MASK  2047
#define BUFCFG_MAXFL_BITNUM  0
#define BUFCFG_BUFMAP_MASK  61440
#define BUFCFG_BUFMAP_BITNUM  12


/*** RXAEFP - Receive A End of Frame Pointer; 0x0000015A ***/
typedef union {
  word Word;
  struct {
    word RXAEFP0     :1;                                       /* Receive A End of Frame Pointer Bit 0 */
    word RXAEFP1     :1;                                       /* Receive A End of Frame Pointer Bit 1 */
    word RXAEFP2     :1;                                       /* Receive A End of Frame Pointer Bit 2 */
    word RXAEFP3     :1;                                       /* Receive A End of Frame Pointer Bit 3 */
    word RXAEFP4     :1;                                       /* Receive A End of Frame Pointer Bit 4 */
    word RXAEFP5     :1;                                       /* Receive A End of Frame Pointer Bit 5 */
    word RXAEFP6     :1;                                       /* Receive A End of Frame Pointer Bit 6 */
    word RXAEFP7     :1;                                       /* Receive A End of Frame Pointer Bit 7 */
    word RXAEFP8     :1;                                       /* Receive A End of Frame Pointer Bit 8 */
    word RXAEFP9     :1;                                       /* Receive A End of Frame Pointer Bit 9 */
    word RXAEFP10    :1;                                       /* Receive A End of Frame Pointer Bit 10 */
    word             :1; 
    word             :1; 
    word             :1; 
    word             :1; 
    word             :1; 
  } Bits;
  struct {
    word grpRXAEFP :11;
    word         :1;
    word         :1;
    word         :1;
    word         :1;
    word         :1;
  } MergedBits;
} RXAEFPSTR;
extern volatile RXAEFPSTR _RXAEFP @(REG_BASE + 0x0000015A);
#define RXAEFP _RXAEFP.Word
#define RXAEFP_RXAEFP0 _RXAEFP.Bits.RXAEFP0
#define RXAEFP_RXAEFP1 _RXAEFP.Bits.RXAEFP1
#define RXAEFP_RXAEFP2 _RXAEFP.Bits.RXAEFP2
#define RXAEFP_RXAEFP3 _RXAEFP.Bits.RXAEFP3
#define RXAEFP_RXAEFP4 _RXAEFP.Bits.RXAEFP4
#define RXAEFP_RXAEFP5 _RXAEFP.Bits.RXAEFP5
#define RXAEFP_RXAEFP6 _RXAEFP.Bits.RXAEFP6
#define RXAEFP_RXAEFP7 _RXAEFP.Bits.RXAEFP7
#define RXAEFP_RXAEFP8 _RXAEFP.Bits.RXAEFP8
#define RXAEFP_RXAEFP9 _RXAEFP.Bits.RXAEFP9
#define RXAEFP_RXAEFP10 _RXAEFP.Bits.RXAEFP10
#define RXAEFP_RXAEFP _RXAEFP.MergedBits.grpRXAEFP

#define RXAEFP_RXAEFP0_MASK  1
#define RXAEFP_RXAEFP1_MASK  2
#define RXAEFP_RXAEFP2_MASK  4
#define RXAEFP_RXAEFP3_MASK  8
#define RXAEFP_RXAEFP4_MASK  16
#define RXAEFP_RXAEFP5_MASK  32
#define RXAEFP_RXAEFP6_MASK  64
#define RXAEFP_RXAEFP7_MASK  128
#define RXAEFP_RXAEFP8_MASK  256
#define RXAEFP_RXAEFP9_MASK  512
#define RXAEFP_RXAEFP10_MASK  1024
#define RXAEFP_RXAEFP_MASK  2047
#define RXAEFP_RXAEFP_BITNUM  0


/*** RXBEFP - Receive B End of Frame Pointer; 0x0000015C ***/
typedef union {
  word Word;
  struct {
    word RXBEFP0     :1;                                       /* Receive B End of Frame Pointer Bit 0 */
    word RXBEFP1     :1;                                       /* Receive B End of Frame Pointer Bit 1 */
    word RXBEFP2     :1;                                       /* Receive B End of Frame Pointer Bit 2 */
    word RXBEFP3     :1;                                       /* Receive B End of Frame Pointer Bit 3 */
    word RXBEFP4     :1;                                       /* Receive B End of Frame Pointer Bit 4 */
    word RXBEFP5     :1;                                       /* Receive B End of Frame Pointer Bit 5 */
    word RXBEFP6     :1;                                       /* Receive B End of Frame Pointer Bit 6 */
    word RXBEFP7     :1;                                       /* Receive B End of Frame Pointer Bit 7 */
    word RXBEFP8     :1;                                       /* Receive B End of Frame Pointer Bit 8 */
    word RXBEFP9     :1;                                       /* Receive B End of Frame Pointer Bit 9 */
    word RXBEFP10    :1;                                       /* Receive B End of Frame Pointer Bit 10 */
    word             :1; 
    word             :1; 
    word             :1; 
    word             :1; 
    word             :1; 
  } Bits;
  struct {
    word grpRXBEFP :11;
    word         :1;
    word         :1;
    word         :1;
    word         :1;
    word         :1;
  } MergedBits;
} RXBEFPSTR;
extern volatile RXBEFPSTR _RXBEFP @(REG_BASE + 0x0000015C);
#define RXBEFP _RXBEFP.Word
#define RXBEFP_RXBEFP0 _RXBEFP.Bits.RXBEFP0
#define RXBEFP_RXBEFP1 _RXBEFP.Bits.RXBEFP1
#define RXBEFP_RXBEFP2 _RXBEFP.Bits.RXBEFP2
#define RXBEFP_RXBEFP3 _RXBEFP.Bits.RXBEFP3
#define RXBEFP_RXBEFP4 _RXBEFP.Bits.RXBEFP4
#define RXBEFP_RXBEFP5 _RXBEFP.Bits.RXBEFP5
#define RXBEFP_RXBEFP6 _RXBEFP.Bits.RXBEFP6
#define RXBEFP_RXBEFP7 _RXBEFP.Bits.RXBEFP7
#define RXBEFP_RXBEFP8 _RXBEFP.Bits.RXBEFP8
#define RXBEFP_RXBEFP9 _RXBEFP.Bits.RXBEFP9
#define RXBEFP_RXBEFP10 _RXBEFP.Bits.RXBEFP10
#define RXBEFP_RXBEFP _RXBEFP.MergedBits.grpRXBEFP

#define RXBEFP_RXBEFP0_MASK  1
#define RXBEFP_RXBEFP1_MASK  2
#define RXBEFP_RXBEFP2_MASK  4
#define RXBEFP_RXBEFP3_MASK  8
#define RXBEFP_RXBEFP4_MASK  16
#define RXBEFP_RXBEFP5_MASK  32
#define RXBEFP_RXBEFP6_MASK  64
#define RXBEFP_RXBEFP7_MASK  128
#define RXBEFP_RXBEFP8_MASK  256
#define RXBEFP_RXBEFP9_MASK  512
#define RXBEFP_RXBEFP10_MASK  1024
#define RXBEFP_RXBEFP_MASK  2047
#define RXBEFP_RXBEFP_BITNUM  0


/*** TXEFP - Transmit End of Frame Pointer; 0x0000015E ***/
typedef union {
  word Word;
  struct {
    word TXEFP0      :1;                                       /* Transmit End of Frame Pointer Bit 0 */
    word TXEFP1      :1;                                       /* Transmit End of Frame Pointer Bit 1 */
    word TXEFP2      :1;                                       /* Transmit End of Frame Pointer Bit 2 */
    word TXEFP3      :1;                                       /* Transmit End of Frame Pointer Bit 3 */
    word TXEFP4      :1;                                       /* Transmit End of Frame Pointer Bit 4 */
    word TXEFP5      :1;                                       /* Transmit End of Frame Pointer Bit 5 */
    word TXEFP6      :1;                                       /* Transmit End of Frame Pointer Bit 6 */
    word TXEFP7      :1;                                       /* Transmit End of Frame Pointer Bit 7 */
    word TXEFP8      :1;                                       /* Transmit End of Frame Pointer Bit 8 */
    word TXEFP9      :1;                                       /* Transmit End of Frame Pointer Bit 9 */
    word TXEFP10     :1;                                       /* Transmit End of Frame Pointer Bit 10 */
    word             :1; 
    word             :1; 
    word             :1; 
    word             :1; 
    word             :1; 
  } Bits;
  struct {
    word grpTXEFP :11;
    word         :1;
    word         :1;
    word         :1;
    word         :1;
    word         :1;
  } MergedBits;
} TXEFPSTR;
