EPLab/Eco_AccBabyMonitor/BaseStation/FreeScale/Drivers_NE64/MC9S12NE64.h
extern volatile TXEFPSTR _TXEFP @(REG_BASE + 0x0000015E);
#define TXEFP _TXEFP.Word
#define TXEFP_TXEFP0 _TXEFP.Bits.TXEFP0
#define TXEFP_TXEFP1 _TXEFP.Bits.TXEFP1
#define TXEFP_TXEFP2 _TXEFP.Bits.TXEFP2
#define TXEFP_TXEFP3 _TXEFP.Bits.TXEFP3
#define TXEFP_TXEFP4 _TXEFP.Bits.TXEFP4
#define TXEFP_TXEFP5 _TXEFP.Bits.TXEFP5
#define TXEFP_TXEFP6 _TXEFP.Bits.TXEFP6
#define TXEFP_TXEFP7 _TXEFP.Bits.TXEFP7
#define TXEFP_TXEFP8 _TXEFP.Bits.TXEFP8
#define TXEFP_TXEFP9 _TXEFP.Bits.TXEFP9
#define TXEFP_TXEFP10 _TXEFP.Bits.TXEFP10
#define TXEFP_TXEFP _TXEFP.MergedBits.grpTXEFP

#define TXEFP_TXEFP0_MASK  1
#define TXEFP_TXEFP1_MASK  2
#define TXEFP_TXEFP2_MASK  4
#define TXEFP_TXEFP3_MASK  8
#define TXEFP_TXEFP4_MASK  16
#define TXEFP_TXEFP5_MASK  32
#define TXEFP_TXEFP6_MASK  64
#define TXEFP_TXEFP7_MASK  128
#define TXEFP_TXEFP8_MASK  256
#define TXEFP_TXEFP9_MASK  512
#define TXEFP_TXEFP10_MASK  1024
#define TXEFP_TXEFP_MASK  2047
#define TXEFP_TXEFP_BITNUM  0


/*** MCHASH3 - Multicast Hash Table Register 3; 0x00000160 ***/
typedef union {
  word Word;
  struct {
    word MCHASH_48   :1;                                       /* Multicast Hash Table Index Bit 48 */
    word MCHASH_49   :1;                                       /* Multicast Hash Table Index Bit 49 */
    word MCHASH_50   :1;                                       /* Multicast Hash Table Index Bit 50 */
    word MCHASH_51   :1;                                       /* Multicast Hash Table Index Bit 51 */
    word MCHASH_52   :1;                                       /* Multicast Hash Table Index Bit 52 */
    word MCHASH_53   :1;                                       /* Multicast Hash Table Index Bit 53 */
    word MCHASH_54   :1;                                       /* Multicast Hash Table Index Bit 54 */
    word MCHASH_55   :1;                                       /* Multicast Hash Table Index Bit 55 */
    word MCHASH_56   :1;                                       /* Multicast Hash Table Index Bit 56 */
    word MCHASH_57   :1;                                       /* Multicast Hash Table Index Bit 57 */
    word MCHASH_58   :1;                                       /* Multicast Hash Table Index Bit 58 */
    word MCHASH_59   :1;                                       /* Multicast Hash Table Index Bit 59 */
    word MCHASH_60   :1;                                       /* Multicast Hash Table Index Bit 60 */
    word MCHASH_61   :1;                                       /* Multicast Hash Table Index Bit 61 */
    word MCHASH_62   :1;                                       /* Multicast Hash Table Index Bit 62 */
    word MCHASH_63   :1;                                       /* Multicast Hash Table Index Bit 63 */
  } Bits;
  struct {
    word grpMCHASH__48 :16;
  } MergedBits;
} MCHASH3STR;
extern volatile MCHASH3STR _MCHASH3 @(REG_BASE + 0x00000160);
#define MCHASH3 _MCHASH3.Word
#define MCHASH3_MCHASH_48 _MCHASH3.Bits.MCHASH_48
#define MCHASH3_MCHASH_49 _MCHASH3.Bits.MCHASH_49
#define MCHASH3_MCHASH_50 _MCHASH3.Bits.MCHASH_50
#define MCHASH3_MCHASH_51 _MCHASH3.Bits.MCHASH_51
#define MCHASH3_MCHASH_52 _MCHASH3.Bits.MCHASH_52
#define MCHASH3_MCHASH_53 _MCHASH3.Bits.MCHASH_53
#define MCHASH3_MCHASH_54 _MCHASH3.Bits.MCHASH_54
#define MCHASH3_MCHASH_55 _MCHASH3.Bits.MCHASH_55
#define MCHASH3_MCHASH_56 _MCHASH3.Bits.MCHASH_56
#define MCHASH3_MCHASH_57 _MCHASH3.Bits.MCHASH_57
#define MCHASH3_MCHASH_58 _MCHASH3.Bits.MCHASH_58
#define MCHASH3_MCHASH_59 _MCHASH3.Bits.MCHASH_59
#define MCHASH3_MCHASH_60 _MCHASH3.Bits.MCHASH_60
#define MCHASH3_MCHASH_61 _MCHASH3.Bits.MCHASH_61
#define MCHASH3_MCHASH_62 _MCHASH3.Bits.MCHASH_62
#define MCHASH3_MCHASH_63 _MCHASH3.Bits.MCHASH_63
#define MCHASH3_MCHASH__48 _MCHASH3.MergedBits.grpMCHASH__48
#define MCHASH3_MCHASH_ MCHASH3_MCHASH__48

#define MCHASH3_MCHASH_48_MASK  1
#define MCHASH3_MCHASH_49_MASK  2
#define MCHASH3_MCHASH_50_MASK  4
#define MCHASH3_MCHASH_51_MASK  8
#define MCHASH3_MCHASH_52_MASK  16
#define MCHASH3_MCHASH_53_MASK  32
#define MCHASH3_MCHASH_54_MASK  64
#define MCHASH3_MCHASH_55_MASK  128
#define MCHASH3_MCHASH_56_MASK  256
#define MCHASH3_MCHASH_57_MASK  512
#define MCHASH3_MCHASH_58_MASK  1024
#define MCHASH3_MCHASH_59_MASK  2048
#define MCHASH3_MCHASH_60_MASK  4096
#define MCHASH3_MCHASH_61_MASK  8192
#define MCHASH3_MCHASH_62_MASK  16384
#define MCHASH3_MCHASH_63_MASK  32768
#define MCHASH3_MCHASH__48_MASK  65535
#define MCHASH3_MCHASH__48_BITNUM  0


/*** MCHASH2 - Multicast Hash Table Register 2; 0x00000162 ***/
typedef union {
  word Word;
  struct {
    word MCHASH_32   :1;                                       /* Multicast Hash Table Index Bit 32 */
    word MCHASH_33   :1;                                       /* Multicast Hash Table Index Bit 33 */
    word MCHASH_34   :1;                                       /* Multicast Hash Table Index Bit 34 */
    word MCHASH_35   :1;                                       /* Multicast Hash Table Index Bit 35 */
    word MCHASH_36   :1;                                       /* Multicast Hash Table Index Bit 36 */
    word MCHASH_37   :1;                                       /* Multicast Hash Table Index Bit 37 */
    word MCHASH_38   :1;                                       /* Multicast Hash Table Index Bit 38 */
    word MCHASH_39   :1;                                       /* Multicast Hash Table Index Bit 39 */
    word MCHASH_40   :1;                                       /* Multicast Hash Table Index Bit 40 */
    word MCHASH_41   :1;                                       /* Multicast Hash Table Index Bit 41 */
    word MCHASH_42   :1;                                       /* Multicast Hash Table Index Bit 42 */
    word MCHASH_43   :1;                                       /* Multicast Hash Table Index Bit 43 */
    word MCHASH_44   :1;                                       /* Multicast Hash Table Index Bit 44 */
    word MCHASH_45   :1;                                       /* Multicast Hash Table Index Bit 45 */
    word MCHASH_46   :1;                                       /* Multicast Hash Table Index Bit 46 */
    word MCHASH_47   :1;                                       /* Multicast Hash Table Index Bit 47 */
  } Bits;
  struct {
    word grpMCHASH__32 :16;
  } MergedBits;
} MCHASH2STR;
extern volatile MCHASH2STR _MCHASH2 @(REG_BASE + 0x00000162);
#define MCHASH2 _MCHASH2.Word
#define MCHASH2_MCHASH_32 _MCHASH2.Bits.MCHASH_32
#define MCHASH2_MCHASH_33 _MCHASH2.Bits.MCHASH_33
#define MCHASH2_MCHASH_34 _MCHASH2.Bits.MCHASH_34
#define MCHASH2_MCHASH_35 _MCHASH2.Bits.MCHASH_35
#define MCHASH2_MCHASH_36 _MCHASH2.Bits.MCHASH_36
#define MCHASH2_MCHASH_37 _MCHASH2.Bits.MCHASH_37
#define MCHASH2_MCHASH_38 _MCHASH2.Bits.MCHASH_38
#define MCHASH2_MCHASH_39 _MCHASH2.Bits.MCHASH_39
#define MCHASH2_MCHASH_40 _MCHASH2.Bits.MCHASH_40
#define MCHASH2_MCHASH_41 _MCHASH2.Bits.MCHASH_41
#define MCHASH2_MCHASH_42 _MCHASH2.Bits.MCHASH_42
#define MCHASH2_MCHASH_43 _MCHASH2.Bits.MCHASH_43
#define MCHASH2_MCHASH_44 _MCHASH2.Bits.MCHASH_44
#define MCHASH2_MCHASH_45 _MCHASH2.Bits.MCHASH_45
#define MCHASH2_MCHASH_46 _MCHASH2.Bits.MCHASH_46
#define MCHASH2_MCHASH_47 _MCHASH2.Bits.MCHASH_47
#define MCHASH2_MCHASH__32 _MCHASH2.MergedBits.grpMCHASH__32
#define MCHASH2_MCHASH_ MCHASH2_MCHASH__32

