EPLab/Eco_AccBabyMonitor/BaseStation/FreeScale/Drivers_NE64/MC9S12NE64.h
#define MCHASH2_MCHASH_32_MASK  1
#define MCHASH2_MCHASH_33_MASK  2
#define MCHASH2_MCHASH_34_MASK  4
#define MCHASH2_MCHASH_35_MASK  8
#define MCHASH2_MCHASH_36_MASK  16
#define MCHASH2_MCHASH_37_MASK  32
#define MCHASH2_MCHASH_38_MASK  64
#define MCHASH2_MCHASH_39_MASK  128
#define MCHASH2_MCHASH_40_MASK  256
#define MCHASH2_MCHASH_41_MASK  512
#define MCHASH2_MCHASH_42_MASK  1024
#define MCHASH2_MCHASH_43_MASK  2048
#define MCHASH2_MCHASH_44_MASK  4096
#define MCHASH2_MCHASH_45_MASK  8192
#define MCHASH2_MCHASH_46_MASK  16384
#define MCHASH2_MCHASH_47_MASK  32768
#define MCHASH2_MCHASH__32_MASK  65535
#define MCHASH2_MCHASH__32_BITNUM  0


/*** MCHASH1 - Multicast Hash Table Register 1; 0x00000164 ***/
typedef union {
  word Word;
  struct {
    word MCHASH_16   :1;                                       /* Multicast Hash Table Index Bit 16 */
    word MCHASH_17   :1;                                       /* Multicast Hash Table Index Bit 17 */
    word MCHASH_18   :1;                                       /* Multicast Hash Table Index Bit 18 */
    word MCHASH_19   :1;                                       /* Multicast Hash Table Index Bit 19 */
    word MCHASH_20   :1;                                       /* Multicast Hash Table Index Bit 20 */
    word MCHASH_21   :1;                                       /* Multicast Hash Table Index Bit 21 */
    word MCHASH_22   :1;                                       /* Multicast Hash Table Index Bit 22 */
    word MCHASH_23   :1;                                       /* Multicast Hash Table Index Bit 23 */
    word MCHASH_24   :1;                                       /* Multicast Hash Table Index Bit 24 */
    word MCHASH_25   :1;                                       /* Multicast Hash Table Index Bit 25 */
    word MCHASH_26   :1;                                       /* Multicast Hash Table Index Bit 26 */
    word MCHASH_27   :1;                                       /* Multicast Hash Table Index Bit 27 */
    word MCHASH_28   :1;                                       /* Multicast Hash Table Index Bit 28 */
    word MCHASH_29   :1;                                       /* Multicast Hash Table Index Bit 29 */
    word MCHASH_30   :1;                                       /* Multicast Hash Table Index Bit 30 */
    word MCHASH_31   :1;                                       /* Multicast Hash Table Index Bit 31 */
  } Bits;
  struct {
    word grpMCHASH__16 :16;
  } MergedBits;
} MCHASH1STR;
extern volatile MCHASH1STR _MCHASH1 @(REG_BASE + 0x00000164);
#define MCHASH1 _MCHASH1.Word
#define MCHASH1_MCHASH_16 _MCHASH1.Bits.MCHASH_16
#define MCHASH1_MCHASH_17 _MCHASH1.Bits.MCHASH_17
#define MCHASH1_MCHASH_18 _MCHASH1.Bits.MCHASH_18
#define MCHASH1_MCHASH_19 _MCHASH1.Bits.MCHASH_19
#define MCHASH1_MCHASH_20 _MCHASH1.Bits.MCHASH_20
#define MCHASH1_MCHASH_21 _MCHASH1.Bits.MCHASH_21
#define MCHASH1_MCHASH_22 _MCHASH1.Bits.MCHASH_22
#define MCHASH1_MCHASH_23 _MCHASH1.Bits.MCHASH_23
#define MCHASH1_MCHASH_24 _MCHASH1.Bits.MCHASH_24
#define MCHASH1_MCHASH_25 _MCHASH1.Bits.MCHASH_25
#define MCHASH1_MCHASH_26 _MCHASH1.Bits.MCHASH_26
#define MCHASH1_MCHASH_27 _MCHASH1.Bits.MCHASH_27
#define MCHASH1_MCHASH_28 _MCHASH1.Bits.MCHASH_28
#define MCHASH1_MCHASH_29 _MCHASH1.Bits.MCHASH_29
#define MCHASH1_MCHASH_30 _MCHASH1.Bits.MCHASH_30
#define MCHASH1_MCHASH_31 _MCHASH1.Bits.MCHASH_31
#define MCHASH1_MCHASH__16 _MCHASH1.MergedBits.grpMCHASH__16
#define MCHASH1_MCHASH_ MCHASH1_MCHASH__16

#define MCHASH1_MCHASH_16_MASK  1
#define MCHASH1_MCHASH_17_MASK  2
#define MCHASH1_MCHASH_18_MASK  4
#define MCHASH1_MCHASH_19_MASK  8
#define MCHASH1_MCHASH_20_MASK  16
#define MCHASH1_MCHASH_21_MASK  32
#define MCHASH1_MCHASH_22_MASK  64
#define MCHASH1_MCHASH_23_MASK  128
#define MCHASH1_MCHASH_24_MASK  256
#define MCHASH1_MCHASH_25_MASK  512
#define MCHASH1_MCHASH_26_MASK  1024
#define MCHASH1_MCHASH_27_MASK  2048
#define MCHASH1_MCHASH_28_MASK  4096
#define MCHASH1_MCHASH_29_MASK  8192
#define MCHASH1_MCHASH_30_MASK  16384
#define MCHASH1_MCHASH_31_MASK  32768
#define MCHASH1_MCHASH__16_MASK  65535
#define MCHASH1_MCHASH__16_BITNUM  0


/*** MCHASH0 - Multicast Hash Table Register 0; 0x00000166 ***/
typedef union {
  word Word;
  struct {
    word MCHASH_0    :1;                                       /* Multicast Hash Table Index Bit 0 */
    word MCHASH_1    :1;                                       /* Multicast Hash Table Index Bit 1 */
    word MCHASH_2    :1;                                       /* Multicast Hash Table Index Bit 2 */
    word MCHASH_3    :1;                                       /* Multicast Hash Table Index Bit 3 */
    word MCHASH_4    :1;                                       /* Multicast Hash Table Index Bit 4 */
    word MCHASH_5    :1;                                       /* Multicast Hash Table Index Bit 5 */
    word MCHASH_6    :1;                                       /* Multicast Hash Table Index Bit 6 */
    word MCHASH_7    :1;                                       /* Multicast Hash Table Index Bit 7 */
    word MCHASH_8    :1;                                       /* Multicast Hash Table Index Bit 8 */
    word MCHASH_9    :1;                                       /* Multicast Hash Table Index Bit 9 */
    word MCHASH_10   :1;                                       /* Multicast Hash Table Index Bit 10 */
    word MCHASH_11   :1;                                       /* Multicast Hash Table Index Bit 11 */
    word MCHASH_12   :1;                                       /* Multicast Hash Table Index Bit 12 */
    word MCHASH_13   :1;                                       /* Multicast Hash Table Index Bit 13 */
    word MCHASH_14   :1;                                       /* Multicast Hash Table Index Bit 14 */
    word MCHASH_15   :1;                                       /* Multicast Hash Table Index Bit 15 */
  } Bits;
  struct {
    word grpMCHASH :16;
  } MergedBits;
} MCHASH0STR;
extern volatile MCHASH0STR _MCHASH0 @(REG_BASE + 0x00000166);
#define MCHASH0 _MCHASH0.Word
#define MCHASH0_MCHASH_0 _MCHASH0.Bits.MCHASH_0
#define MCHASH0_MCHASH_1 _MCHASH0.Bits.MCHASH_1
#define MCHASH0_MCHASH_2 _MCHASH0.Bits.MCHASH_2
#define MCHASH0_MCHASH_3 _MCHASH0.Bits.MCHASH_3
#define MCHASH0_MCHASH_4 _MCHASH0.Bits.MCHASH_4
#define MCHASH0_MCHASH_5 _MCHASH0.Bits.MCHASH_5
#define MCHASH0_MCHASH_6 _MCHASH0.Bits.MCHASH_6
#define MCHASH0_MCHASH_7 _MCHASH0.Bits.MCHASH_7
#define MCHASH0_MCHASH_8 _MCHASH0.Bits.MCHASH_8
#define MCHASH0_MCHASH_9 _MCHASH0.Bits.MCHASH_9
#define MCHASH0_MCHASH_10 _MCHASH0.Bits.MCHASH_10
#define MCHASH0_MCHASH_11 _MCHASH0.Bits.MCHASH_11
#define MCHASH0_MCHASH_12 _MCHASH0.Bits.MCHASH_12
#define MCHASH0_MCHASH_13 _MCHASH0.Bits.MCHASH_13
#define MCHASH0_MCHASH_14 _MCHASH0.Bits.MCHASH_14
#define MCHASH0_MCHASH_15 _MCHASH0.Bits.MCHASH_15
#define MCHASH0_MCHASH _MCHASH0.MergedBits.grpMCHASH

#define MCHASH0_MCHASH_0_MASK  1
#define MCHASH0_MCHASH_1_MASK  2
#define MCHASH0_MCHASH_2_MASK  4
#define MCHASH0_MCHASH_3_MASK  8
#define MCHASH0_MCHASH_4_MASK  16
#define MCHASH0_MCHASH_5_MASK  32
#define MCHASH0_MCHASH_6_MASK  64
#define MCHASH0_MCHASH_7_MASK  128
#define MCHASH0_MCHASH_8_MASK  256
#define MCHASH0_MCHASH_9_MASK  512
#define MCHASH0_MCHASH_10_MASK  1024
#define MCHASH0_MCHASH_11_MASK  2048
#define MCHASH0_MCHASH_12_MASK  4096
#define MCHASH0_MCHASH_13_MASK  8192
#define MCHASH0_MCHASH_14_MASK  16384
#define MCHASH0_MCHASH_15_MASK  32768
#define MCHASH0_MCHASH_MASK  65535
#define MCHASH0_MCHASH_BITNUM  0


/*** MACAD2 - MAC Address Register 2; 0x00000168 ***/
typedef union {
  word Word;
  struct {
    word MACAD_32    :1;                                       /* MAC Address Bit 32 */
    word MACAD_33    :1;                                       /* MAC Address Bit 33 */
    word MACAD_34    :1;                                       /* MAC Address Bit 34 */
    word MACAD_35    :1;                                       /* MAC Address Bit 35 */
    word MACAD_36    :1;                                       /* MAC Address Bit 36 */
    word MACAD_37    :1;                                       /* MAC Address Bit 37 */
    word MACAD_38    :1;                                       /* MAC Address Bit 38 */
    word MACAD_39    :1;                                       /* MAC Address Bit 39 */
    word MACAD_40    :1;                                       /* MAC Address Bit 40 */
    word MACAD_41    :1;                                       /* MAC Address Bit 41 */
    word MACAD_42    :1;                                       /* MAC Address Bit 42 */
    word MACAD_43    :1;                                       /* MAC Address Bit 43 */
    word MACAD_44    :1;                                       /* MAC Address Bit 44 */
    word MACAD_45    :1;                                       /* MAC Address Bit 45 */
    word MACAD_46    :1;                                       /* MAC Address Bit 46 */
    word MACAD_47    :1;                                       /* MAC Address Bit 47 */
  } Bits;
  struct {
    word grpMACAD__32 :16;
  } MergedBits;
} MACAD2STR;
extern volatile MACAD2STR _MACAD2 @(REG_BASE + 0x00000168);
#define MACAD2 _MACAD2.Word
#define MACAD2_MACAD_32 _MACAD2.Bits.MACAD_32
#define MACAD2_MACAD_33 _MACAD2.Bits.MACAD_33
#define MACAD2_MACAD_34 _MACAD2.Bits.MACAD_34
#define MACAD2_MACAD_35 _MACAD2.Bits.MACAD_35
#define MACAD2_MACAD_36 _MACAD2.Bits.MACAD_36
#define MACAD2_MACAD_37 _MACAD2.Bits.MACAD_37
#define MACAD2_MACAD_38 _MACAD2.Bits.MACAD_38
#define MACAD2_MACAD_39 _MACAD2.Bits.MACAD_39
#define MACAD2_MACAD_40 _MACAD2.Bits.MACAD_40
#define MACAD2_MACAD_41 _MACAD2.Bits.MACAD_41
#define MACAD2_MACAD_42 _MACAD2.Bits.MACAD_42
#define MACAD2_MACAD_43 _MACAD2.Bits.MACAD_43
#define MACAD2_MACAD_44 _MACAD2.Bits.MACAD_44
#define MACAD2_MACAD_45 _MACAD2.Bits.MACAD_45
#define MACAD2_MACAD_46 _MACAD2.Bits.MACAD_46
#define MACAD2_MACAD_47 _MACAD2.Bits.MACAD_47
#define MACAD2_MACAD__32 _MACAD2.MergedBits.grpMACAD__32
#define MACAD2_MACAD_ MACAD2_MACAD__32

#define MACAD2_MACAD_32_MASK  1
#define MACAD2_MACAD_33_MASK  2
#define MACAD2_MACAD_34_MASK  4
#define MACAD2_MACAD_35_MASK  8
#define MACAD2_MACAD_36_MASK  16
#define MACAD2_MACAD_37_MASK  32
#define MACAD2_MACAD_38_MASK  64
#define MACAD2_MACAD_39_MASK  128
#define MACAD2_MACAD_40_MASK  256
#define MACAD2_MACAD_41_MASK  512
#define MACAD2_MACAD_42_MASK  1024
#define MACAD2_MACAD_43_MASK  2048
#define MACAD2_MACAD_44_MASK  4096
#define MACAD2_MACAD_45_MASK  8192
#define MACAD2_MACAD_46_MASK  16384
#define MACAD2_MACAD_47_MASK  32768
#define MACAD2_MACAD__32_MASK  65535
#define MACAD2_MACAD__32_BITNUM  0


/*** MACAD1 - MAC Address Register 1; 0x0000016A ***/
typedef union {
  word Word;
  struct {
    word MACAD_16    :1;                                       /* MAC Address Bit 16 */
    word MACAD_17    :1;                                       /* MAC Address Bit 17 */
    word MACAD_18    :1;                                       /* MAC Address Bit 18 */
    word MACAD_19    :1;                                       /* MAC Address Bit 19 */
    word MACAD_20    :1;                                       /* MAC Address Bit 20 */
    word MACAD_21    :1;                                       /* MAC Address Bit 21 */
    word MACAD_22    :1;                                       /* MAC Address Bit 22 */
    word MACAD_23    :1;                                       /* MAC Address Bit 23 */
    word MACAD_24    :1;                                       /* MAC Address Bit 24 */
    word MACAD_25    :1;                                       /* MAC Address Bit 25 */
    word MACAD_26    :1;                                       /* MAC Address Bit 26 */
    word MACAD_27    :1;                                       /* MAC Address Bit 27 */
    word MACAD_28    :1;                                       /* MAC Address Bit 28 */
    word MACAD_29    :1;                                       /* MAC Address Bit 29 */
    word MACAD_30    :1;                                       /* MAC Address Bit 30 */
    word MACAD_31    :1;                                       /* MAC Address Bit 31 */
  } Bits;
  struct {
    word grpMACAD__16 :16;
  } MergedBits;
} MACAD1STR;
extern volatile MACAD1STR _MACAD1 @(REG_BASE + 0x0000016A);
#define MACAD1 _MACAD1.Word
#define MACAD1_MACAD_16 _MACAD1.Bits.MACAD_16
#define MACAD1_MACAD_17 _MACAD1.Bits.MACAD_17
#define MACAD1_MACAD_18 _MACAD1.Bits.MACAD_18
#define MACAD1_MACAD_19 _MACAD1.Bits.MACAD_19
#define MACAD1_MACAD_20 _MACAD1.Bits.MACAD_20
#define MACAD1_MACAD_21 _MACAD1.Bits.MACAD_21
#define MACAD1_MACAD_22 _MACAD1.Bits.MACAD_22
#define MACAD1_MACAD_23 _MACAD1.Bits.MACAD_23
#define MACAD1_MACAD_24 _MACAD1.Bits.MACAD_24
#define MACAD1_MACAD_25 _MACAD1.Bits.MACAD_25
#define MACAD1_MACAD_26 _MACAD1.Bits.MACAD_26
#define MACAD1_MACAD_27 _MACAD1.Bits.MACAD_27
#define MACAD1_MACAD_28 _MACAD1.Bits.MACAD_28
#define MACAD1_MACAD_29 _MACAD1.Bits.MACAD_29
#define MACAD1_MACAD_30 _MACAD1.Bits.MACAD_30
#define MACAD1_MACAD_31 _MACAD1.Bits.MACAD_31
#define MACAD1_MACAD__16 _MACAD1.MergedBits.grpMACAD__16
#define MACAD1_MACAD_ MACAD1_MACAD__16

#define MACAD1_MACAD_16_MASK  1
#define MACAD1_MACAD_17_MASK  2
#define MACAD1_MACAD_18_MASK  4
#define MACAD1_MACAD_19_MASK  8
#define MACAD1_MACAD_20_MASK  16
#define MACAD1_MACAD_21_MASK  32
#define MACAD1_MACAD_22_MASK  64
#define MACAD1_MACAD_23_MASK  128
#define MACAD1_MACAD_24_MASK  256
#define MACAD1_MACAD_25_MASK  512
#define MACAD1_MACAD_26_MASK  1024
#define MACAD1_MACAD_27_MASK  2048
#define MACAD1_MACAD_28_MASK  4096
#define MACAD1_MACAD_29_MASK  8192
#define MACAD1_MACAD_30_MASK  16384
#define MACAD1_MACAD_31_MASK  32768
#define MACAD1_MACAD__16_MASK  65535
#define MACAD1_MACAD__16_BITNUM  0


