EPLab/Eco_AccBabyMonitor/BaseStation/FreeScale/Drivers_NE64/MC9S12NE64.h
/*** MACAD0 - MAC Address Register 0; 0x0000016C ***/
typedef union {
  word Word;
  struct {
    word MACAD_0     :1;                                       /* MAC Address Bit 0 */
    word MACAD_1     :1;                                       /* MAC Address Bit 1 */
    word MACAD_2     :1;                                       /* MAC Address Bit 2 */
    word MACAD_3     :1;                                       /* MAC Address Bit 3 */
    word MACAD_4     :1;                                       /* MAC Address Bit 4 */
    word MACAD_5     :1;                                       /* MAC Address Bit 5 */
    word MACAD_6     :1;                                       /* MAC Address Bit 6 */
    word MACAD_7     :1;                                       /* MAC Address Bit 7 */
    word MACAD_8     :1;                                       /* MAC Address Bit 8 */
    word MACAD_9     :1;                                       /* MAC Address Bit 9 */
    word MACAD_10    :1;                                       /* MAC Address Bit 10 */
    word MACAD_11    :1;                                       /* MAC Address Bit 11 */
    word MACAD_12    :1;                                       /* MAC Address Bit 12 */
    word MACAD_13    :1;                                       /* MAC Address Bit 13 */
    word MACAD_14    :1;                                       /* MAC Address Bit 14 */
    word MACAD_15    :1;                                       /* MAC Address Bit 15 */
  } Bits;
  struct {
    word grpMACAD :16;
  } MergedBits;
} MACAD0STR;
extern volatile MACAD0STR _MACAD0 @(REG_BASE + 0x0000016C);
#define MACAD0 _MACAD0.Word
#define MACAD0_MACAD_0 _MACAD0.Bits.MACAD_0
#define MACAD0_MACAD_1 _MACAD0.Bits.MACAD_1
#define MACAD0_MACAD_2 _MACAD0.Bits.MACAD_2
#define MACAD0_MACAD_3 _MACAD0.Bits.MACAD_3
#define MACAD0_MACAD_4 _MACAD0.Bits.MACAD_4
#define MACAD0_MACAD_5 _MACAD0.Bits.MACAD_5
#define MACAD0_MACAD_6 _MACAD0.Bits.MACAD_6
#define MACAD0_MACAD_7 _MACAD0.Bits.MACAD_7
#define MACAD0_MACAD_8 _MACAD0.Bits.MACAD_8
#define MACAD0_MACAD_9 _MACAD0.Bits.MACAD_9
#define MACAD0_MACAD_10 _MACAD0.Bits.MACAD_10
#define MACAD0_MACAD_11 _MACAD0.Bits.MACAD_11
#define MACAD0_MACAD_12 _MACAD0.Bits.MACAD_12
#define MACAD0_MACAD_13 _MACAD0.Bits.MACAD_13
#define MACAD0_MACAD_14 _MACAD0.Bits.MACAD_14
#define MACAD0_MACAD_15 _MACAD0.Bits.MACAD_15
#define MACAD0_MACAD _MACAD0.MergedBits.grpMACAD

#define MACAD0_MACAD_0_MASK  1
#define MACAD0_MACAD_1_MASK  2
#define MACAD0_MACAD_2_MASK  4
#define MACAD0_MACAD_3_MASK  8
#define MACAD0_MACAD_4_MASK  16
#define MACAD0_MACAD_5_MASK  32
#define MACAD0_MACAD_6_MASK  64
#define MACAD0_MACAD_7_MASK  128
#define MACAD0_MACAD_8_MASK  256
#define MACAD0_MACAD_9_MASK  512
#define MACAD0_MACAD_10_MASK  1024
#define MACAD0_MACAD_11_MASK  2048
#define MACAD0_MACAD_12_MASK  4096
#define MACAD0_MACAD_13_MASK  8192
#define MACAD0_MACAD_14_MASK  16384
#define MACAD0_MACAD_15_MASK  32768
#define MACAD0_MACAD_MASK  65535
#define MACAD0_MACAD_BITNUM  0


/*** EMISC - MAC Address Register 3; 0x0000016E ***/
typedef union {
  word Word;
  struct {
    word EMISC0      :1;                                       /* EMISC Bit 0 */
    word EMISC1      :1;                                       /* EMISC Bit 1 */
    word EMISC2      :1;                                       /* EMISC Bit 2 */
    word EMISC3      :1;                                       /* EMISC Bit 3 */
    word EMISC4      :1;                                       /* EMISC Bit 4 */
    word EMISC5      :1;                                       /* EMISC Bit 5 */
    word EMISC6      :1;                                       /* EMISC Bit 6 */
    word EMISC7      :1;                                       /* EMISC Bit 7 */
    word EMISC8      :1;                                       /* EMISC Bit 8 */
    word EMISC9      :1;                                       /* EMISC Bit 9 */
    word EMISC10     :1;                                       /* EMISC Bit 10 */
    word             :1; 
    word             :1; 
    word INDEX0      :1;                                       /* Miscellaneous Index Bit 0 */
    word INDEX1      :1;                                       /* Miscellaneous Index Bit 1 */
    word INDEX2      :1;                                       /* Miscellaneous Index Bit 2 */
  } Bits;
  struct {
    word grpEMISC :11;
    word         :1;
    word         :1;
    word grpINDEX :3;
  } MergedBits;
} EMISCSTR;
extern volatile EMISCSTR _EMISC @(REG_BASE + 0x0000016E);
#define EMISC                           _EMISC.Word
#define EMISC_EMISC0                    _EMISC.Bits.EMISC0
#define EMISC_EMISC1                    _EMISC.Bits.EMISC1
#define EMISC_EMISC2                    _EMISC.Bits.EMISC2
#define EMISC_EMISC3                    _EMISC.Bits.EMISC3
#define EMISC_EMISC4                    _EMISC.Bits.EMISC4
#define EMISC_EMISC5                    _EMISC.Bits.EMISC5
#define EMISC_EMISC6                    _EMISC.Bits.EMISC6
#define EMISC_EMISC7                    _EMISC.Bits.EMISC7
#define EMISC_EMISC8                    _EMISC.Bits.EMISC8
#define EMISC_EMISC9                    _EMISC.Bits.EMISC9
#define EMISC_EMISC10                   _EMISC.Bits.EMISC10
#define EMISC_INDEX0                    _EMISC.Bits.INDEX0
#define EMISC_INDEX1                    _EMISC.Bits.INDEX1
#define EMISC_INDEX2                    _EMISC.Bits.INDEX2
#define EMISC_EMISC                     _EMISC.MergedBits.grpEMISC
#define EMISC_INDEX                     _EMISC.MergedBits.grpINDEX

#define EMISC_EMISC0_MASK               1
#define EMISC_EMISC1_MASK               2
#define EMISC_EMISC2_MASK               4
#define EMISC_EMISC3_MASK               8
#define EMISC_EMISC4_MASK               16
#define EMISC_EMISC5_MASK               32
#define EMISC_EMISC6_MASK               64
#define EMISC_EMISC7_MASK               128
#define EMISC_EMISC8_MASK               256
#define EMISC_EMISC9_MASK               512
#define EMISC_EMISC10_MASK              1024
#define EMISC_INDEX0_MASK               8192
#define EMISC_INDEX1_MASK               16384
#define EMISC_INDEX2_MASK               32768
#define EMISC_EMISC_MASK                2047
#define EMISC_EMISC_BITNUM              0
#define EMISC_INDEX_MASK                57344
#define EMISC_INDEX_BITNUM              13


/*** PTT - Port T I/O Register; 0x00000240 ***/
typedef union {
  byte Byte;
  struct {
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte PTT4        :1;                                       /* Port T Bit 4 */
    byte PTT5        :1;                                       /* Port T Bit 5 */
    byte PTT6        :1;                                       /* Port T Bit 6 */
    byte PTT7        :1;                                       /* Port T Bit 7 */
  } Bits;
  struct {
    byte         :1;
    byte         :1;
    byte         :1;
    byte         :1;
    byte grpPTT_4 :4;
  } MergedBits;
} PTTSTR;
extern volatile PTTSTR _PTT @(REG_BASE + 0x00000240);
#define PTT _PTT.Byte
#define PTT_PTT4 _PTT.Bits.PTT4
#define PTT_PTT5 _PTT.Bits.PTT5
#define PTT_PTT6 _PTT.Bits.PTT6
#define PTT_PTT7 _PTT.Bits.PTT7
#define PTT_PTT_4 _PTT.MergedBits.grpPTT_4

#define PTT_PTT4_MASK  16
#define PTT_PTT5_MASK  32
#define PTT_PTT6_MASK  64
#define PTT_PTT7_MASK  128
#define PTT_PTT_4_MASK  240
#define PTT_PTT_4_BITNUM  4


/*** PTIT - Port T Input; 0x00000241 ***/
typedef union {
  byte Byte;
  struct {
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte PTIT4       :1;                                       /* Port T Bit 4 */
    byte PTIT5       :1;                                       /* Port T Bit 5 */
    byte PTIT6       :1;                                       /* Port T Bit 6 */
    byte PTIT7       :1;                                       /* Port T Bit 7 */
  } Bits;
  struct {
    byte         :1;
    byte         :1;
    byte         :1;
    byte         :1;
    byte grpPTIT_4 :4;
  } MergedBits;
} PTITSTR;
extern volatile PTITSTR _PTIT @(REG_BASE + 0x00000241);
#define PTIT _PTIT.Byte
#define PTIT_PTIT4 _PTIT.Bits.PTIT4
#define PTIT_PTIT5 _PTIT.Bits.PTIT5
#define PTIT_PTIT6 _PTIT.Bits.PTIT6
#define PTIT_PTIT7 _PTIT.Bits.PTIT7
#define PTIT_PTIT_4 _PTIT.MergedBits.grpPTIT_4

