EPLab/Eco_AccBabyMonitor/BaseStation/FreeScale/Drivers_NE64/MC9S12NE64.h
#define PPSS_PPSS0_MASK  1
#define PPSS_PPSS1_MASK  2
#define PPSS_PPSS2_MASK  4
#define PPSS_PPSS3_MASK  8
#define PPSS_PPSS4_MASK  16
#define PPSS_PPSS5_MASK  32
#define PPSS_PPSS6_MASK  64
#define PPSS_PPSS7_MASK  128
#define PPSS_PPSS_MASK  255
#define PPSS_PPSS_BITNUM  0


/*** WOMS - Port S Wired-Or Mode Register; 0x0000024E ***/
typedef union {
  byte Byte;
  struct {
    byte WOMS0       :1;                                       /* Wired-Or Mode Port S Bit 0 */
    byte WOMS1       :1;                                       /* Wired-Or Mode Port S Bit 1 */
    byte WOMS2       :1;                                       /* Wired-Or Mode Port S Bit 2 */
    byte WOMS3       :1;                                       /* Wired-Or Mode Port S Bit 3 */
    byte WOMS4       :1;                                       /* Wired-Or Mode Port S Bit 4 */
    byte WOMS5       :1;                                       /* Wired-Or Mode Port S Bit 5 */
    byte WOMS6       :1;                                       /* Wired-Or Mode Port S Bit 6 */
    byte WOMS7       :1;                                       /* Wired-Or Mode Port S Bit 7 */
  } Bits;
  struct {
    byte grpWOMS :8;
  } MergedBits;
} WOMSSTR;
extern volatile WOMSSTR _WOMS @(REG_BASE + 0x0000024E);
#define WOMS _WOMS.Byte
#define WOMS_WOMS0 _WOMS.Bits.WOMS0
#define WOMS_WOMS1 _WOMS.Bits.WOMS1
#define WOMS_WOMS2 _WOMS.Bits.WOMS2
#define WOMS_WOMS3 _WOMS.Bits.WOMS3
#define WOMS_WOMS4 _WOMS.Bits.WOMS4
#define WOMS_WOMS5 _WOMS.Bits.WOMS5
#define WOMS_WOMS6 _WOMS.Bits.WOMS6
#define WOMS_WOMS7 _WOMS.Bits.WOMS7
#define WOMS_WOMS _WOMS.MergedBits.grpWOMS

#define WOMS_WOMS0_MASK  1
#define WOMS_WOMS1_MASK  2
#define WOMS_WOMS2_MASK  4
#define WOMS_WOMS3_MASK  8
#define WOMS_WOMS4_MASK  16
#define WOMS_WOMS5_MASK  32
#define WOMS_WOMS6_MASK  64
#define WOMS_WOMS7_MASK  128
#define WOMS_WOMS_MASK  255
#define WOMS_WOMS_BITNUM  0


/*** PTG - Port G I/O Register; 0x00000250 ***/
typedef union {
  byte Byte;
  struct {
    byte PTG0        :1;                                       /* Port T Bit 0 */
    byte PTG1        :1;                                       /* Port T Bit 1 */
    byte PTG2        :1;                                       /* Port T Bit 2 */
    byte PTG3        :1;                                       /* Port T Bit 3 */
    byte PTG4        :1;                                       /* Port T Bit 4 */
    byte PTG5        :1;                                       /* Port T Bit 5 */
    byte PTG6        :1;                                       /* Port T Bit 6 */
    byte PTG7        :1;                                       /* Port T Bit 7 */
  } Bits;
  struct {
    byte grpPTG  :8;
  } MergedBits;
} PTGSTR;
extern volatile PTGSTR _PTG @(REG_BASE + 0x00000250);
#define PTG _PTG.Byte
#define PTG_PTG0 _PTG.Bits.PTG0
#define PTG_PTG1 _PTG.Bits.PTG1
#define PTG_PTG2 _PTG.Bits.PTG2
#define PTG_PTG3 _PTG.Bits.PTG3
#define PTG_PTG4 _PTG.Bits.PTG4
#define PTG_PTG5 _PTG.Bits.PTG5
#define PTG_PTG6 _PTG.Bits.PTG6
#define PTG_PTG7 _PTG.Bits.PTG7
#define PTG_PTG _PTG.MergedBits.grpPTG

#define PTG_PTG0_MASK  1
#define PTG_PTG1_MASK  2
#define PTG_PTG2_MASK  4
#define PTG_PTG3_MASK  8
#define PTG_PTG4_MASK  16
#define PTG_PTG5_MASK  32
#define PTG_PTG6_MASK  64
#define PTG_PTG7_MASK  128
#define PTG_PTG_MASK  255
#define PTG_PTG_BITNUM  0


/*** PTIG - Port G Input; 0x00000251 ***/
typedef union {
  byte Byte;
  struct {
    byte PTIG0       :1;                                       /* Port G Bit 0 */
    byte PTIG1       :1;                                       /* Port G Bit 1 */
    byte PTIG2       :1;                                       /* Port G Bit 2 */
    byte PTIG3       :1;                                       /* Port G Bit 3 */
    byte PTIG4       :1;                                       /* Port G Bit 4 */
    byte PTIG5       :1;                                       /* Port G Bit 5 */
    byte PTIG6       :1;                                       /* Port G Bit 6 */
    byte PTIG7       :1;                                       /* Port G Bit 7 */
  } Bits;
  struct {
    byte grpPTIG :8;
  } MergedBits;
} PTIGSTR;
extern volatile PTIGSTR _PTIG @(REG_BASE + 0x00000251);
#define PTIG _PTIG.Byte
#define PTIG_PTIG0 _PTIG.Bits.PTIG0
#define PTIG_PTIG1 _PTIG.Bits.PTIG1
#define PTIG_PTIG2 _PTIG.Bits.PTIG2
#define PTIG_PTIG3 _PTIG.Bits.PTIG3
#define PTIG_PTIG4 _PTIG.Bits.PTIG4
#define PTIG_PTIG5 _PTIG.Bits.PTIG5
#define PTIG_PTIG6 _PTIG.Bits.PTIG6
#define PTIG_PTIG7 _PTIG.Bits.PTIG7
#define PTIG_PTIG _PTIG.MergedBits.grpPTIG

#define PTIG_PTIG0_MASK  1
#define PTIG_PTIG1_MASK  2
#define PTIG_PTIG2_MASK  4
#define PTIG_PTIG3_MASK  8
#define PTIG_PTIG4_MASK  16
#define PTIG_PTIG5_MASK  32
#define PTIG_PTIG6_MASK  64
#define PTIG_PTIG7_MASK  128
#define PTIG_PTIG_MASK  255
#define PTIG_PTIG_BITNUM  0


/*** DDRG - Port G Data Direction Register; 0x00000252 ***/
typedef union {
  byte Byte;
  struct {
    byte DDRG0       :1;                                       /* Data Direction Port G Bit 0 */
    byte DDRG1       :1;                                       /* Data Direction Port G Bit 1 */
    byte DDRG2       :1;                                       /* Data Direction Port G Bit 2 */
    byte DDRG3       :1;                                       /* Data Direction Port G Bit 3 */
    byte DDRG4       :1;                                       /* Data Direction Port G Bit 4 */
    byte DDRG5       :1;                                       /* Data Direction Port G Bit 5 */
    byte DDRG6       :1;                                       /* Data Direction Port G Bit 6 */
    byte DDRG7       :1;                                       /* Data Direction Port G Bit 7 */
  } Bits;
  struct {
    byte grpDDRG :8;
  } MergedBits;
} DDRGSTR;
extern volatile DDRGSTR _DDRG @(REG_BASE + 0x00000252);
#define DDRG _DDRG.Byte
#define DDRG_DDRG0 _DDRG.Bits.DDRG0
#define DDRG_DDRG1 _DDRG.Bits.DDRG1
#define DDRG_DDRG2 _DDRG.Bits.DDRG2
#define DDRG_DDRG3 _DDRG.Bits.DDRG3
#define DDRG_DDRG4 _DDRG.Bits.DDRG4
#define DDRG_DDRG5 _DDRG.Bits.DDRG5
#define DDRG_DDRG6 _DDRG.Bits.DDRG6
#define DDRG_DDRG7 _DDRG.Bits.DDRG7
#define DDRG_DDRG _DDRG.MergedBits.grpDDRG

