EPLab/Eco_AccBabyMonitor/BaseStation/FreeScale/Drivers_NE64/MC9S12NE64.h
#define DDRG_DDRG0_MASK  1
#define DDRG_DDRG1_MASK  2
#define DDRG_DDRG2_MASK  4
#define DDRG_DDRG3_MASK  8
#define DDRG_DDRG4_MASK  16
#define DDRG_DDRG5_MASK  32
#define DDRG_DDRG6_MASK  64
#define DDRG_DDRG7_MASK  128
#define DDRG_DDRG_MASK  255
#define DDRG_DDRG_BITNUM  0


/*** RDRG - Port G Reduced Drive Register; 0x00000253 ***/
typedef union {
  byte Byte;
  struct {
    byte RDRG0       :1;                                       /* Reduced Drive Port G Bit 0 */
    byte RDRG1       :1;                                       /* Reduced Drive Port G Bit 1 */
    byte RDRG2       :1;                                       /* Reduced Drive Port G Bit 2 */
    byte RDRG3       :1;                                       /* Reduced Drive Port G Bit 3 */
    byte RDRG4       :1;                                       /* Reduced Drive Port G Bit 4 */
    byte RDRG5       :1;                                       /* Reduced Drive Port G Bit 5 */
    byte RDRG6       :1;                                       /* Reduced Drive Port G Bit 6 */
    byte RDRG7       :1;                                       /* Reduced Drive Port G Bit 7 */
  } Bits;
  struct {
    byte grpRDRG :8;
  } MergedBits;
} RDRGSTR;
extern volatile RDRGSTR _RDRG @(REG_BASE + 0x00000253);
#define RDRG _RDRG.Byte
#define RDRG_RDRG0 _RDRG.Bits.RDRG0
#define RDRG_RDRG1 _RDRG.Bits.RDRG1
#define RDRG_RDRG2 _RDRG.Bits.RDRG2
#define RDRG_RDRG3 _RDRG.Bits.RDRG3
#define RDRG_RDRG4 _RDRG.Bits.RDRG4
#define RDRG_RDRG5 _RDRG.Bits.RDRG5
#define RDRG_RDRG6 _RDRG.Bits.RDRG6
#define RDRG_RDRG7 _RDRG.Bits.RDRG7
#define RDRG_RDRG _RDRG.MergedBits.grpRDRG

#define RDRG_RDRG0_MASK  1
#define RDRG_RDRG1_MASK  2
#define RDRG_RDRG2_MASK  4
#define RDRG_RDRG3_MASK  8
#define RDRG_RDRG4_MASK  16
#define RDRG_RDRG5_MASK  32
#define RDRG_RDRG6_MASK  64
#define RDRG_RDRG7_MASK  128
#define RDRG_RDRG_MASK  255
#define RDRG_RDRG_BITNUM  0


/*** PERG - Port G Pull Device Enable Register; 0x00000254 ***/
typedef union {
  byte Byte;
  struct {
    byte PERG0       :1;                                       /* Pull Device Enable Port G Bit 0 */
    byte PERG1       :1;                                       /* Pull Device Enable Port G Bit 1 */
    byte PERG2       :1;                                       /* Pull Device Enable Port G Bit 2 */
    byte PERG3       :1;                                       /* Pull Device Enable Port G Bit 3 */
    byte PERG4       :1;                                       /* Pull Device Enable Port G Bit 4 */
    byte PERG5       :1;                                       /* Pull Device Enable Port G Bit 5 */
    byte PERG6       :1;                                       /* Pull Device Enable Port G Bit 6 */
    byte PERG7       :1;                                       /* Pull Device Enable Port G Bit 7 */
  } Bits;
  struct {
    byte grpPERG :8;
  } MergedBits;
} PERGSTR;
extern volatile PERGSTR _PERG @(REG_BASE + 0x00000254);
#define PERG _PERG.Byte
#define PERG_PERG0 _PERG.Bits.PERG0
#define PERG_PERG1 _PERG.Bits.PERG1
#define PERG_PERG2 _PERG.Bits.PERG2
#define PERG_PERG3 _PERG.Bits.PERG3
#define PERG_PERG4 _PERG.Bits.PERG4
#define PERG_PERG5 _PERG.Bits.PERG5
#define PERG_PERG6 _PERG.Bits.PERG6
#define PERG_PERG7 _PERG.Bits.PERG7
#define PERG_PERG _PERG.MergedBits.grpPERG

#define PERG_PERG0_MASK  1
#define PERG_PERG1_MASK  2
#define PERG_PERG2_MASK  4
#define PERG_PERG3_MASK  8
#define PERG_PERG4_MASK  16
#define PERG_PERG5_MASK  32
#define PERG_PERG6_MASK  64
#define PERG_PERG7_MASK  128
#define PERG_PERG_MASK  255
#define PERG_PERG_BITNUM  0


/*** PPSG - Port G Polarity Select Register; 0x00000255 ***/
typedef union {
  byte Byte;
  struct {
    byte PPSG0       :1;                                       /* Pull Select Port G Bit 0 */
    byte PPSG1       :1;                                       /* Pull Select Port G Bit 1 */
    byte PPSG2       :1;                                       /* Pull Select Port G Bit 2 */
    byte PPSG3       :1;                                       /* Pull Select Port G Bit 3 */
    byte PPSG4       :1;                                       /* Pull Select Port G Bit 4 */
    byte PPSG5       :1;                                       /* Pull Select Port G Bit 5 */
    byte PPSG6       :1;                                       /* Pull Select Port G Bit 6 */
    byte PPSG7       :1;                                       /* Pull Select Port G Bit 7 */
  } Bits;
  struct {
    byte grpPPSG :8;
  } MergedBits;
} PPSGSTR;
extern volatile PPSGSTR _PPSG @(REG_BASE + 0x00000255);
#define PPSG _PPSG.Byte
#define PPSG_PPSG0 _PPSG.Bits.PPSG0
#define PPSG_PPSG1 _PPSG.Bits.PPSG1
#define PPSG_PPSG2 _PPSG.Bits.PPSG2
#define PPSG_PPSG3 _PPSG.Bits.PPSG3
#define PPSG_PPSG4 _PPSG.Bits.PPSG4
#define PPSG_PPSG5 _PPSG.Bits.PPSG5
#define PPSG_PPSG6 _PPSG.Bits.PPSG6
#define PPSG_PPSG7 _PPSG.Bits.PPSG7
#define PPSG_PPSG _PPSG.MergedBits.grpPPSG

#define PPSG_PPSG0_MASK  1
#define PPSG_PPSG1_MASK  2
#define PPSG_PPSG2_MASK  4
#define PPSG_PPSG3_MASK  8
#define PPSG_PPSG4_MASK  16
#define PPSG_PPSG5_MASK  32
#define PPSG_PPSG6_MASK  64
#define PPSG_PPSG7_MASK  128
#define PPSG_PPSG_MASK  255
#define PPSG_PPSG_BITNUM  0


/*** PIEG - Port G Interrupt Enable Register; 0x00000256 ***/
typedef union {
  byte Byte;
  struct {
    byte PIEG0       :1;                                       /* Interrupt Enable Port G Bit 0 */
    byte PIEG1       :1;                                       /* Interrupt Enable Port G Bit 1 */
    byte PIEG2       :1;                                       /* Interrupt Enable Port G Bit 2 */
    byte PIEG3       :1;                                       /* Interrupt Enable Port G Bit 3 */
    byte PIEG4       :1;                                       /* Interrupt Enable Port G Bit 4 */
    byte PIEG5       :1;                                       /* Interrupt Enable Port G Bit 5 */
    byte PIEG6       :1;                                       /* Interrupt Enable Port G Bit 6 */
    byte PIEG7       :1;                                       /* Interrupt Enable Port G Bit 7 */
  } Bits;
  struct {
    byte grpPIEG :8;
  } MergedBits;
} PIEGSTR;
extern volatile PIEGSTR _PIEG @(REG_BASE + 0x00000256);
#define PIEG _PIEG.Byte
#define PIEG_PIEG0 _PIEG.Bits.PIEG0
#define PIEG_PIEG1 _PIEG.Bits.PIEG1
#define PIEG_PIEG2 _PIEG.Bits.PIEG2
#define PIEG_PIEG3 _PIEG.Bits.PIEG3
#define PIEG_PIEG4 _PIEG.Bits.PIEG4
#define PIEG_PIEG5 _PIEG.Bits.PIEG5
#define PIEG_PIEG6 _PIEG.Bits.PIEG6
#define PIEG_PIEG7 _PIEG.Bits.PIEG7
#define PIEG_PIEG _PIEG.MergedBits.grpPIEG

#define PIEG_PIEG0_MASK  1
#define PIEG_PIEG1_MASK  2
#define PIEG_PIEG2_MASK  4
#define PIEG_PIEG3_MASK  8
#define PIEG_PIEG4_MASK  16
#define PIEG_PIEG5_MASK  32
#define PIEG_PIEG6_MASK  64
#define PIEG_PIEG7_MASK  128
#define PIEG_PIEG_MASK  255
#define PIEG_PIEG_BITNUM  0


