EPLab/Eco_AccBabyMonitor/BaseStation/FreeScale/Drivers_NE64/MC9S12NE64.h
/*** PTL - Port L I/O Register; 0x00000268 ***/
typedef union {
  byte Byte;
  struct {
    byte PTL0        :1;                                       /* Port L Bit 0 */
    byte PTL1        :1;                                       /* Port L Bit 1 */
    byte PTL2        :1;                                       /* Port L Bit 2 */
    byte PTL3        :1;                                       /* Port L Bit 3 */
    byte PTL4        :1;                                       /* Port L Bit 4 */
    byte PTL5        :1;                                       /* Port L Bit 5 */
    byte PTL6        :1;                                       /* Port L Bit 6 */
    byte             :1; 
  } Bits;
  struct {
    byte grpPTL  :7;
    byte         :1;
  } MergedBits;
} PTLSTR;
extern volatile PTLSTR _PTL @(REG_BASE + 0x00000268);
#define PTL _PTL.Byte
#define PTL_PTL0 _PTL.Bits.PTL0
#define PTL_PTL1 _PTL.Bits.PTL1
#define PTL_PTL2 _PTL.Bits.PTL2
#define PTL_PTL3 _PTL.Bits.PTL3
#define PTL_PTL4 _PTL.Bits.PTL4
#define PTL_PTL5 _PTL.Bits.PTL5
#define PTL_PTL6 _PTL.Bits.PTL6
#define PTL_PTL _PTL.MergedBits.grpPTL

#define PTL_PTL0_MASK  1
#define PTL_PTL1_MASK  2
#define PTL_PTL2_MASK  4
#define PTL_PTL3_MASK  8
#define PTL_PTL4_MASK  16
#define PTL_PTL5_MASK  32
#define PTL_PTL6_MASK  64
#define PTL_PTL_MASK  127
#define PTL_PTL_BITNUM  0


/*** PTIL - Port L Input; 0x00000269 ***/
typedef union {
  byte Byte;
  struct {
    byte PTIL0       :1;                                       /* Port L Bit 0 */
    byte PTIL1       :1;                                       /* Port L Bit 1 */
    byte PTIL2       :1;                                       /* Port L Bit 2 */
    byte PTIL3       :1;                                       /* Port L Bit 3 */
    byte PTIL4       :1;                                       /* Port L Bit 4 */
    byte PTIL5       :1;                                       /* Port L Bit 5 */
    byte PTIL6       :1;                                       /* Port L Bit 6 */
    byte             :1; 
  } Bits;
  struct {
    byte grpPTIL :7;
    byte         :1;
  } MergedBits;
} PTILSTR;
extern volatile PTILSTR _PTIL @(REG_BASE + 0x00000269);
#define PTIL _PTIL.Byte
#define PTIL_PTIL0 _PTIL.Bits.PTIL0
#define PTIL_PTIL1 _PTIL.Bits.PTIL1
#define PTIL_PTIL2 _PTIL.Bits.PTIL2
#define PTIL_PTIL3 _PTIL.Bits.PTIL3
#define PTIL_PTIL4 _PTIL.Bits.PTIL4
#define PTIL_PTIL5 _PTIL.Bits.PTIL5
#define PTIL_PTIL6 _PTIL.Bits.PTIL6
#define PTIL_PTIL _PTIL.MergedBits.grpPTIL

#define PTIL_PTIL0_MASK  1
#define PTIL_PTIL1_MASK  2
#define PTIL_PTIL2_MASK  4
#define PTIL_PTIL3_MASK  8
#define PTIL_PTIL4_MASK  16
#define PTIL_PTIL5_MASK  32
#define PTIL_PTIL6_MASK  64
#define PTIL_PTIL_MASK  127
#define PTIL_PTIL_BITNUM  0


/*** DDRL - Port L Data Direction Register; 0x0000026A ***/
typedef union {
  byte Byte;
  struct {
    byte DDRL0       :1;                                       /* Data Direction Port L Bit 0 */
    byte DDRL1       :1;                                       /* Data Direction Port L Bit 1 */
    byte DDRL2       :1;                                       /* Data Direction Port L Bit  2 */
    byte DDRL3       :1;                                       /* Data Direction Port L Bit 3 */
    byte DDRL4       :1;                                       /* Data Direction Port L Bit 4 */
    byte DDRL5       :1;                                       /* Data Direction Port L Bit 5 */
    byte DDRL6       :1;                                       /* Data Direction Port L Bit 6 */
    byte             :1; 
  } Bits;
  struct {
    byte grpDDRL :7;
    byte         :1;
  } MergedBits;
} DDRLSTR;
extern volatile DDRLSTR _DDRL @(REG_BASE + 0x0000026A);
#define DDRL _DDRL.Byte
#define DDRL_DDRL0 _DDRL.Bits.DDRL0
#define DDRL_DDRL1 _DDRL.Bits.DDRL1
#define DDRL_DDRL2 _DDRL.Bits.DDRL2
#define DDRL_DDRL3 _DDRL.Bits.DDRL3
#define DDRL_DDRL4 _DDRL.Bits.DDRL4
#define DDRL_DDRL5 _DDRL.Bits.DDRL5
#define DDRL_DDRL6 _DDRL.Bits.DDRL6
#define DDRL_DDRL _DDRL.MergedBits.grpDDRL

#define DDRL_DDRL0_MASK  1
#define DDRL_DDRL1_MASK  2
#define DDRL_DDRL2_MASK  4
#define DDRL_DDRL3_MASK  8
#define DDRL_DDRL4_MASK  16
#define DDRL_DDRL5_MASK  32
#define DDRL_DDRL6_MASK  64
#define DDRL_DDRL_MASK  127
#define DDRL_DDRL_BITNUM  0


/*** RDRL - Port L Reduced Drive Register; 0x0000026B ***/
typedef union {
  byte Byte;
  struct {
    byte RDRL0       :1;                                       /* Reduced Drive Port L Bit 0 */
    byte RDRL1       :1;                                       /* Reduced Drive Port L Bit 1 */
    byte RDRL2       :1;                                       /* Reduced Drive Port L Bit 2 */
    byte RDRL3       :1;                                       /* Reduced Drive Port L Bit 3 */
    byte RDRL4       :1;                                       /* Reduced Drive Port L Bit 4 */
    byte RDRL5       :1;                                       /* Reduced Drive Port L Bit 5 */
    byte RDRL6       :1;                                       /* Reduced Drive Port L Bit 6 */
    byte             :1; 
  } Bits;
  struct {
    byte grpRDRL :7;
    byte         :1;
  } MergedBits;
} RDRLSTR;
extern volatile RDRLSTR _RDRL @(REG_BASE + 0x0000026B);
#define RDRL _RDRL.Byte
#define RDRL_RDRL0 _RDRL.Bits.RDRL0
#define RDRL_RDRL1 _RDRL.Bits.RDRL1
#define RDRL_RDRL2 _RDRL.Bits.RDRL2
#define RDRL_RDRL3 _RDRL.Bits.RDRL3
#define RDRL_RDRL4 _RDRL.Bits.RDRL4
#define RDRL_RDRL5 _RDRL.Bits.RDRL5
#define RDRL_RDRL6 _RDRL.Bits.RDRL6
#define RDRL_RDRL _RDRL.MergedBits.grpRDRL

#define RDRL_RDRL0_MASK  1
#define RDRL_RDRL1_MASK  2
#define RDRL_RDRL2_MASK  4
#define RDRL_RDRL3_MASK  8
#define RDRL_RDRL4_MASK  16
#define RDRL_RDRL5_MASK  32
#define RDRL_RDRL6_MASK  64
#define RDRL_RDRL_MASK  127
#define RDRL_RDRL_BITNUM  0


/*** PERL - Port L Pull Device Enable Register; 0x0000026C ***/
typedef union {
  byte Byte;
  struct {
    byte PERL0       :1;                                       /* Pull Device Enable Port L Bit 0 */
    byte PERL1       :1;                                       /* Pull Device Enable Port L Bit 1 */
    byte PERL2       :1;                                       /* Pull Device Enable Port L Bit 2 */
    byte PERL3       :1;                                       /* Pull Device Enable Port L Bit 3 */
    byte PERL4       :1;                                       /* Pull Device Enable Port L Bit 4 */
    byte PERL5       :1;                                       /* Pull Device Enable Port L Bit 5 */
    byte PERL6       :1;                                       /* Pull Device Enable Port L Bit 6 */
    byte             :1; 
  } Bits;
  struct {
    byte grpPERL :7;
    byte         :1;
  } MergedBits;
} PERLSTR;
