EPLab/Eco_AccBabyMonitor/BaseStation/FreeScale/Drivers_NE64/MC9S12NE64.h
extern volatile PERLSTR _PERL @(REG_BASE + 0x0000026C);
#define PERL _PERL.Byte
#define PERL_PERL0 _PERL.Bits.PERL0
#define PERL_PERL1 _PERL.Bits.PERL1
#define PERL_PERL2 _PERL.Bits.PERL2
#define PERL_PERL3 _PERL.Bits.PERL3
#define PERL_PERL4 _PERL.Bits.PERL4
#define PERL_PERL5 _PERL.Bits.PERL5
#define PERL_PERL6 _PERL.Bits.PERL6
#define PERL_PERL _PERL.MergedBits.grpPERL

#define PERL_PERL0_MASK  1
#define PERL_PERL1_MASK  2
#define PERL_PERL2_MASK  4
#define PERL_PERL3_MASK  8
#define PERL_PERL4_MASK  16
#define PERL_PERL5_MASK  32
#define PERL_PERL6_MASK  64
#define PERL_PERL_MASK  127
#define PERL_PERL_BITNUM  0


/*** PPSL - Port L Polarity Select Register; 0x0000026D ***/
typedef union {
  byte Byte;
  struct {
    byte PPSL0       :1;                                       /* Pull Select Port L Bit 0 */
    byte PPSL1       :1;                                       /* Pull Select Port L Bit 1 */
    byte PPSL2       :1;                                       /* Pull Select Port L Bit 2 */
    byte PPSL3       :1;                                       /* Pull Select Port L Bit 3 */
    byte PPSL4       :1;                                       /* Pull Select Port L Bit 4 */
    byte PPSL5       :1;                                       /* Pull Select Port L Bit 5 */
    byte PPSL6       :1;                                       /* Pull Select Port L Bit 6 */
    byte             :1; 
  } Bits;
  struct {
    byte grpPPSL :7;
    byte         :1;
  } MergedBits;
} PPSLSTR;
extern volatile PPSLSTR _PPSL @(REG_BASE + 0x0000026D);
#define PPSL _PPSL.Byte
#define PPSL_PPSL0 _PPSL.Bits.PPSL0
#define PPSL_PPSL1 _PPSL.Bits.PPSL1
#define PPSL_PPSL2 _PPSL.Bits.PPSL2
#define PPSL_PPSL3 _PPSL.Bits.PPSL3
#define PPSL_PPSL4 _PPSL.Bits.PPSL4
#define PPSL_PPSL5 _PPSL.Bits.PPSL5
#define PPSL_PPSL6 _PPSL.Bits.PPSL6
#define PPSL_PPSL _PPSL.MergedBits.grpPPSL

#define PPSL_PPSL0_MASK  1
#define PPSL_PPSL1_MASK  2
#define PPSL_PPSL2_MASK  4
#define PPSL_PPSL3_MASK  8
#define PPSL_PPSL4_MASK  16
#define PPSL_PPSL5_MASK  32
#define PPSL_PPSL6_MASK  64
#define PPSL_PPSL_MASK  127
#define PPSL_PPSL_BITNUM  0


/*** WOML - Port L Wired-Or Mode Register; 0x0000026E ***/
typedef union {
  byte Byte;
  struct {
    byte WOML0       :1;                                       /* Wired-Or Mode Port L Bit 0 */
    byte WOML1       :1;                                       /* Wired-Or Mode Port L Bit 1 */
    byte WOML2       :1;                                       /* Wired-Or Mode Port L Bit 2 */
    byte WOML3       :1;                                       /* Wired-Or Mode Port L Bit 3 */
    byte WOML4       :1;                                       /* Wired-Or Mode Port L Bit 4 */
    byte WOML5       :1;                                       /* Wired-Or Mode Port L Bit 5 */
    byte WOML6       :1;                                       /* Wired-Or Mode Port L Bit 6 */
    byte             :1; 
  } Bits;
  struct {
    byte grpWOML :7;
    byte         :1;
  } MergedBits;
} WOMLSTR;
extern volatile WOMLSTR _WOML @(REG_BASE + 0x0000026E);
#define WOML _WOML.Byte
#define WOML_WOML0 _WOML.Bits.WOML0
#define WOML_WOML1 _WOML.Bits.WOML1
#define WOML_WOML2 _WOML.Bits.WOML2
#define WOML_WOML3 _WOML.Bits.WOML3
#define WOML_WOML4 _WOML.Bits.WOML4
#define WOML_WOML5 _WOML.Bits.WOML5
#define WOML_WOML6 _WOML.Bits.WOML6
#define WOML_WOML _WOML.MergedBits.grpWOML

#define WOML_WOML0_MASK  1
#define WOML_WOML1_MASK  2
#define WOML_WOML2_MASK  4
#define WOML_WOML3_MASK  8
#define WOML_WOML4_MASK  16
#define WOML_WOML5_MASK  32
#define WOML_WOML6_MASK  64
#define WOML_WOML_MASK  127
#define WOML_WOML_BITNUM  0


  /* Watchdog reset macro */
#ifdef _lint
  #define __RESET_WATCHDOG()  /* empty */
#else
  #define __RESET_WATCHDOG() {asm sta COPCTL;}  /* Just write a byte to feed the dog */
#endif


#endif

